; ModuleID = 'minimal.c'
source_filename = "minimal.c"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx15.0.0"

@.str = private unnamed_addr constant [16 x i8] c"Value of x: %d\0A\00", align 1, !dbg !0

; Function Attrs: noinline nounwind ssp uwtable(sync)
define i32 @main() #0 !dbg !253 {
entry:
  %retval = alloca i32, align 4
  %x = alloca i32, align 4
  store i32 0, ptr %retval, align 4
    #dbg_declare(ptr %x, !257, !DIExpression(), !258)
  store i32 42, ptr %x, align 4, !dbg !258
  %0 = load i32, ptr %x, align 4, !dbg !259
  %call = call i32 (ptr, ...) @printf(ptr noundef @.str, i32 noundef %0), !dbg !260
  ret i32 0, !dbg !261
}

declare i32 @printf(ptr noundef, ...) #1

attributes #0 = { noinline nounwind ssp uwtable(sync) "frame-pointer"="non-leaf" "no-trapping-math"="true" "stack-protector-buffer-size"="8" "target-cpu"="apple-m1" "target-features"="+aes,+altnzcv,+ccdp,+ccidx,+complxnum,+crc,+dit,+dotprod,+flagm,+fp-armv8,+fp16fml,+fptoint,+fullfp16,+jsconv,+lse,+neon,+pauth,+perfmon,+predres,+ras,+rcpc,+rdm,+sb,+sha2,+sha3,+specrestrict,+ssbs,+v8.1a,+v8.2a,+v8.3a,+v8.4a,+v8a,+zcm,+zcz" }
attributes #1 = { "frame-pointer"="non-leaf" "no-trapping-math"="true" "stack-protector-buffer-size"="8" "target-cpu"="apple-m1" "target-features"="+aes,+altnzcv,+ccdp,+ccidx,+complxnum,+crc,+dit,+dotprod,+flagm,+fp-armv8,+fp16fml,+fptoint,+fullfp16,+jsconv,+lse,+neon,+pauth,+perfmon,+predres,+ras,+rcpc,+rdm,+sb,+sha2,+sha3,+specrestrict,+ssbs,+v8.1a,+v8.2a,+v8.3a,+v8.4a,+v8a,+zcm,+zcz" }

!llvm.dbg.cu = !{!7}
!llvm.module.flags = !{!246, !247, !248, !249, !250, !251}
!llvm.ident = !{!252}

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 6, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "minimal.c", directory: "/Users/judeelmasr/githubwor/dev-repo/llvm/llvm/lib/transforms/seminalinputpass", checksumkind: CSK_MD5, checksum: "f392ab25371d9da96e8403aed41bf05a")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 16)
!7 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Homebrew clang version 19.1.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !8, globals: !245, splitDebugInlining: false, nameTableKind: Apple, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk", sdk: "MacOSX15.sdk")
!8 = !{!9, !12, !14, !16, !18, !20, !22, !24, !26, !28, !29, !30, !37, !38, !39, !40, !42, !45, !46, !47, !48, !49, !50, !51, !52, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !73, !77, !88, !95, !102, !109, !113, !117, !121, !128, !132, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !151, !153, !154, !155, !157, !159, !161, !163, !165, !167, !169, !171, !173, !175, !177, !178, !179, !180, !181, !182, !183, !184, !185, !187, !189, !191, !196, !240, !241, !243}
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !10, line: 28, baseType: !11)
!10 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/arm/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "b270144f57ae258d0ce80b8f87be068c")
!11 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !10, line: 32, baseType: !13)
!13 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !10, line: 33, baseType: !15)
!15 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !10, line: 34, baseType: !17)
!17 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !10, line: 35, baseType: !19)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !10, line: 36, baseType: !21)
!21 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !10, line: 37, baseType: !23)
!23 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !10, line: 38, baseType: !25)
!25 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !10, line: 40, baseType: !27)
!27 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_natural_t", file: !10, line: 41, baseType: !21)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ct_rune_t", file: !10, line: 61, baseType: !19)
!30 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !10, line: 67, size: 1024, elements: !31)
!31 = !{!32, !36}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !30, file: !10, line: 68, baseType: !33, size: 1024)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !30, file: !10, line: 69, baseType: !23, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !10, line: 70, baseType: !30)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mbstate_t", file: !10, line: 72, baseType: !37)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ptrdiff_t", file: !10, line: 77, baseType: !27)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !10, line: 87, baseType: !41)
!41 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_va_list", file: !10, line: 95, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !2, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wchar_t", file: !10, line: 103, baseType: !19)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_rune_t", file: !10, line: 108, baseType: !45)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wint_t", file: !10, line: 111, baseType: !19)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_clock_t", file: !10, line: 116, baseType: !41)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_socklen_t", file: !10, line: 117, baseType: !20)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ssize_t", file: !10, line: 118, baseType: !27)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !10, line: 119, baseType: !27)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blkcnt_t", file: !53, line: 67, baseType: !22)
!53 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "af82ff6119a9fa80fad635d276556d46")
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blksize_t", file: !53, line: 68, baseType: !18)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_dev_t", file: !53, line: 69, baseType: !18)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_fsblkcnt_t", file: !53, line: 70, baseType: !21)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_fsfilcnt_t", file: !53, line: 71, baseType: !21)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_gid_t", file: !53, line: 72, baseType: !20)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_id_t", file: !53, line: 73, baseType: !20)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ino64_t", file: !53, line: 74, baseType: !24)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ino_t", file: !53, line: 76, baseType: !60)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mach_port_name_t", file: !53, line: 80, baseType: !28)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mach_port_t", file: !53, line: 81, baseType: !62)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mode_t", file: !53, line: 82, baseType: !16)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !53, line: 83, baseType: !22)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pid_t", file: !53, line: 84, baseType: !18)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_sigset_t", file: !53, line: 85, baseType: !20)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_suseconds_t", file: !53, line: 86, baseType: !18)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uid_t", file: !53, line: 87, baseType: !20)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_useconds_t", file: !53, line: 88, baseType: !20)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uuid_t", file: !53, line: 89, baseType: !72)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 128, elements: !5)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uuid_string_t", file: !53, line: 90, baseType: !74)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 37)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_pthread_handler_rec", file: !78, line: 57, size: 192, elements: !79)
!78 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_pthread/_pthread_types.h", directory: "", checksumkind: CSK_MD5, checksum: "4e2ea0e1af95894da0a6030a21a8ebee")
!79 = !{!80, !85, !86}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__routine", scope: !77, file: !78, line: 58, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !84}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__arg", scope: !77, file: !78, line: 59, baseType: !84, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !77, file: !78, line: 60, baseType: !87, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_attr_t", file: !78, line: 63, size: 512, elements: !89)
!89 = !{!90, !91}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !88, file: !78, line: 64, baseType: !27, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !88, file: !78, line: 65, baseType: !92, size: 448, offset: 64)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 56)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_cond_t", file: !78, line: 68, size: 384, elements: !96)
!96 = !{!97, !98}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !95, file: !78, line: 69, baseType: !27, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !95, file: !78, line: 70, baseType: !99, size: 320, offset: 64)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 40)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_condattr_t", file: !78, line: 73, size: 128, elements: !103)
!103 = !{!104, !105}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !102, file: !78, line: 74, baseType: !27, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !102, file: !78, line: 75, baseType: !106, size: 64, offset: 64)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 8)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_mutex_t", file: !78, line: 78, size: 512, elements: !110)
!110 = !{!111, !112}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !109, file: !78, line: 79, baseType: !27, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !109, file: !78, line: 80, baseType: !92, size: 448, offset: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_mutexattr_t", file: !78, line: 83, size: 128, elements: !114)
!114 = !{!115, !116}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !113, file: !78, line: 84, baseType: !27, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !113, file: !78, line: 85, baseType: !106, size: 64, offset: 64)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_once_t", file: !78, line: 88, size: 128, elements: !118)
!118 = !{!119, !120}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !117, file: !78, line: 89, baseType: !27, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !117, file: !78, line: 90, baseType: !106, size: 64, offset: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_rwlock_t", file: !78, line: 93, size: 1600, elements: !122)
!122 = !{!123, !124}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !121, file: !78, line: 94, baseType: !27, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !121, file: !78, line: 95, baseType: !125, size: 1536, offset: 64)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1536, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 192)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_rwlockattr_t", file: !78, line: 98, size: 192, elements: !129)
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !128, file: !78, line: 99, baseType: !27, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !128, file: !78, line: 100, baseType: !3, size: 128, offset: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_t", file: !78, line: 103, size: 65536, elements: !133)
!133 = !{!134, !135, !136}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !132, file: !78, line: 104, baseType: !27, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup_stack", scope: !132, file: !78, line: 105, baseType: !87, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !132, file: !78, line: 106, baseType: !137, size: 65408, offset: 128)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 65408, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 8176)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_attr_t", file: !78, line: 109, baseType: !88)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_cond_t", file: !78, line: 110, baseType: !95)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_condattr_t", file: !78, line: 111, baseType: !102)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_key_t", file: !78, line: 112, baseType: !41)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_mutex_t", file: !78, line: 113, baseType: !109)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_mutexattr_t", file: !78, line: 114, baseType: !113)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_once_t", file: !78, line: 115, baseType: !117)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_rwlock_t", file: !78, line: 116, baseType: !121)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_rwlockattr_t", file: !78, line: 117, baseType: !128)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_t", file: !78, line: 118, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_nl_item", file: !152, line: 40, baseType: !19)
!152 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "bd2087c8ee278624cee561f95099160e")
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctrans_t", file: !152, line: 41, baseType: !19)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctype_t", file: !152, line: 43, baseType: !20)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !156, line: 30, baseType: !11)
!156 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5052dfe782b50fed2355b8f61a9e4fa9")
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !158, line: 30, baseType: !15)
!158 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "47ed3c3ac6f65bfec021ca2b7be18e7e")
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !160, line: 30, baseType: !19)
!160 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "d23e8406e80ee79983f28509c741fa17")
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !162, line: 30, baseType: !23)
!162 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e6d85c1a9e23dbf7518ce3b162aac800")
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int8_t", file: !164, line: 30, baseType: !13)
!164 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_u_int8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "cf25460e3a2d25a50de2bd9cd0738ad8")
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int16_t", file: !166, line: 30, baseType: !17)
!166 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_u_int16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "20fb61aa655de1ae21f6fe1799ea5928")
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int32_t", file: !168, line: 30, baseType: !21)
!168 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_u_int32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "1be414e13025ba0d11004877ba3f558a")
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int64_t", file: !170, line: 30, baseType: !25)
!170 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_u_int64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "466f994226288d9979ea32e237e3f3c2")
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "register_t", file: !172, line: 66, baseType: !161)
!172 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/arm/types.h", directory: "", checksumkind: CSK_MD5, checksum: "bd345bb749b5098b0f191abe2c0d3eb4")
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !174, line: 32, baseType: !26)
!174 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_intptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e478ba47270923b1cca6659f19f02db1")
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !176, line: 34, baseType: !41)
!176 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e70ae655dd1b9d4ae0b1dcc073f5b7e4")
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_addr_t", file: !172, line: 77, baseType: !169)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_size_t", file: !172, line: 78, baseType: !169)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_ssize_t", file: !172, line: 79, baseType: !161)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_long_t", file: !172, line: 80, baseType: !161)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_ulong_t", file: !172, line: 81, baseType: !169)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_time_t", file: !172, line: 82, baseType: !161)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_off_t", file: !172, line: 83, baseType: !161)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "syscall_arg_t", file: !172, line: 105, baseType: !169)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !186, line: 44, baseType: !42)
!186 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "41825c2dccdd98a1587ce428cded44de")
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !188, line: 50, baseType: !40)
!188 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "f7981334d28e0c246f35cd24042aa2a4")
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !190, line: 83, baseType: !65)
!190 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "3d165ce37807d123c2b5ed4c31060b16")
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !190, line: 94, size: 128, elements: !192)
!192 = !{!193, !195}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !191, file: !190, line: 95, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !191, file: !190, line: 96, baseType: !19, size: 32, offset: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !190, line: 128, size: 1216, elements: !197)
!197 = !{!198, !199, !200, !201, !202, !203, !204, !205, !206, !210, !214, !218, !224, !225, !228, !229, !233, !237, !238, !239}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !196, file: !190, line: 129, baseType: !194, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !196, file: !190, line: 130, baseType: !19, size: 32, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !196, file: !190, line: 131, baseType: !19, size: 32, offset: 96)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !196, file: !190, line: 132, baseType: !15, size: 16, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !196, file: !190, line: 133, baseType: !15, size: 16, offset: 144)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !196, file: !190, line: 134, baseType: !191, size: 128, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !196, file: !190, line: 135, baseType: !19, size: 32, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !196, file: !190, line: 138, baseType: !84, size: 64, offset: 384)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !196, file: !190, line: 139, baseType: !207, size: 64, offset: 448)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!19, !84}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !196, file: !190, line: 140, baseType: !211, size: 64, offset: 512)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!19, !84, !44, !19}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !196, file: !190, line: 141, baseType: !215, size: 64, offset: 576)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!189, !84, !189, !19}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !196, file: !190, line: 142, baseType: !219, size: 64, offset: 640)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!19, !84, !222, !19}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !196, file: !190, line: 145, baseType: !191, size: 128, offset: 704)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !196, file: !190, line: 146, baseType: !226, size: 64, offset: 832)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !190, line: 100, flags: DIFlagFwdDecl)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !196, file: !190, line: 147, baseType: !19, size: 32, offset: 896)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !196, file: !190, line: 150, baseType: !230, size: 24, offset: 928)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 24, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 3)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !196, file: !190, line: 151, baseType: !234, size: 8, offset: 952)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 8, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 1)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !196, file: !190, line: 154, baseType: !191, size: 128, offset: 960)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !196, file: !190, line: 157, baseType: !19, size: 32, offset: 1088)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !196, file: !190, line: 158, baseType: !189, size: 64, offset: 1152)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !190, line: 159, baseType: !196)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !242, line: 31, baseType: !65)
!242 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_off_t.h", directory: "", checksumkind: CSK_MD5, checksum: "0468c56924902d4782b467d48c54d211")
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !244, line: 31, baseType: !50)
!244 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_ssize_t.h", directory: "", checksumkind: CSK_MD5, checksum: "9b4f5bef81dd94a882775a3ce650ab9c")
!245 = !{!0}
!246 = !{i32 7, !"Dwarf Version", i32 5}
!247 = !{i32 2, !"Debug Info Version", i32 3}
!248 = !{i32 1, !"wchar_size", i32 4}
!249 = !{i32 8, !"PIC Level", i32 2}
!250 = !{i32 7, !"uwtable", i32 1}
!251 = !{i32 7, !"frame-pointer", i32 1}
!252 = !{!"Homebrew clang version 19.1.4"}
!253 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 4, type: !254, scopeLine: 4, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !256)
!254 = !DISubroutineType(types: !255)
!255 = !{!19}
!256 = !{}
!257 = !DILocalVariable(name: "x", scope: !253, file: !2, line: 5, type: !19)
!258 = !DILocation(line: 5, column: 9, scope: !253)
!259 = !DILocation(line: 6, column: 32, scope: !253)
!260 = !DILocation(line: 6, column: 5, scope: !253)
!261 = !DILocation(line: 7, column: 5, scope: !253)
