; ModuleID = 'test5.c'
source_filename = "test5.c"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx15.0.0"

%struct.node = type { i32, ptr }

@head = global ptr null, align 8, !dbg !0
@.str = private unnamed_addr constant [15 x i8] c"list is empty\0A\00", align 1, !dbg !783
@.str.1 = private unnamed_addr constant [5 x i8] c"%d->\00", align 1, !dbg !788
@.str.2 = private unnamed_addr constant [6 x i8] c"NULL\0A\00", align 1, !dbg !793
@.str.3 = private unnamed_addr constant [20 x i8] c"number of nodes %d\0A\00", align 1, !dbg !798
@.str.4 = private unnamed_addr constant [37 x i8] c"list is empty and nothing to delete\0A\00", align 1, !dbg !803
@.str.5 = private unnamed_addr constant [27 x i8] c"Unable to allocate memory.\00", align 1, !dbg !805
@.str.6 = private unnamed_addr constant [28 x i8] c"DATA INSERTED SUCCESSFULLY\0A\00", align 1, !dbg !810
@.str.7 = private unnamed_addr constant [23 x i8] c"Sum of elements is %d\0A\00", align 1, !dbg !815
@.str.8 = private unnamed_addr constant [294 x i8] c"\0A1. Insert new item. 2. Delete item. 3. Search item. 4. Insert Last. 5. Print. 6.Delete Last 7.Delete First 8.Insert After 9.Print Linked List in Reverse way. 10.Sum 11.Make the linked list reverse 12.Exit\0A--------------------------------------------------------------------------------------\0A\00", align 1, !dbg !820
@.str.9 = private unnamed_addr constant [24 x i8] c"enter choice of input: \00", align 1, !dbg !825

!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !14, line: 37, baseType: !26)
!26 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !14, line: 38, baseType: !28)
!28 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !14, line: 40, baseType: !30)
!30 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_natural_t", file: !14, line: 41, baseType: !7)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ct_rune_t", file: !14, line: 61, baseType: !23)
!33 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !14, line: 67, size: 1024, elements: !34)
!34 = !{!35, !40}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !33, file: !14, line: 68, baseType: !36, size: 1024)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 1024, elements: !38)
!37 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!38 = !{!39}
!39 = !DISubrange(count: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !33, file: !14, line: 69, baseType: !26, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !14, line: 70, baseType: !33)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mbstate_t", file: !14, line: 72, baseType: !41)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ptrdiff_t", file: !14, line: 77, baseType: !30)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !14, line: 87, baseType: !45)
!45 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_va_list", file: !14, line: 95, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wchar_t", file: !14, line: 103, baseType: !23)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_rune_t", file: !14, line: 108, baseType: !49)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wint_t", file: !14, line: 111, baseType: !23)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_clock_t", file: !14, line: 116, baseType: !45)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_socklen_t", file: !14, line: 117, baseType: !24)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ssize_t", file: !14, line: 118, baseType: !30)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !14, line: 119, baseType: !30)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blkcnt_t", file: !57, line: 67, baseType: !25)
!57 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "af82ff6119a9fa80fad635d276556d46")
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blksize_t", file: !57, line: 68, baseType: !22)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_dev_t", file: !57, line: 69, baseType: !22)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_fsblkcnt_t", file: !57, line: 70, baseType: !7)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_fsfilcnt_t", file: !57, line: 71, baseType: !7)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_gid_t", file: !57, line: 72, baseType: !24)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_id_t", file: !57, line: 73, baseType: !24)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ino64_t", file: !57, line: 74, baseType: !27)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ino_t", file: !57, line: 76, baseType: !64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mach_port_name_t", file: !57, line: 80, baseType: !31)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mach_port_t", file: !57, line: 81, baseType: !66)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mode_t", file: !57, line: 82, baseType: !20)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !57, line: 83, baseType: !25)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pid_t", file: !57, line: 84, baseType: !22)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_sigset_t", file: !57, line: 85, baseType: !24)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_suseconds_t", file: !57, line: 86, baseType: !22)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uid_t", file: !57, line: 87, baseType: !24)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_useconds_t", file: !57, line: 88, baseType: !24)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uuid_t", file: !57, line: 89, baseType: !76)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 128, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 16)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uuid_string_t", file: !57, line: 90, baseType: !80)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 296, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 37)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_pthread_handler_rec", file: !84, line: 57, size: 192, elements: !85)
!84 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_pthread/_pthread_types.h", directory: "", checksumkind: CSK_MD5, checksum: "4e2ea0e1af95894da0a6030a21a8ebee")
!85 = !{!86, !91, !92}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__routine", scope: !83, file: !84, line: 58, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{null, !90}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__arg", scope: !83, file: !84, line: 59, baseType: !90, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !83, file: !84, line: 60, baseType: !93, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_attr_t", file: !84, line: 63, size: 512, elements: !95)
!95 = !{!96, !97}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !94, file: !84, line: 64, baseType: !30, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !94, file: !84, line: 65, baseType: !98, size: 448, offset: 64)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 448, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 56)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_cond_t", file: !84, line: 68, size: 384, elements: !102)
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !101, file: !84, line: 69, baseType: !30, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !101, file: !84, line: 70, baseType: !105, size: 320, offset: 64)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 320, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 40)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_condattr_t", file: !84, line: 73, size: 128, elements: !109)
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !108, file: !84, line: 74, baseType: !30, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !108, file: !84, line: 75, baseType: !112, size: 64, offset: 64)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 64, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 8)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_mutex_t", file: !84, line: 78, size: 512, elements: !116)
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !115, file: !84, line: 79, baseType: !30, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !115, file: !84, line: 80, baseType: !98, size: 448, offset: 64)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_mutexattr_t", file: !84, line: 83, size: 128, elements: !120)
!120 = !{!121, !122}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !119, file: !84, line: 84, baseType: !30, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !119, file: !84, line: 85, baseType: !112, size: 64, offset: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_once_t", file: !84, line: 88, size: 128, elements: !124)
!124 = !{!125, !126}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !123, file: !84, line: 89, baseType: !30, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !123, file: !84, line: 90, baseType: !112, size: 64, offset: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_rwlock_t", file: !84, line: 93, size: 1600, elements: !128)
!128 = !{!129, !130}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !127, file: !84, line: 94, baseType: !30, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !127, file: !84, line: 95, baseType: !131, size: 1536, offset: 64)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 1536, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 192)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_rwlockattr_t", file: !84, line: 98, size: 192, elements: !135)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !134, file: !84, line: 99, baseType: !30, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !134, file: !84, line: 100, baseType: !138, size: 128, offset: 64)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 128, elements: !77)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_t", file: !84, line: 103, size: 65536, elements: !140)
!140 = !{!141, !142, !143}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !139, file: !84, line: 104, baseType: !30, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup_stack", scope: !139, file: !84, line: 105, baseType: !93, size: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !139, file: !84, line: 106, baseType: !144, size: 65408, offset: 128)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 65408, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 8176)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_attr_t", file: !84, line: 109, baseType: !94)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_cond_t", file: !84, line: 110, baseType: !101)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_condattr_t", file: !84, line: 111, baseType: !108)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_key_t", file: !84, line: 112, baseType: !45)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_mutex_t", file: !84, line: 113, baseType: !115)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_mutexattr_t", file: !84, line: 114, baseType: !119)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_once_t", file: !84, line: 115, baseType: !123)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_rwlock_t", file: !84, line: 116, baseType: !127)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_rwlockattr_t", file: !84, line: 117, baseType: !134)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_t", file: !84, line: 118, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_nl_item", file: !159, line: 40, baseType: !23)
!159 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "bd2087c8ee278624cee561f95099160e")
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctrans_t", file: !159, line: 41, baseType: !23)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctype_t", file: !159, line: 43, baseType: !24)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !163, line: 30, baseType: !15)
!163 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5052dfe782b50fed2355b8f61a9e4fa9")
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !165, line: 30, baseType: !19)
!165 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "47ed3c3ac6f65bfec021ca2b7be18e7e")
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !167, line: 30, baseType: !23)
!167 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "d23e8406e80ee79983f28509c741fa17")
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !169, line: 30, baseType: !26)
!169 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e6d85c1a9e23dbf7518ce3b162aac800")
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int8_t", file: !171, line: 30, baseType: !17)
!171 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_u_int8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "cf25460e3a2d25a50de2bd9cd0738ad8")
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int16_t", file: !173, line: 30, baseType: !21)
!173 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_u_int16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "20fb61aa655de1ae21f6fe1799ea5928")
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int32_t", file: !175, line: 30, baseType: !7)
!175 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_u_int32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "1be414e13025ba0d11004877ba3f558a")
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int64_t", file: !177, line: 30, baseType: !28)
!177 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_u_int64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "466f994226288d9979ea32e237e3f3c2")
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "register_t", file: !179, line: 66, baseType: !168)
!179 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/arm/types.h", directory: "", checksumkind: CSK_MD5, checksum: "bd345bb749b5098b0f191abe2c0d3eb4")
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !181, line: 32, baseType: !29)
!181 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_intptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e478ba47270923b1cca6659f19f02db1")
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !183, line: 34, baseType: !45)
!183 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e70ae655dd1b9d4ae0b1dcc073f5b7e4")
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_addr_t", file: !179, line: 77, baseType: !176)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_size_t", file: !179, line: 78, baseType: !176)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_ssize_t", file: !179, line: 79, baseType: !168)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_long_t", file: !179, line: 80, baseType: !168)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_ulong_t", file: !179, line: 81, baseType: !176)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_time_t", file: !179, line: 82, baseType: !168)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_off_t", file: !179, line: 83, baseType: !168)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "syscall_arg_t", file: !179, line: 105, baseType: !176)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !193, line: 44, baseType: !46)
!193 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "41825c2dccdd98a1587ce428cded44de")
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !195, line: 50, baseType: !44)
!195 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "f7981334d28e0c246f35cd24042aa2a4")
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !197, line: 83, baseType: !69)
!197 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "3d165ce37807d123c2b5ed4c31060b16")
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !197, line: 94, size: 128, elements: !199)
!199 = !{!200, !202}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !198, file: !197, line: 95, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !198, file: !197, line: 96, baseType: !23, size: 32, offset: 64)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !197, line: 128, size: 1216, elements: !204)
!204 = !{!205, !206, !207, !208, !209, !210, !211, !212, !213, !217, !221, !225, !231, !232, !235, !236, !240, !244, !245, !246}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !203, file: !197, line: 129, baseType: !201, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !203, file: !197, line: 130, baseType: !23, size: 32, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !203, file: !197, line: 131, baseType: !23, size: 32, offset: 96)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !203, file: !197, line: 132, baseType: !19, size: 16, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !203, file: !197, line: 133, baseType: !19, size: 16, offset: 144)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !203, file: !197, line: 134, baseType: !198, size: 128, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !203, file: !197, line: 135, baseType: !23, size: 32, offset: 320)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !203, file: !197, line: 138, baseType: !90, size: 64, offset: 384)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !203, file: !197, line: 139, baseType: !214, size: 64, offset: 448)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!23, !90}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !203, file: !197, line: 140, baseType: !218, size: 64, offset: 512)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!23, !90, !48, !23}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !203, file: !197, line: 141, baseType: !222, size: 64, offset: 576)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!196, !90, !196, !23}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !203, file: !197, line: 142, baseType: !226, size: 64, offset: 640)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!23, !90, !229, !23}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !203, file: !197, line: 145, baseType: !198, size: 128, offset: 704)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !203, file: !197, line: 146, baseType: !233, size: 64, offset: 832)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !197, line: 100, flags: DIFlagFwdDecl)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !203, file: !197, line: 147, baseType: !23, size: 32, offset: 896)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !203, file: !197, line: 150, baseType: !237, size: 24, offset: 928)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 24, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 3)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !203, file: !197, line: 151, baseType: !241, size: 8, offset: 952)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 1)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !203, file: !197, line: 154, baseType: !198, size: 128, offset: 960)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !203, file: !197, line: 157, baseType: !23, size: 32, offset: 1088)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !203, file: !197, line: 158, baseType: !196, size: 64, offset: 1152)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !197, line: 159, baseType: !203)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !249, line: 31, baseType: !69)
!249 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_off_t.h", directory: "", checksumkind: CSK_MD5, checksum: "0468c56924902d4782b467d48c54d211")
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !251, line: 31, baseType: !54)
!251 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_ssize_t.h", directory: "", checksumkind: CSK_MD5, checksum: "9b4f5bef81dd94a882775a3ce650ab9c")
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "idtype_t", file: !6, line: 83, baseType: !5)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !254, line: 31, baseType: !70)
!254 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_pid_t.h", directory: "", checksumkind: CSK_MD5, checksum: "86a3851b3039dd75e6cc5a8b4f2b3461")
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "id_t", file: !256, line: 31, baseType: !63)
!256 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_id_t.h", directory: "", checksumkind: CSK_MD5, checksum: "985e35d2b2c7e6ea13869fc8cd0b5949")
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !258, line: 17, baseType: !23)
!258 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/arm/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "802a7d5a263aebe8f27d5d67c7ad4b44")
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_exception_state", file: !260, line: 41, size: 96, elements: !261)
!260 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/mach/arm/_structs.h", directory: "", checksumkind: CSK_MD5, checksum: "fc9233eb351901bd9aae4f5912643825")
!261 = !{!262, !263, !264}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__exception", scope: !259, file: !260, line: 43, baseType: !24, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__fsr", scope: !259, file: !260, line: 44, baseType: !24, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "__far", scope: !259, file: !260, line: 45, baseType: !24, size: 32, offset: 64)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_exception_state64", file: !260, line: 59, size: 128, elements: !266)
!266 = !{!267, !268, !269}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "__far", scope: !265, file: !260, line: 61, baseType: !27, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__esr", scope: !265, file: !260, line: 62, baseType: !24, size: 32, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "__exception", scope: !265, file: !260, line: 63, baseType: !24, size: 32, offset: 96)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_exception_state64_v2", file: !260, line: 66, size: 128, elements: !271)
!271 = !{!272, !273}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__far", scope: !270, file: !260, line: 68, baseType: !27, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__esr", scope: !270, file: !260, line: 69, baseType: !27, size: 64, offset: 64)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_thread_state", file: !260, line: 89, size: 544, elements: !275)
!275 = !{!276, !280, !281, !282, !283}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__r", scope: !274, file: !260, line: 91, baseType: !277, size: 416)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 416, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 13)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__sp", scope: !274, file: !260, line: 92, baseType: !24, size: 32, offset: 416)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__lr", scope: !274, file: !260, line: 93, baseType: !24, size: 32, offset: 448)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__pc", scope: !274, file: !260, line: 94, baseType: !24, size: 32, offset: 480)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__cpsr", scope: !274, file: !260, line: 95, baseType: !24, size: 32, offset: 512)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_thread_state64", file: !260, line: 148, size: 2176, elements: !285)
!285 = !{!286, !290, !291, !292, !293, !294, !295}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "__x", scope: !284, file: !260, line: 150, baseType: !287, size: 1856)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1856, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 29)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__fp", scope: !284, file: !260, line: 151, baseType: !27, size: 64, offset: 1856)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__lr", scope: !284, file: !260, line: 152, baseType: !27, size: 64, offset: 1920)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__sp", scope: !284, file: !260, line: 153, baseType: !27, size: 64, offset: 1984)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__pc", scope: !284, file: !260, line: 154, baseType: !27, size: 64, offset: 2048)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__cpsr", scope: !284, file: !260, line: 155, baseType: !24, size: 32, offset: 2112)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__pad", scope: !284, file: !260, line: 156, baseType: !24, size: 32, offset: 2144)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_vfp_state", file: !260, line: 519, size: 2080, elements: !297)
!297 = !{!298, !302}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__r", scope: !296, file: !260, line: 521, baseType: !299, size: 2048)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 2048, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__fpscr", scope: !296, file: !260, line: 522, baseType: !24, size: 32, offset: 2048)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_neon_state64", file: !260, line: 538, size: 4224, elements: !304)
!304 = !{!305, !311, !312}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__v", scope: !303, file: !260, line: 540, baseType: !306, size: 4096)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 4096, elements: !309)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint128_t", file: !3, baseType: !308)
!308 = !DIBasicType(name: "unsigned __int128", size: 128, encoding: DW_ATE_unsigned)
!309 = !{!310}
!310 = !DISubrange(count: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__fpsr", scope: !303, file: !260, line: 541, baseType: !24, size: 32, offset: 4096)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "__fpcr", scope: !303, file: !260, line: 542, baseType: !24, size: 32, offset: 4128)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_neon_state", file: !260, line: 545, size: 2176, elements: !314)
!314 = !{!315, !317, !318}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__v", scope: !313, file: !260, line: 547, baseType: !316, size: 2048)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 2048, elements: !77)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "__fpsr", scope: !313, file: !260, line: 548, baseType: !24, size: 32, offset: 2048)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__fpcr", scope: !313, file: !260, line: 549, baseType: !24, size: 32, offset: 2080)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__arm_pagein_state", file: !260, line: 609, size: 32, elements: !320)
!320 = !{!321}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__pagein_error", scope: !319, file: !260, line: 611, baseType: !23, size: 32)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__arm_legacy_debug_state", file: !260, line: 646, size: 2048, elements: !323)
!323 = !{!324, !326, !327, !328}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__bvr", scope: !322, file: !260, line: 648, baseType: !325, size: 512)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 512, elements: !77)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "__bcr", scope: !322, file: !260, line: 649, baseType: !325, size: 512, offset: 512)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "__wvr", scope: !322, file: !260, line: 650, baseType: !325, size: 512, offset: 1024)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__wcr", scope: !322, file: !260, line: 651, baseType: !325, size: 512, offset: 1536)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_debug_state32", file: !260, line: 669, size: 2112, elements: !330)
!330 = !{!331, !332, !333, !334, !335}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__bvr", scope: !329, file: !260, line: 671, baseType: !325, size: 512)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__bcr", scope: !329, file: !260, line: 672, baseType: !325, size: 512, offset: 512)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__wvr", scope: !329, file: !260, line: 673, baseType: !325, size: 512, offset: 1024)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__wcr", scope: !329, file: !260, line: 674, baseType: !325, size: 512, offset: 1536)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__mdscr_el1", scope: !329, file: !260, line: 675, baseType: !27, size: 64, offset: 2048)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_debug_state64", file: !260, line: 679, size: 4160, elements: !337)
!337 = !{!338, !340, !341, !342, !343}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "__bvr", scope: !336, file: !260, line: 681, baseType: !339, size: 1024)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1024, elements: !77)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__bcr", scope: !336, file: !260, line: 682, baseType: !339, size: 1024, offset: 1024)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__wvr", scope: !336, file: !260, line: 683, baseType: !339, size: 1024, offset: 2048)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "__wcr", scope: !336, file: !260, line: 684, baseType: !339, size: 1024, offset: 3072)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "__mdscr_el1", scope: !336, file: !260, line: 685, baseType: !27, size: 64, offset: 4096)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_cpmu_state64", file: !260, line: 711, size: 1024, elements: !345)
!345 = !{!346}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__ctrs", scope: !344, file: !260, line: 713, baseType: !339, size: 1024)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_mcontext32", file: !348, line: 41, size: 2720, elements: !349)
!348 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/arm/_mcontext.h", directory: "", checksumkind: CSK_MD5, checksum: "da7c261f76f98eb3bbd7ed11c4aaa3d8")
!349 = !{!350, !351, !352}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__es", scope: !347, file: !348, line: 43, baseType: !259, size: 96)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__ss", scope: !347, file: !348, line: 44, baseType: !274, size: 544, offset: 96)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__fs", scope: !347, file: !348, line: 45, baseType: !296, size: 2080, offset: 640)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_mcontext64", file: !348, line: 64, size: 6528, elements: !354)
!354 = !{!355, !356, !357}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__es", scope: !353, file: !348, line: 66, baseType: !265, size: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__ss", scope: !353, file: !348, line: 67, baseType: !284, size: 2176, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__ns", scope: !353, file: !348, line: 68, baseType: !303, size: 4224, offset: 2304)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "mcontext_t", file: !348, line: 85, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_attr_t", file: !361, line: 31, baseType: !147)
!361 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_pthread/_pthread_attr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "383e78324250b910a1128f1b9a464b23")
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_sigaltstack", file: !363, line: 42, size: 192, elements: !364)
!363 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_sigaltstack.h", directory: "", checksumkind: CSK_MD5, checksum: "d308a81f239c930cbd1b1f2eee3fc6c1")
!364 = !{!365, !366, !367}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ss_sp", scope: !362, file: !363, line: 44, baseType: !90, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ss_size", scope: !362, file: !363, line: 45, baseType: !44, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ss_flags", scope: !362, file: !363, line: 46, baseType: !23, size: 32, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "stack_t", file: !363, line: 48, baseType: !362)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_ucontext", file: !370, line: 43, size: 448, elements: !371)
!370 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_ucontext.h", directory: "", checksumkind: CSK_MD5, checksum: "c9464687b003449106b679928ca1b348")
!371 = !{!372, !373, !374, !375, !377, !378}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "uc_onstack", scope: !369, file: !370, line: 45, baseType: !23, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "uc_sigmask", scope: !369, file: !370, line: 46, baseType: !71, size: 32, offset: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "uc_stack", scope: !369, file: !370, line: 47, baseType: !362, size: 192, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "uc_link", scope: !369, file: !370, line: 48, baseType: !376, size: 64, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "uc_mcsize", scope: !369, file: !370, line: 49, baseType: !44, size: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "uc_mcontext", scope: !369, file: !370, line: 50, baseType: !359, size: 64, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucontext_t", file: !370, line: 57, baseType: !369)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !381, line: 31, baseType: !71)
!381 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "437b33d322f60e932c1e1199626d9393")
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !383, line: 31, baseType: !73)
!383 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_uid_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2a704f772d04abefb01de36d246e45dd")
!384 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !385, line: 158, size: 64, elements: !386)
!385 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "541f2577a63933b8824579532ef86917")
!386 = !{!387, !388}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !384, file: !385, line: 160, baseType: !23, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !384, file: !385, line: 161, baseType: !90, size: 64)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigevent", file: !385, line: 168, size: 256, elements: !390)
!390 = !{!391, !392, !393, !394, !398}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_notify", scope: !389, file: !385, line: 169, baseType: !23, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_signo", scope: !389, file: !385, line: 170, baseType: !23, size: 32, offset: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_value", scope: !389, file: !385, line: 171, baseType: !384, size: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_notify_function", scope: !389, file: !385, line: 172, baseType: !395, size: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !384}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_notify_attributes", scope: !389, file: !385, line: 173, baseType: !399, size: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__siginfo", file: !385, line: 177, size: 832, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409, !410, !411}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !400, file: !385, line: 178, baseType: !23, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !400, file: !385, line: 179, baseType: !23, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !400, file: !385, line: 180, baseType: !23, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !400, file: !385, line: 181, baseType: !253, size: 32, offset: 96)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !400, file: !385, line: 182, baseType: !382, size: 32, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !400, file: !385, line: 183, baseType: !23, size: 32, offset: 160)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !400, file: !385, line: 184, baseType: !90, size: 64, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "si_value", scope: !400, file: !385, line: 185, baseType: !384, size: 64, offset: 256)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !400, file: !385, line: 186, baseType: !30, size: 64, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "__pad", scope: !400, file: !385, line: 187, baseType: !412, size: 448, offset: 384)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 448, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 7)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !385, line: 188, baseType: !400)
!416 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__sigaction_u", file: !385, line: 269, size: 64, elements: !417)
!417 = !{!418, !422}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "__sa_handler", scope: !416, file: !385, line: 270, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !23}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "__sa_sigaction", scope: !416, file: !385, line: 271, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !23, !426, !90}
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sigaction", file: !385, line: 276, size: 192, elements: !428)
!428 = !{!429, !430, !435, !436}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_u", scope: !427, file: !385, line: 277, baseType: !416, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "sa_tramp", scope: !427, file: !385, line: 278, baseType: !431, size: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{null, !90, !23, !23, !434, !90}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !427, file: !385, line: 279, baseType: !380, size: 32, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !427, file: !385, line: 280, baseType: !23, size: 32, offset: 160)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !385, line: 286, size: 128, elements: !438)
!438 = !{!439, !440, !441}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_u", scope: !437, file: !385, line: 287, baseType: !416, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !437, file: !385, line: 288, baseType: !380, size: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !437, file: !385, line: 289, baseType: !23, size: 32, offset: 96)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_t", file: !385, line: 331, baseType: !419)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigvec", file: !385, line: 348, size: 128, elements: !444)
!444 = !{!445, !446, !447}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "sv_handler", scope: !443, file: !385, line: 349, baseType: !419, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "sv_mask", scope: !443, file: !385, line: 350, baseType: !23, size: 32, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !443, file: !385, line: 351, baseType: !23, size: 32, offset: 96)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigstack", file: !385, line: 367, size: 128, elements: !449)
!449 = !{!450, !451}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ss_sp", scope: !448, file: !385, line: 368, baseType: !48, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ss_onstack", scope: !448, file: !385, line: 369, baseType: !23, size: 32, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !453, line: 31, baseType: !17)
!453 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8b64ccf8c67b8c006b07b8daf1b49be5")
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !455, line: 31, baseType: !21)
!455 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "f0aa926da906b10566dd3171bf347ab7")
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !457, line: 31, baseType: !7)
!457 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "0254eb80c6b9719ac45c3c1cf872109b")
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !459, line: 31, baseType: !28)
!459 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "77fc5e91653260959605f129691cf9b1")
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !461, line: 29, baseType: !162)
!461 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "042ceedaf4137a8aaa272d0b27434016")
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !461, line: 30, baseType: !164)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !461, line: 31, baseType: !166)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !461, line: 32, baseType: !168)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !461, line: 33, baseType: !452)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !461, line: 34, baseType: !454)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !461, line: 35, baseType: !456)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !461, line: 36, baseType: !458)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !461, line: 40, baseType: !162)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !461, line: 41, baseType: !164)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !461, line: 42, baseType: !166)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !461, line: 43, baseType: !168)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !461, line: 44, baseType: !452)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !461, line: 45, baseType: !454)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !461, line: 46, baseType: !456)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !461, line: 47, baseType: !458)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !478, line: 32, baseType: !30)
!478 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_intmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e37b9240f30f486478152ef3989b1545")
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !480, line: 32, baseType: !45)
!480 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uintmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8217a3fbb207d8e87ca5318c313e81c2")
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !482, line: 34, size: 128, elements: !483)
!482 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "24f84d4e0450b2e5ff976a6f6da860d2")
!483 = !{!484, !485}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !481, file: !482, line: 36, baseType: !55, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !481, file: !482, line: 37, baseType: !72, size: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "rlim_t", file: !487, line: 89, baseType: !27)
!487 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/resource.h", directory: "", checksumkind: CSK_MD5, checksum: "c4e799a130a69d94f00fda9cbd994906")
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage", file: !487, line: 152, size: 1152, elements: !489)
!489 = !{!490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ru_utime", scope: !488, file: !487, line: 153, baseType: !481, size: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ru_stime", scope: !488, file: !487, line: 154, baseType: !481, size: 128, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ru_maxrss", scope: !488, file: !487, line: 163, baseType: !30, size: 64, offset: 256)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ru_ixrss", scope: !488, file: !487, line: 165, baseType: !30, size: 64, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ru_idrss", scope: !488, file: !487, line: 166, baseType: !30, size: 64, offset: 384)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ru_isrss", scope: !488, file: !487, line: 167, baseType: !30, size: 64, offset: 448)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ru_minflt", scope: !488, file: !487, line: 168, baseType: !30, size: 64, offset: 512)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ru_majflt", scope: !488, file: !487, line: 169, baseType: !30, size: 64, offset: 576)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nswap", scope: !488, file: !487, line: 170, baseType: !30, size: 64, offset: 640)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ru_inblock", scope: !488, file: !487, line: 171, baseType: !30, size: 64, offset: 704)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ru_oublock", scope: !488, file: !487, line: 172, baseType: !30, size: 64, offset: 768)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgsnd", scope: !488, file: !487, line: 173, baseType: !30, size: 64, offset: 832)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgrcv", scope: !488, file: !487, line: 174, baseType: !30, size: 64, offset: 896)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nsignals", scope: !488, file: !487, line: 175, baseType: !30, size: 64, offset: 960)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nvcsw", scope: !488, file: !487, line: 176, baseType: !30, size: 64, offset: 1024)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nivcsw", scope: !488, file: !487, line: 177, baseType: !30, size: 64, offset: 1088)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "rusage_info_t", file: !487, line: 200, baseType: !90)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v0", file: !487, line: 202, size: 768, elements: !508)
!508 = !{!509, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !507, file: !487, line: 203, baseType: !510, size: 128)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 128, elements: !77)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !507, file: !487, line: 204, baseType: !458, size: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !507, file: !487, line: 205, baseType: !458, size: 64, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !507, file: !487, line: 206, baseType: !458, size: 64, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !507, file: !487, line: 207, baseType: !458, size: 64, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !507, file: !487, line: 208, baseType: !458, size: 64, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !507, file: !487, line: 209, baseType: !458, size: 64, offset: 448)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !507, file: !487, line: 210, baseType: !458, size: 64, offset: 512)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !507, file: !487, line: 211, baseType: !458, size: 64, offset: 576)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !507, file: !487, line: 212, baseType: !458, size: 64, offset: 640)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !507, file: !487, line: 213, baseType: !458, size: 64, offset: 704)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v1", file: !487, line: 216, size: 1152, elements: !522)
!522 = !{!523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !521, file: !487, line: 217, baseType: !510, size: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !521, file: !487, line: 218, baseType: !458, size: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !521, file: !487, line: 219, baseType: !458, size: 64, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !521, file: !487, line: 220, baseType: !458, size: 64, offset: 256)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !521, file: !487, line: 221, baseType: !458, size: 64, offset: 320)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !521, file: !487, line: 222, baseType: !458, size: 64, offset: 384)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !521, file: !487, line: 223, baseType: !458, size: 64, offset: 448)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !521, file: !487, line: 224, baseType: !458, size: 64, offset: 512)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !521, file: !487, line: 225, baseType: !458, size: 64, offset: 576)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !521, file: !487, line: 226, baseType: !458, size: 64, offset: 640)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !521, file: !487, line: 227, baseType: !458, size: 64, offset: 704)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_user_time", scope: !521, file: !487, line: 228, baseType: !458, size: 64, offset: 768)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_system_time", scope: !521, file: !487, line: 229, baseType: !458, size: 64, offset: 832)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pkg_idle_wkups", scope: !521, file: !487, line: 230, baseType: !458, size: 64, offset: 896)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_interrupt_wkups", scope: !521, file: !487, line: 231, baseType: !458, size: 64, offset: 960)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pageins", scope: !521, file: !487, line: 232, baseType: !458, size: 64, offset: 1024)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_elapsed_abstime", scope: !521, file: !487, line: 233, baseType: !458, size: 64, offset: 1088)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v2", file: !487, line: 236, size: 1280, elements: !541)
!541 = !{!542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !540, file: !487, line: 237, baseType: !510, size: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !540, file: !487, line: 238, baseType: !458, size: 64, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !540, file: !487, line: 239, baseType: !458, size: 64, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !540, file: !487, line: 240, baseType: !458, size: 64, offset: 256)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !540, file: !487, line: 241, baseType: !458, size: 64, offset: 320)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !540, file: !487, line: 242, baseType: !458, size: 64, offset: 384)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !540, file: !487, line: 243, baseType: !458, size: 64, offset: 448)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !540, file: !487, line: 244, baseType: !458, size: 64, offset: 512)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !540, file: !487, line: 245, baseType: !458, size: 64, offset: 576)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !540, file: !487, line: 246, baseType: !458, size: 64, offset: 640)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !540, file: !487, line: 247, baseType: !458, size: 64, offset: 704)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_user_time", scope: !540, file: !487, line: 248, baseType: !458, size: 64, offset: 768)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_system_time", scope: !540, file: !487, line: 249, baseType: !458, size: 64, offset: 832)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pkg_idle_wkups", scope: !540, file: !487, line: 250, baseType: !458, size: 64, offset: 896)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_interrupt_wkups", scope: !540, file: !487, line: 251, baseType: !458, size: 64, offset: 960)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pageins", scope: !540, file: !487, line: 252, baseType: !458, size: 64, offset: 1024)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_elapsed_abstime", scope: !540, file: !487, line: 253, baseType: !458, size: 64, offset: 1088)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_bytesread", scope: !540, file: !487, line: 254, baseType: !458, size: 64, offset: 1152)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_byteswritten", scope: !540, file: !487, line: 255, baseType: !458, size: 64, offset: 1216)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v3", file: !487, line: 258, size: 1856, elements: !562)
!562 = !{!563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !561, file: !487, line: 259, baseType: !510, size: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !561, file: !487, line: 260, baseType: !458, size: 64, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !561, file: !487, line: 261, baseType: !458, size: 64, offset: 192)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !561, file: !487, line: 262, baseType: !458, size: 64, offset: 256)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !561, file: !487, line: 263, baseType: !458, size: 64, offset: 320)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !561, file: !487, line: 264, baseType: !458, size: 64, offset: 384)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !561, file: !487, line: 265, baseType: !458, size: 64, offset: 448)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !561, file: !487, line: 266, baseType: !458, size: 64, offset: 512)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !561, file: !487, line: 267, baseType: !458, size: 64, offset: 576)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !561, file: !487, line: 268, baseType: !458, size: 64, offset: 640)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !561, file: !487, line: 269, baseType: !458, size: 64, offset: 704)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_user_time", scope: !561, file: !487, line: 270, baseType: !458, size: 64, offset: 768)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_system_time", scope: !561, file: !487, line: 271, baseType: !458, size: 64, offset: 832)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pkg_idle_wkups", scope: !561, file: !487, line: 272, baseType: !458, size: 64, offset: 896)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_interrupt_wkups", scope: !561, file: !487, line: 273, baseType: !458, size: 64, offset: 960)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pageins", scope: !561, file: !487, line: 274, baseType: !458, size: 64, offset: 1024)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_elapsed_abstime", scope: !561, file: !487, line: 275, baseType: !458, size: 64, offset: 1088)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_bytesread", scope: !561, file: !487, line: 276, baseType: !458, size: 64, offset: 1152)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_byteswritten", scope: !561, file: !487, line: 277, baseType: !458, size: 64, offset: 1216)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_default", scope: !561, file: !487, line: 278, baseType: !458, size: 64, offset: 1280)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_maintenance", scope: !561, file: !487, line: 279, baseType: !458, size: 64, offset: 1344)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_background", scope: !561, file: !487, line: 280, baseType: !458, size: 64, offset: 1408)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_utility", scope: !561, file: !487, line: 281, baseType: !458, size: 64, offset: 1472)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_legacy", scope: !561, file: !487, line: 282, baseType: !458, size: 64, offset: 1536)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_initiated", scope: !561, file: !487, line: 283, baseType: !458, size: 64, offset: 1600)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_interactive", scope: !561, file: !487, line: 284, baseType: !458, size: 64, offset: 1664)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_system_time", scope: !561, file: !487, line: 285, baseType: !458, size: 64, offset: 1728)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_system_time", scope: !561, file: !487, line: 286, baseType: !458, size: 64, offset: 1792)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v4", file: !487, line: 289, size: 2368, elements: !592)
!592 = !{!593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !591, file: !487, line: 290, baseType: !510, size: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !591, file: !487, line: 291, baseType: !458, size: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !591, file: !487, line: 292, baseType: !458, size: 64, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !591, file: !487, line: 293, baseType: !458, size: 64, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !591, file: !487, line: 294, baseType: !458, size: 64, offset: 320)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !591, file: !487, line: 295, baseType: !458, size: 64, offset: 384)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !591, file: !487, line: 296, baseType: !458, size: 64, offset: 448)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !591, file: !487, line: 297, baseType: !458, size: 64, offset: 512)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !591, file: !487, line: 298, baseType: !458, size: 64, offset: 576)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !591, file: !487, line: 299, baseType: !458, size: 64, offset: 640)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !591, file: !487, line: 300, baseType: !458, size: 64, offset: 704)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_user_time", scope: !591, file: !487, line: 301, baseType: !458, size: 64, offset: 768)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_system_time", scope: !591, file: !487, line: 302, baseType: !458, size: 64, offset: 832)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pkg_idle_wkups", scope: !591, file: !487, line: 303, baseType: !458, size: 64, offset: 896)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_interrupt_wkups", scope: !591, file: !487, line: 304, baseType: !458, size: 64, offset: 960)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pageins", scope: !591, file: !487, line: 305, baseType: !458, size: 64, offset: 1024)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_elapsed_abstime", scope: !591, file: !487, line: 306, baseType: !458, size: 64, offset: 1088)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_bytesread", scope: !591, file: !487, line: 307, baseType: !458, size: 64, offset: 1152)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_byteswritten", scope: !591, file: !487, line: 308, baseType: !458, size: 64, offset: 1216)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_default", scope: !591, file: !487, line: 309, baseType: !458, size: 64, offset: 1280)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_maintenance", scope: !591, file: !487, line: 310, baseType: !458, size: 64, offset: 1344)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_background", scope: !591, file: !487, line: 311, baseType: !458, size: 64, offset: 1408)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_utility", scope: !591, file: !487, line: 312, baseType: !458, size: 64, offset: 1472)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_legacy", scope: !591, file: !487, line: 313, baseType: !458, size: 64, offset: 1536)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_initiated", scope: !591, file: !487, line: 314, baseType: !458, size: 64, offset: 1600)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_interactive", scope: !591, file: !487, line: 315, baseType: !458, size: 64, offset: 1664)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_system_time", scope: !591, file: !487, line: 316, baseType: !458, size: 64, offset: 1728)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_system_time", scope: !591, file: !487, line: 317, baseType: !458, size: 64, offset: 1792)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ri_logical_writes", scope: !591, file: !487, line: 318, baseType: !458, size: 64, offset: 1856)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ri_lifetime_max_phys_footprint", scope: !591, file: !487, line: 319, baseType: !458, size: 64, offset: 1920)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ri_instructions", scope: !591, file: !487, line: 320, baseType: !458, size: 64, offset: 1984)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cycles", scope: !591, file: !487, line: 321, baseType: !458, size: 64, offset: 2048)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_energy", scope: !591, file: !487, line: 322, baseType: !458, size: 64, offset: 2112)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_energy", scope: !591, file: !487, line: 323, baseType: !458, size: 64, offset: 2176)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interval_max_phys_footprint", scope: !591, file: !487, line: 324, baseType: !458, size: 64, offset: 2240)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ri_runnable_time", scope: !591, file: !487, line: 325, baseType: !458, size: 64, offset: 2304)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v5", file: !487, line: 328, size: 2432, elements: !630)
!630 = !{!631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !629, file: !487, line: 329, baseType: !510, size: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !629, file: !487, line: 330, baseType: !458, size: 64, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !629, file: !487, line: 331, baseType: !458, size: 64, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !629, file: !487, line: 332, baseType: !458, size: 64, offset: 256)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !629, file: !487, line: 333, baseType: !458, size: 64, offset: 320)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !629, file: !487, line: 334, baseType: !458, size: 64, offset: 384)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !629, file: !487, line: 335, baseType: !458, size: 64, offset: 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !629, file: !487, line: 336, baseType: !458, size: 64, offset: 512)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !629, file: !487, line: 337, baseType: !458, size: 64, offset: 576)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !629, file: !487, line: 338, baseType: !458, size: 64, offset: 640)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !629, file: !487, line: 339, baseType: !458, size: 64, offset: 704)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_user_time", scope: !629, file: !487, line: 340, baseType: !458, size: 64, offset: 768)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_system_time", scope: !629, file: !487, line: 341, baseType: !458, size: 64, offset: 832)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pkg_idle_wkups", scope: !629, file: !487, line: 342, baseType: !458, size: 64, offset: 896)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_interrupt_wkups", scope: !629, file: !487, line: 343, baseType: !458, size: 64, offset: 960)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pageins", scope: !629, file: !487, line: 344, baseType: !458, size: 64, offset: 1024)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_elapsed_abstime", scope: !629, file: !487, line: 345, baseType: !458, size: 64, offset: 1088)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_bytesread", scope: !629, file: !487, line: 346, baseType: !458, size: 64, offset: 1152)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_byteswritten", scope: !629, file: !487, line: 347, baseType: !458, size: 64, offset: 1216)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_default", scope: !629, file: !487, line: 348, baseType: !458, size: 64, offset: 1280)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_maintenance", scope: !629, file: !487, line: 349, baseType: !458, size: 64, offset: 1344)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_background", scope: !629, file: !487, line: 350, baseType: !458, size: 64, offset: 1408)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_utility", scope: !629, file: !487, line: 351, baseType: !458, size: 64, offset: 1472)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_legacy", scope: !629, file: !487, line: 352, baseType: !458, size: 64, offset: 1536)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_initiated", scope: !629, file: !487, line: 353, baseType: !458, size: 64, offset: 1600)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_interactive", scope: !629, file: !487, line: 354, baseType: !458, size: 64, offset: 1664)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_system_time", scope: !629, file: !487, line: 355, baseType: !458, size: 64, offset: 1728)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_system_time", scope: !629, file: !487, line: 356, baseType: !458, size: 64, offset: 1792)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ri_logical_writes", scope: !629, file: !487, line: 357, baseType: !458, size: 64, offset: 1856)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ri_lifetime_max_phys_footprint", scope: !629, file: !487, line: 358, baseType: !458, size: 64, offset: 1920)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ri_instructions", scope: !629, file: !487, line: 359, baseType: !458, size: 64, offset: 1984)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cycles", scope: !629, file: !487, line: 360, baseType: !458, size: 64, offset: 2048)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_energy", scope: !629, file: !487, line: 361, baseType: !458, size: 64, offset: 2112)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_energy", scope: !629, file: !487, line: 362, baseType: !458, size: 64, offset: 2176)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interval_max_phys_footprint", scope: !629, file: !487, line: 363, baseType: !458, size: 64, offset: 2240)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ri_runnable_time", scope: !629, file: !487, line: 364, baseType: !458, size: 64, offset: 2304)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ri_flags", scope: !629, file: !487, line: 365, baseType: !458, size: 64, offset: 2368)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v6", file: !487, line: 368, size: 3712, elements: !669)
!669 = !{!670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !668, file: !487, line: 369, baseType: !510, size: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !668, file: !487, line: 370, baseType: !458, size: 64, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !668, file: !487, line: 371, baseType: !458, size: 64, offset: 192)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !668, file: !487, line: 372, baseType: !458, size: 64, offset: 256)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !668, file: !487, line: 373, baseType: !458, size: 64, offset: 320)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !668, file: !487, line: 374, baseType: !458, size: 64, offset: 384)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !668, file: !487, line: 375, baseType: !458, size: 64, offset: 448)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !668, file: !487, line: 376, baseType: !458, size: 64, offset: 512)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !668, file: !487, line: 377, baseType: !458, size: 64, offset: 576)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !668, file: !487, line: 378, baseType: !458, size: 64, offset: 640)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !668, file: !487, line: 379, baseType: !458, size: 64, offset: 704)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_user_time", scope: !668, file: !487, line: 380, baseType: !458, size: 64, offset: 768)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_system_time", scope: !668, file: !487, line: 381, baseType: !458, size: 64, offset: 832)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pkg_idle_wkups", scope: !668, file: !487, line: 382, baseType: !458, size: 64, offset: 896)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_interrupt_wkups", scope: !668, file: !487, line: 383, baseType: !458, size: 64, offset: 960)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pageins", scope: !668, file: !487, line: 384, baseType: !458, size: 64, offset: 1024)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_elapsed_abstime", scope: !668, file: !487, line: 385, baseType: !458, size: 64, offset: 1088)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_bytesread", scope: !668, file: !487, line: 386, baseType: !458, size: 64, offset: 1152)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_byteswritten", scope: !668, file: !487, line: 387, baseType: !458, size: 64, offset: 1216)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_default", scope: !668, file: !487, line: 388, baseType: !458, size: 64, offset: 1280)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_maintenance", scope: !668, file: !487, line: 389, baseType: !458, size: 64, offset: 1344)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_background", scope: !668, file: !487, line: 390, baseType: !458, size: 64, offset: 1408)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_utility", scope: !668, file: !487, line: 391, baseType: !458, size: 64, offset: 1472)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_legacy", scope: !668, file: !487, line: 392, baseType: !458, size: 64, offset: 1536)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_initiated", scope: !668, file: !487, line: 393, baseType: !458, size: 64, offset: 1600)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_interactive", scope: !668, file: !487, line: 394, baseType: !458, size: 64, offset: 1664)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_system_time", scope: !668, file: !487, line: 395, baseType: !458, size: 64, offset: 1728)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_system_time", scope: !668, file: !487, line: 396, baseType: !458, size: 64, offset: 1792)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ri_logical_writes", scope: !668, file: !487, line: 397, baseType: !458, size: 64, offset: 1856)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ri_lifetime_max_phys_footprint", scope: !668, file: !487, line: 398, baseType: !458, size: 64, offset: 1920)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ri_instructions", scope: !668, file: !487, line: 399, baseType: !458, size: 64, offset: 1984)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cycles", scope: !668, file: !487, line: 400, baseType: !458, size: 64, offset: 2048)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_energy", scope: !668, file: !487, line: 401, baseType: !458, size: 64, offset: 2112)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_energy", scope: !668, file: !487, line: 402, baseType: !458, size: 64, offset: 2176)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interval_max_phys_footprint", scope: !668, file: !487, line: 403, baseType: !458, size: 64, offset: 2240)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ri_runnable_time", scope: !668, file: !487, line: 404, baseType: !458, size: 64, offset: 2304)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ri_flags", scope: !668, file: !487, line: 405, baseType: !458, size: 64, offset: 2368)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_ptime", scope: !668, file: !487, line: 406, baseType: !458, size: 64, offset: 2432)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_ptime", scope: !668, file: !487, line: 407, baseType: !458, size: 64, offset: 2496)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pinstructions", scope: !668, file: !487, line: 408, baseType: !458, size: 64, offset: 2560)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pcycles", scope: !668, file: !487, line: 409, baseType: !458, size: 64, offset: 2624)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ri_energy_nj", scope: !668, file: !487, line: 410, baseType: !458, size: 64, offset: 2688)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ri_penergy_nj", scope: !668, file: !487, line: 411, baseType: !458, size: 64, offset: 2752)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ri_secure_time_in_system", scope: !668, file: !487, line: 412, baseType: !458, size: 64, offset: 2816)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ri_secure_ptime_in_system", scope: !668, file: !487, line: 413, baseType: !458, size: 64, offset: 2880)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ri_neural_footprint", scope: !668, file: !487, line: 414, baseType: !458, size: 64, offset: 2944)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ri_lifetime_max_neural_footprint", scope: !668, file: !487, line: 415, baseType: !458, size: 64, offset: 3008)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interval_max_neural_footprint", scope: !668, file: !487, line: 416, baseType: !458, size: 64, offset: 3072)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ri_reserved", scope: !668, file: !487, line: 417, baseType: !719, size: 576, offset: 3136)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 576, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 9)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "rusage_info_current", file: !487, line: 420, baseType: !668)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rlimit", file: !487, line: 464, size: 128, elements: !724)
!724 = !{!725, !726}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_cur", scope: !723, file: !487, line: 465, baseType: !486, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_max", scope: !723, file: !487, line: 466, baseType: !486, size: 64, offset: 64)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "proc_rlimit_control_wakeupmon", file: !487, line: 499, size: 64, elements: !728)
!728 = !{!729, !730}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "wm_flags", scope: !727, file: !487, line: 500, baseType: !456, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "wm_rate", scope: !727, file: !487, line: 501, baseType: !166, size: 32, offset: 32)
!731 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "wait", file: !6, line: 194, size: 32, elements: !732)
!732 = !{!733, !734, !741}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "w_status", scope: !731, file: !6, line: 195, baseType: !23, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "w_T", scope: !731, file: !6, line: 212, baseType: !735, size: 32)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !731, file: !6, line: 199, size: 32, elements: !736)
!736 = !{!737, !738, !739, !740}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "w_Termsig", scope: !735, file: !6, line: 201, baseType: !7, size: 7, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "w_Coredump", scope: !735, file: !6, line: 202, baseType: !7, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "w_Retcode", scope: !735, file: !6, line: 203, baseType: !7, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "w_Filler", scope: !735, file: !6, line: 204, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "w_S", scope: !731, file: !6, line: 229, baseType: !742, size: 32)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !731, file: !6, line: 218, size: 32, elements: !743)
!743 = !{!744, !745, !746}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "w_Stopval", scope: !742, file: !6, line: 220, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "w_Stopsig", scope: !742, file: !6, line: 221, baseType: !7, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "w_Filler", scope: !742, file: !6, line: 222, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "ct_rune_t", file: !748, line: 32, baseType: !32)
!748 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_ct_rune_t.h", directory: "", checksumkind: CSK_MD5, checksum: "c22112154646d7509ef295660b838a0e")
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "rune_t", file: !750, line: 31, baseType: !50)
!750 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_rune_t.h", directory: "", checksumkind: CSK_MD5, checksum: "f2344ffb16201340bfd175b1637ea60f")
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !752, line: 53, baseType: !49)
!752 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_wchar_t.h", directory: "", checksumkind: CSK_MD5, checksum: "7c8733b31e382e8074a475f5c41f1e03")
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !754, line: 83, size: 64, elements: !755)
!754 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "1fbf79127e45bcc71ac6e64ce165d68a")
!755 = !{!756, !757}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !753, file: !754, line: 84, baseType: !23, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !753, file: !754, line: 85, baseType: !23, size: 32, offset: 32)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !754, line: 86, baseType: !753)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !754, line: 88, size: 128, elements: !760)
!760 = !{!761, !762}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !759, file: !754, line: 89, baseType: !30, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !759, file: !754, line: 90, baseType: !30, size: 64, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !754, line: 91, baseType: !759)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !754, line: 94, size: 128, elements: !765)
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !764, file: !754, line: 95, baseType: !26, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !764, file: !754, line: 96, baseType: !26, size: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !754, line: 97, baseType: !764)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "malloc_type_id_t", file: !770, line: 30, baseType: !28)
!770 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/malloc/_malloc_type.h", directory: "", checksumkind: CSK_MD5, checksum: "d42ade5b4592df6ab4d40d7d5990e609")
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "malloc_zone_t", file: !770, line: 63, baseType: !772)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "_malloc_zone_t", file: !770, line: 63, flags: DIFlagFwdDecl)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !774, line: 31, baseType: !59)
!774 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_dev_t.h", directory: "", checksumkind: CSK_MD5, checksum: "48c1388efd95518803dfc92f7c613390")
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !776, line: 31, baseType: !68)
!776 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_mode_t.h", directory: "", checksumkind: CSK_MD5, checksum: "9d25d351341bf46798d552a73c506c13")
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !3, line: 4, size: 128, elements: !778)
!778 = !{!779, !780}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !777, file: !3, line: 6, baseType: !23, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !777, file: !3, line: 7, baseType: !781, size: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!782 = !{!783, !788, !793, !798, !803, !805, !810, !815, !820, !825, !830, !833, !835, !840, !842, !844, !849, !854, !859, !0}
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(scope: null, file: !3, line: 31, type: !785, isLocal: true, isDefinition: true)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 120, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 15)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !3, line: 39, type: !790, isLocal: true, isDefinition: true)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 40, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 5)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(scope: null, file: !3, line: 43, type: !795, isLocal: true, isDefinition: true)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 48, elements: !796)
!796 = !{!797}
!797 = !DISubrange(count: 6)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(scope: null, file: !3, line: 44, type: !800, isLocal: true, isDefinition: true)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 160, elements: !801)
!801 = !{!802}
!802 = !DISubrange(count: 20)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(scope: null, file: !3, line: 50, type: !80, isLocal: true, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(scope: null, file: !3, line: 82, type: !807, isLocal: true, isDefinition: true)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 216, elements: !808)
!808 = !{!809}
!809 = !DISubrange(count: 27)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(scope: null, file: !3, line: 93, type: !812, isLocal: true, isDefinition: true)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 224, elements: !813)
!813 = !{!814}
!814 = !DISubrange(count: 28)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(scope: null, file: !3, line: 173, type: !817, isLocal: true, isDefinition: true)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 184, elements: !818)
!818 = !{!819}
!819 = !DISubrange(count: 23)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(scope: null, file: !3, line: 184, type: !822, isLocal: true, isDefinition: true)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 2352, elements: !823)
!823 = !{!824}
!824 = !DISubrange(count: 294)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(scope: null, file: !3, line: 185, type: !827, isLocal: true, isDefinition: true)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 192, elements: !828)
!828 = !{!829}
!829 = !DISubrange(count: 24)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(scope: null, file: !3, line: 186, type: !832, isLocal: true, isDefinition: true)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 24, elements: !238)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(scope: null, file: !3, line: 189, type: !827, isLocal: true, isDefinition: true)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(scope: null, file: !3, line: 196, type: !837, isLocal: true, isDefinition: true)
