; ModuleID = 'test2.c'
source_filename = "test2.c"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx15.0.0"

@.str = private unnamed_addr constant [9 x i8] c"file.txt\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1, !dbg !12

; Function Attrs: noinline nounwind ssp uwtable(sync)
define i32 @main() #0 !dbg !796 {
entry:
  %retval = alloca i32, align 4
  %str1 = alloca [1000 x i8], align 1
  %fp = alloca ptr, align 8
  %c = alloca i8, align 1
  %len = alloca i32, align 4
  store i32 0, ptr %retval, align 4
    #dbg_declare(ptr %str1, !800, !DIExpression(), !804)
    #dbg_declare(ptr %fp, !805, !DIExpression(), !807)
  %call = call ptr @"\01_fopen"(ptr noundef @.str, ptr noundef @.str.1), !dbg !808
  store ptr %call, ptr %fp, align 8, !dbg !809
    #dbg_declare(ptr %c, !810, !DIExpression(), !811)
    #dbg_declare(ptr %len, !812, !DIExpression(), !813)
  store i32 0, ptr %len, align 4, !dbg !813
  br label %while.body, !dbg !814

while.body:                                       ; preds = %entry, %if.end7
  %0 = load ptr, ptr %fp, align 8, !dbg !815
  %call1 = call i32 @getc(ptr noundef %0), !dbg !818
  %conv = trunc i32 %call1 to i8, !dbg !818
  store i8 %conv, ptr %c, align 1, !dbg !819
  %conv2 = sext i8 %conv to i32, !dbg !820
  %cmp = icmp eq i32 %conv2, -1, !dbg !821

!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !28, line: 37, baseType: !40)
!40 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !28, line: 38, baseType: !42)
!42 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !28, line: 40, baseType: !44)
!44 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_natural_t", file: !28, line: 41, baseType: !21)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ct_rune_t", file: !28, line: 61, baseType: !37)
!47 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !28, line: 67, size: 1024, elements: !48)
!48 = !{!49, !53}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !47, file: !28, line: 68, baseType: !50, size: 1024)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !47, file: !28, line: 69, baseType: !40, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !28, line: 70, baseType: !47)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mbstate_t", file: !28, line: 72, baseType: !54)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ptrdiff_t", file: !28, line: 77, baseType: !44)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !28, line: 87, baseType: !58)
!58 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_va_list", file: !28, line: 95, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !2, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wchar_t", file: !28, line: 103, baseType: !37)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_rune_t", file: !28, line: 108, baseType: !62)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wint_t", file: !28, line: 111, baseType: !37)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_clock_t", file: !28, line: 116, baseType: !58)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_socklen_t", file: !28, line: 117, baseType: !38)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ssize_t", file: !28, line: 118, baseType: !44)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !28, line: 119, baseType: !44)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blkcnt_t", file: !70, line: 67, baseType: !39)
!70 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "af82ff6119a9fa80fad635d276556d46")
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blksize_t", file: !70, line: 68, baseType: !36)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_dev_t", file: !70, line: 69, baseType: !36)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_fsblkcnt_t", file: !70, line: 70, baseType: !21)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_fsfilcnt_t", file: !70, line: 71, baseType: !21)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_gid_t", file: !70, line: 72, baseType: !38)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_id_t", file: !70, line: 73, baseType: !38)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ino64_t", file: !70, line: 74, baseType: !41)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ino_t", file: !70, line: 76, baseType: !77)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mach_port_name_t", file: !70, line: 80, baseType: !45)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mach_port_t", file: !70, line: 81, baseType: !79)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mode_t", file: !70, line: 82, baseType: !34)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !70, line: 83, baseType: !39)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pid_t", file: !70, line: 84, baseType: !36)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_sigset_t", file: !70, line: 85, baseType: !38)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_suseconds_t", file: !70, line: 86, baseType: !36)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uid_t", file: !70, line: 87, baseType: !38)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_useconds_t", file: !70, line: 88, baseType: !38)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uuid_t", file: !70, line: 89, baseType: !89)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 128, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 16)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uuid_string_t", file: !70, line: 90, baseType: !93)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 37)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_pthread_handler_rec", file: !97, line: 57, size: 192, elements: !98)
!97 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_pthread/_pthread_types.h", directory: "", checksumkind: CSK_MD5, checksum: "4e2ea0e1af95894da0a6030a21a8ebee")
!98 = !{!99, !104, !105}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__routine", scope: !96, file: !97, line: 58, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !103}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__arg", scope: !96, file: !97, line: 59, baseType: !103, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !96, file: !97, line: 60, baseType: !106, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_attr_t", file: !97, line: 63, size: 512, elements: !108)
!108 = !{!109, !110}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !107, file: !97, line: 64, baseType: !44, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !107, file: !97, line: 65, baseType: !111, size: 448, offset: 64)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 56)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_cond_t", file: !97, line: 68, size: 384, elements: !115)
!115 = !{!116, !117}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !114, file: !97, line: 69, baseType: !44, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !114, file: !97, line: 70, baseType: !118, size: 320, offset: 64)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 40)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_condattr_t", file: !97, line: 73, size: 128, elements: !122)
!122 = !{!123, !124}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !121, file: !97, line: 74, baseType: !44, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !121, file: !97, line: 75, baseType: !125, size: 64, offset: 64)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 8)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_mutex_t", file: !97, line: 78, size: 512, elements: !129)
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !128, file: !97, line: 79, baseType: !44, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !128, file: !97, line: 80, baseType: !111, size: 448, offset: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_mutexattr_t", file: !97, line: 83, size: 128, elements: !133)
!133 = !{!134, !135}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !132, file: !97, line: 84, baseType: !44, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !132, file: !97, line: 85, baseType: !125, size: 64, offset: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_once_t", file: !97, line: 88, size: 128, elements: !137)
!137 = !{!138, !139}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !136, file: !97, line: 89, baseType: !44, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !136, file: !97, line: 90, baseType: !125, size: 64, offset: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_rwlock_t", file: !97, line: 93, size: 1600, elements: !141)
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !140, file: !97, line: 94, baseType: !44, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !140, file: !97, line: 95, baseType: !144, size: 1536, offset: 64)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1536, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 192)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_rwlockattr_t", file: !97, line: 98, size: 192, elements: !148)
!148 = !{!149, !150}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !147, file: !97, line: 99, baseType: !44, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !147, file: !97, line: 100, baseType: !151, size: 128, offset: 64)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !90)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_t", file: !97, line: 103, size: 65536, elements: !153)
!153 = !{!154, !155, !156}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !152, file: !97, line: 104, baseType: !44, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup_stack", scope: !152, file: !97, line: 105, baseType: !106, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !152, file: !97, line: 106, baseType: !157, size: 65408, offset: 128)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 65408, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 8176)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_attr_t", file: !97, line: 109, baseType: !107)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_cond_t", file: !97, line: 110, baseType: !114)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_condattr_t", file: !97, line: 111, baseType: !121)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_key_t", file: !97, line: 112, baseType: !58)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_mutex_t", file: !97, line: 113, baseType: !128)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_mutexattr_t", file: !97, line: 114, baseType: !132)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_once_t", file: !97, line: 115, baseType: !136)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_rwlock_t", file: !97, line: 116, baseType: !140)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_rwlockattr_t", file: !97, line: 117, baseType: !147)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_t", file: !97, line: 118, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_nl_item", file: !172, line: 40, baseType: !37)
!172 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "bd2087c8ee278624cee561f95099160e")
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctrans_t", file: !172, line: 41, baseType: !37)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctype_t", file: !172, line: 43, baseType: !38)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !176, line: 30, baseType: !29)
!176 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5052dfe782b50fed2355b8f61a9e4fa9")
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !178, line: 30, baseType: !33)
!178 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "47ed3c3ac6f65bfec021ca2b7be18e7e")
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !180, line: 30, baseType: !37)
!180 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "d23e8406e80ee79983f28509c741fa17")
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !182, line: 30, baseType: !40)
!182 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e6d85c1a9e23dbf7518ce3b162aac800")
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int8_t", file: !184, line: 30, baseType: !31)
!184 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_u_int8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "cf25460e3a2d25a50de2bd9cd0738ad8")
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int16_t", file: !186, line: 30, baseType: !35)
!186 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_u_int16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "20fb61aa655de1ae21f6fe1799ea5928")
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int32_t", file: !188, line: 30, baseType: !21)
!188 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_u_int32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "1be414e13025ba0d11004877ba3f558a")
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int64_t", file: !190, line: 30, baseType: !42)
!190 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_u_int64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "466f994226288d9979ea32e237e3f3c2")
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "register_t", file: !192, line: 66, baseType: !181)
!192 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/arm/types.h", directory: "", checksumkind: CSK_MD5, checksum: "bd345bb749b5098b0f191abe2c0d3eb4")
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !194, line: 32, baseType: !43)
!194 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_intptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e478ba47270923b1cca6659f19f02db1")
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !196, line: 34, baseType: !58)
!196 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e70ae655dd1b9d4ae0b1dcc073f5b7e4")
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_addr_t", file: !192, line: 77, baseType: !189)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_size_t", file: !192, line: 78, baseType: !189)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_ssize_t", file: !192, line: 79, baseType: !181)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_long_t", file: !192, line: 80, baseType: !181)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_ulong_t", file: !192, line: 81, baseType: !189)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_time_t", file: !192, line: 82, baseType: !181)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_off_t", file: !192, line: 83, baseType: !181)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "syscall_arg_t", file: !192, line: 105, baseType: !189)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !206, line: 44, baseType: !59)
!206 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "41825c2dccdd98a1587ce428cded44de")
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !208, line: 50, baseType: !57)
!208 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "f7981334d28e0c246f35cd24042aa2a4")
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !210, line: 83, baseType: !82)
!210 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "3d165ce37807d123c2b5ed4c31060b16")
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !210, line: 94, size: 128, elements: !212)
!212 = !{!213, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !211, file: !210, line: 95, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !211, file: !210, line: 96, baseType: !37, size: 32, offset: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !210, line: 128, size: 1216, elements: !217)
!217 = !{!218, !219, !220, !221, !222, !223, !224, !225, !226, !230, !234, !238, !244, !245, !248, !249, !253, !257, !258, !259}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !216, file: !210, line: 129, baseType: !214, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !216, file: !210, line: 130, baseType: !37, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !216, file: !210, line: 131, baseType: !37, size: 32, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !216, file: !210, line: 132, baseType: !33, size: 16, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !216, file: !210, line: 133, baseType: !33, size: 16, offset: 144)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !216, file: !210, line: 134, baseType: !211, size: 128, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !216, file: !210, line: 135, baseType: !37, size: 32, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !216, file: !210, line: 138, baseType: !103, size: 64, offset: 384)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !216, file: !210, line: 139, baseType: !227, size: 64, offset: 448)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!37, !103}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !216, file: !210, line: 140, baseType: !231, size: 64, offset: 512)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!37, !103, !61, !37}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !216, file: !210, line: 141, baseType: !235, size: 64, offset: 576)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!209, !103, !209, !37}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !216, file: !210, line: 142, baseType: !239, size: 64, offset: 640)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!37, !103, !242, !37}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !216, file: !210, line: 145, baseType: !211, size: 128, offset: 704)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !216, file: !210, line: 146, baseType: !246, size: 64, offset: 832)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !210, line: 100, flags: DIFlagFwdDecl)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !216, file: !210, line: 147, baseType: !37, size: 32, offset: 896)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !216, file: !210, line: 150, baseType: !250, size: 24, offset: 928)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 24, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 3)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !216, file: !210, line: 151, baseType: !254, size: 8, offset: 952)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 1)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !216, file: !210, line: 154, baseType: !211, size: 128, offset: 960)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !216, file: !210, line: 157, baseType: !37, size: 32, offset: 1088)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !216, file: !210, line: 158, baseType: !209, size: 64, offset: 1152)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !210, line: 159, baseType: !216)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !262, line: 31, baseType: !82)
!262 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_off_t.h", directory: "", checksumkind: CSK_MD5, checksum: "0468c56924902d4782b467d48c54d211")
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !264, line: 31, baseType: !67)
!264 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_ssize_t.h", directory: "", checksumkind: CSK_MD5, checksum: "9b4f5bef81dd94a882775a3ce650ab9c")
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "idtype_t", file: !20, line: 83, baseType: !19)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !267, line: 31, baseType: !83)
!267 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_pid_t.h", directory: "", checksumkind: CSK_MD5, checksum: "86a3851b3039dd75e6cc5a8b4f2b3461")
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "id_t", file: !269, line: 31, baseType: !76)
!269 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_id_t.h", directory: "", checksumkind: CSK_MD5, checksum: "985e35d2b2c7e6ea13869fc8cd0b5949")
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !271, line: 17, baseType: !37)
!271 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/arm/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "802a7d5a263aebe8f27d5d67c7ad4b44")
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_exception_state", file: !273, line: 41, size: 96, elements: !274)
!273 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/mach/arm/_structs.h", directory: "", checksumkind: CSK_MD5, checksum: "fc9233eb351901bd9aae4f5912643825")
!274 = !{!275, !276, !277}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__exception", scope: !272, file: !273, line: 43, baseType: !38, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__fsr", scope: !272, file: !273, line: 44, baseType: !38, size: 32, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__far", scope: !272, file: !273, line: 45, baseType: !38, size: 32, offset: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_exception_state64", file: !273, line: 59, size: 128, elements: !279)
!279 = !{!280, !281, !282}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__far", scope: !278, file: !273, line: 61, baseType: !41, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__esr", scope: !278, file: !273, line: 62, baseType: !38, size: 32, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__exception", scope: !278, file: !273, line: 63, baseType: !38, size: 32, offset: 96)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_exception_state64_v2", file: !273, line: 66, size: 128, elements: !284)
!284 = !{!285, !286}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__far", scope: !283, file: !273, line: 68, baseType: !41, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "__esr", scope: !283, file: !273, line: 69, baseType: !41, size: 64, offset: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_thread_state", file: !273, line: 89, size: 544, elements: !288)
!288 = !{!289, !293, !294, !295, !296}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "__r", scope: !287, file: !273, line: 91, baseType: !290, size: 416)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 416, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 13)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__sp", scope: !287, file: !273, line: 92, baseType: !38, size: 32, offset: 416)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__lr", scope: !287, file: !273, line: 93, baseType: !38, size: 32, offset: 448)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__pc", scope: !287, file: !273, line: 94, baseType: !38, size: 32, offset: 480)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "__cpsr", scope: !287, file: !273, line: 95, baseType: !38, size: 32, offset: 512)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_thread_state64", file: !273, line: 148, size: 2176, elements: !298)
!298 = !{!299, !303, !304, !305, !306, !307, !308}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__x", scope: !297, file: !273, line: 150, baseType: !300, size: 1856)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 1856, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 29)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__fp", scope: !297, file: !273, line: 151, baseType: !41, size: 64, offset: 1856)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__lr", scope: !297, file: !273, line: 152, baseType: !41, size: 64, offset: 1920)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__sp", scope: !297, file: !273, line: 153, baseType: !41, size: 64, offset: 1984)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__pc", scope: !297, file: !273, line: 154, baseType: !41, size: 64, offset: 2048)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__cpsr", scope: !297, file: !273, line: 155, baseType: !38, size: 32, offset: 2112)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__pad", scope: !297, file: !273, line: 156, baseType: !38, size: 32, offset: 2144)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_vfp_state", file: !273, line: 519, size: 2080, elements: !310)
!310 = !{!311, !315}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__r", scope: !309, file: !273, line: 521, baseType: !312, size: 2048)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 2048, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__fpscr", scope: !309, file: !273, line: 522, baseType: !38, size: 32, offset: 2048)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_neon_state64", file: !273, line: 538, size: 4224, elements: !317)
!317 = !{!318, !324, !325}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__v", scope: !316, file: !273, line: 540, baseType: !319, size: 4096)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 4096, elements: !322)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint128_t", file: !2, baseType: !321)
!321 = !DIBasicType(name: "unsigned __int128", size: 128, encoding: DW_ATE_unsigned)
!322 = !{!323}
!323 = !DISubrange(count: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__fpsr", scope: !316, file: !273, line: 541, baseType: !38, size: 32, offset: 4096)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "__fpcr", scope: !316, file: !273, line: 542, baseType: !38, size: 32, offset: 4128)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_neon_state", file: !273, line: 545, size: 2176, elements: !327)
!327 = !{!328, !330, !331}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__v", scope: !326, file: !273, line: 547, baseType: !329, size: 2048)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 2048, elements: !90)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__fpsr", scope: !326, file: !273, line: 548, baseType: !38, size: 32, offset: 2048)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__fpcr", scope: !326, file: !273, line: 549, baseType: !38, size: 32, offset: 2080)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__arm_pagein_state", file: !273, line: 609, size: 32, elements: !333)
!333 = !{!334}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__pagein_error", scope: !332, file: !273, line: 611, baseType: !37, size: 32)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__arm_legacy_debug_state", file: !273, line: 646, size: 2048, elements: !336)
!336 = !{!337, !339, !340, !341}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__bvr", scope: !335, file: !273, line: 648, baseType: !338, size: 512)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 512, elements: !90)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__bcr", scope: !335, file: !273, line: 649, baseType: !338, size: 512, offset: 512)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__wvr", scope: !335, file: !273, line: 650, baseType: !338, size: 512, offset: 1024)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__wcr", scope: !335, file: !273, line: 651, baseType: !338, size: 512, offset: 1536)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_debug_state32", file: !273, line: 669, size: 2112, elements: !343)
!343 = !{!344, !345, !346, !347, !348}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__bvr", scope: !342, file: !273, line: 671, baseType: !338, size: 512)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__bcr", scope: !342, file: !273, line: 672, baseType: !338, size: 512, offset: 512)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__wvr", scope: !342, file: !273, line: 673, baseType: !338, size: 512, offset: 1024)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__wcr", scope: !342, file: !273, line: 674, baseType: !338, size: 512, offset: 1536)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__mdscr_el1", scope: !342, file: !273, line: 675, baseType: !41, size: 64, offset: 2048)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_debug_state64", file: !273, line: 679, size: 4160, elements: !350)
!350 = !{!351, !353, !354, !355, !356}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__bvr", scope: !349, file: !273, line: 681, baseType: !352, size: 1024)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 1024, elements: !90)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "__bcr", scope: !349, file: !273, line: 682, baseType: !352, size: 1024, offset: 1024)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__wvr", scope: !349, file: !273, line: 683, baseType: !352, size: 1024, offset: 2048)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__wcr", scope: !349, file: !273, line: 684, baseType: !352, size: 1024, offset: 3072)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__mdscr_el1", scope: !349, file: !273, line: 685, baseType: !41, size: 64, offset: 4096)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_cpmu_state64", file: !273, line: 711, size: 1024, elements: !358)
!358 = !{!359}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__ctrs", scope: !357, file: !273, line: 713, baseType: !352, size: 1024)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_mcontext32", file: !361, line: 41, size: 2720, elements: !362)
!361 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/arm/_mcontext.h", directory: "", checksumkind: CSK_MD5, checksum: "da7c261f76f98eb3bbd7ed11c4aaa3d8")
!362 = !{!363, !364, !365}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__es", scope: !360, file: !361, line: 43, baseType: !272, size: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__ss", scope: !360, file: !361, line: 44, baseType: !287, size: 544, offset: 96)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__fs", scope: !360, file: !361, line: 45, baseType: !309, size: 2080, offset: 640)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_mcontext64", file: !361, line: 64, size: 6528, elements: !367)
!367 = !{!368, !369, !370}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__es", scope: !366, file: !361, line: 66, baseType: !278, size: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__ss", scope: !366, file: !361, line: 67, baseType: !297, size: 2176, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__ns", scope: !366, file: !361, line: 68, baseType: !316, size: 4224, offset: 2304)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "mcontext_t", file: !361, line: 85, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_attr_t", file: !374, line: 31, baseType: !160)
!374 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_pthread/_pthread_attr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "383e78324250b910a1128f1b9a464b23")
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_sigaltstack", file: !376, line: 42, size: 192, elements: !377)
!376 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_sigaltstack.h", directory: "", checksumkind: CSK_MD5, checksum: "d308a81f239c930cbd1b1f2eee3fc6c1")
!377 = !{!378, !379, !380}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ss_sp", scope: !375, file: !376, line: 44, baseType: !103, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ss_size", scope: !375, file: !376, line: 45, baseType: !57, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ss_flags", scope: !375, file: !376, line: 46, baseType: !37, size: 32, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "stack_t", file: !376, line: 48, baseType: !375)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_ucontext", file: !383, line: 43, size: 448, elements: !384)
!383 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_ucontext.h", directory: "", checksumkind: CSK_MD5, checksum: "c9464687b003449106b679928ca1b348")
!384 = !{!385, !386, !387, !388, !390, !391}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "uc_onstack", scope: !382, file: !383, line: 45, baseType: !37, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "uc_sigmask", scope: !382, file: !383, line: 46, baseType: !84, size: 32, offset: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "uc_stack", scope: !382, file: !383, line: 47, baseType: !375, size: 192, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "uc_link", scope: !382, file: !383, line: 48, baseType: !389, size: 64, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "uc_mcsize", scope: !382, file: !383, line: 49, baseType: !57, size: 64, offset: 320)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "uc_mcontext", scope: !382, file: !383, line: 50, baseType: !372, size: 64, offset: 384)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucontext_t", file: !383, line: 57, baseType: !382)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !394, line: 31, baseType: !84)
!394 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "437b33d322f60e932c1e1199626d9393")
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !396, line: 31, baseType: !86)
!396 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_uid_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2a704f772d04abefb01de36d246e45dd")
!397 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !398, line: 158, size: 64, elements: !399)
!398 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "541f2577a63933b8824579532ef86917")
!399 = !{!400, !401}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !397, file: !398, line: 160, baseType: !37, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !397, file: !398, line: 161, baseType: !103, size: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigevent", file: !398, line: 168, size: 256, elements: !403)
!403 = !{!404, !405, !406, !407, !411}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_notify", scope: !402, file: !398, line: 169, baseType: !37, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_signo", scope: !402, file: !398, line: 170, baseType: !37, size: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_value", scope: !402, file: !398, line: 171, baseType: !397, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_notify_function", scope: !402, file: !398, line: 172, baseType: !408, size: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !397}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_notify_attributes", scope: !402, file: !398, line: 173, baseType: !412, size: 64, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__siginfo", file: !398, line: 177, size: 832, elements: !414)
!414 = !{!415, !416, !417, !418, !419, !420, !421, !422, !423, !424}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !413, file: !398, line: 178, baseType: !37, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !413, file: !398, line: 179, baseType: !37, size: 32, offset: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !413, file: !398, line: 180, baseType: !37, size: 32, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !413, file: !398, line: 181, baseType: !266, size: 32, offset: 96)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !413, file: !398, line: 182, baseType: !395, size: 32, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !413, file: !398, line: 183, baseType: !37, size: 32, offset: 160)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !413, file: !398, line: 184, baseType: !103, size: 64, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "si_value", scope: !413, file: !398, line: 185, baseType: !397, size: 64, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !413, file: !398, line: 186, baseType: !44, size: 64, offset: 320)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__pad", scope: !413, file: !398, line: 187, baseType: !425, size: 448, offset: 384)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 448, elements: !426)
!426 = !{!427}
!427 = !DISubrange(count: 7)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !398, line: 188, baseType: !413)
!429 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__sigaction_u", file: !398, line: 269, size: 64, elements: !430)
!430 = !{!431, !435}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__sa_handler", scope: !429, file: !398, line: 270, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{null, !37}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "__sa_sigaction", scope: !429, file: !398, line: 271, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !37, !439, !103}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sigaction", file: !398, line: 276, size: 192, elements: !441)
!441 = !{!442, !443, !448, !449}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_u", scope: !440, file: !398, line: 277, baseType: !429, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "sa_tramp", scope: !440, file: !398, line: 278, baseType: !444, size: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !103, !37, !37, !447, !103}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !440, file: !398, line: 279, baseType: !393, size: 32, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !440, file: !398, line: 280, baseType: !37, size: 32, offset: 160)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !398, line: 286, size: 128, elements: !451)
!451 = !{!452, !453, !454}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_u", scope: !450, file: !398, line: 287, baseType: !429, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !450, file: !398, line: 288, baseType: !393, size: 32, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !450, file: !398, line: 289, baseType: !37, size: 32, offset: 96)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_t", file: !398, line: 331, baseType: !432)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigvec", file: !398, line: 348, size: 128, elements: !457)
!457 = !{!458, !459, !460}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "sv_handler", scope: !456, file: !398, line: 349, baseType: !432, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "sv_mask", scope: !456, file: !398, line: 350, baseType: !37, size: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !456, file: !398, line: 351, baseType: !37, size: 32, offset: 96)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigstack", file: !398, line: 367, size: 128, elements: !462)
!462 = !{!463, !464}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ss_sp", scope: !461, file: !398, line: 368, baseType: !61, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ss_onstack", scope: !461, file: !398, line: 369, baseType: !37, size: 32, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !466, line: 31, baseType: !31)
!466 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8b64ccf8c67b8c006b07b8daf1b49be5")
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !468, line: 31, baseType: !35)
!468 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "f0aa926da906b10566dd3171bf347ab7")
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !470, line: 31, baseType: !21)
!470 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "0254eb80c6b9719ac45c3c1cf872109b")
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !472, line: 31, baseType: !42)
!472 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "77fc5e91653260959605f129691cf9b1")
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !474, line: 29, baseType: !175)
!474 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "042ceedaf4137a8aaa272d0b27434016")
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !474, line: 30, baseType: !177)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !474, line: 31, baseType: !179)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !474, line: 32, baseType: !181)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !474, line: 33, baseType: !465)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !474, line: 34, baseType: !467)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !474, line: 35, baseType: !469)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !474, line: 36, baseType: !471)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !474, line: 40, baseType: !175)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !474, line: 41, baseType: !177)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !474, line: 42, baseType: !179)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !474, line: 43, baseType: !181)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !474, line: 44, baseType: !465)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !474, line: 45, baseType: !467)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !474, line: 46, baseType: !469)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !474, line: 47, baseType: !471)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !491, line: 32, baseType: !44)
!491 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_intmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e37b9240f30f486478152ef3989b1545")
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !493, line: 32, baseType: !58)
!493 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uintmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8217a3fbb207d8e87ca5318c313e81c2")
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !495, line: 34, size: 128, elements: !496)
!495 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "24f84d4e0450b2e5ff976a6f6da860d2")
!496 = !{!497, !498}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !494, file: !495, line: 36, baseType: !68, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !494, file: !495, line: 37, baseType: !85, size: 32, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "rlim_t", file: !500, line: 89, baseType: !41)
!500 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/resource.h", directory: "", checksumkind: CSK_MD5, checksum: "c4e799a130a69d94f00fda9cbd994906")
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage", file: !500, line: 152, size: 1152, elements: !502)
!502 = !{!503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ru_utime", scope: !501, file: !500, line: 153, baseType: !494, size: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ru_stime", scope: !501, file: !500, line: 154, baseType: !494, size: 128, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ru_maxrss", scope: !501, file: !500, line: 163, baseType: !44, size: 64, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ru_ixrss", scope: !501, file: !500, line: 165, baseType: !44, size: 64, offset: 320)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ru_idrss", scope: !501, file: !500, line: 166, baseType: !44, size: 64, offset: 384)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ru_isrss", scope: !501, file: !500, line: 167, baseType: !44, size: 64, offset: 448)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "ru_minflt", scope: !501, file: !500, line: 168, baseType: !44, size: 64, offset: 512)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ru_majflt", scope: !501, file: !500, line: 169, baseType: !44, size: 64, offset: 576)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nswap", scope: !501, file: !500, line: 170, baseType: !44, size: 64, offset: 640)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ru_inblock", scope: !501, file: !500, line: 171, baseType: !44, size: 64, offset: 704)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ru_oublock", scope: !501, file: !500, line: 172, baseType: !44, size: 64, offset: 768)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgsnd", scope: !501, file: !500, line: 173, baseType: !44, size: 64, offset: 832)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgrcv", scope: !501, file: !500, line: 174, baseType: !44, size: 64, offset: 896)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nsignals", scope: !501, file: !500, line: 175, baseType: !44, size: 64, offset: 960)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nvcsw", scope: !501, file: !500, line: 176, baseType: !44, size: 64, offset: 1024)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nivcsw", scope: !501, file: !500, line: 177, baseType: !44, size: 64, offset: 1088)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "rusage_info_t", file: !500, line: 200, baseType: !103)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v0", file: !500, line: 202, size: 768, elements: !521)
!521 = !{!522, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !520, file: !500, line: 203, baseType: !523, size: 128)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 128, elements: !90)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !520, file: !500, line: 204, baseType: !471, size: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !520, file: !500, line: 205, baseType: !471, size: 64, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !520, file: !500, line: 206, baseType: !471, size: 64, offset: 256)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !520, file: !500, line: 207, baseType: !471, size: 64, offset: 320)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !520, file: !500, line: 208, baseType: !471, size: 64, offset: 384)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !520, file: !500, line: 209, baseType: !471, size: 64, offset: 448)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !520, file: !500, line: 210, baseType: !471, size: 64, offset: 512)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !520, file: !500, line: 211, baseType: !471, size: 64, offset: 576)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !520, file: !500, line: 212, baseType: !471, size: 64, offset: 640)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !520, file: !500, line: 213, baseType: !471, size: 64, offset: 704)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v1", file: !500, line: 216, size: 1152, elements: !535)
!535 = !{!536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !534, file: !500, line: 217, baseType: !523, size: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !534, file: !500, line: 218, baseType: !471, size: 64, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !534, file: !500, line: 219, baseType: !471, size: 64, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !534, file: !500, line: 220, baseType: !471, size: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !534, file: !500, line: 221, baseType: !471, size: 64, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !534, file: !500, line: 222, baseType: !471, size: 64, offset: 384)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !534, file: !500, line: 223, baseType: !471, size: 64, offset: 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !534, file: !500, line: 224, baseType: !471, size: 64, offset: 512)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !534, file: !500, line: 225, baseType: !471, size: 64, offset: 576)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !534, file: !500, line: 226, baseType: !471, size: 64, offset: 640)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !534, file: !500, line: 227, baseType: !471, size: 64, offset: 704)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_user_time", scope: !534, file: !500, line: 228, baseType: !471, size: 64, offset: 768)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_system_time", scope: !534, file: !500, line: 229, baseType: !471, size: 64, offset: 832)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pkg_idle_wkups", scope: !534, file: !500, line: 230, baseType: !471, size: 64, offset: 896)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_interrupt_wkups", scope: !534, file: !500, line: 231, baseType: !471, size: 64, offset: 960)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pageins", scope: !534, file: !500, line: 232, baseType: !471, size: 64, offset: 1024)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_elapsed_abstime", scope: !534, file: !500, line: 233, baseType: !471, size: 64, offset: 1088)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v2", file: !500, line: 236, size: 1280, elements: !554)
!554 = !{!555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !553, file: !500, line: 237, baseType: !523, size: 128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !553, file: !500, line: 238, baseType: !471, size: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !553, file: !500, line: 239, baseType: !471, size: 64, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !553, file: !500, line: 240, baseType: !471, size: 64, offset: 256)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !553, file: !500, line: 241, baseType: !471, size: 64, offset: 320)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !553, file: !500, line: 242, baseType: !471, size: 64, offset: 384)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !553, file: !500, line: 243, baseType: !471, size: 64, offset: 448)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !553, file: !500, line: 244, baseType: !471, size: 64, offset: 512)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !553, file: !500, line: 245, baseType: !471, size: 64, offset: 576)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !553, file: !500, line: 246, baseType: !471, size: 64, offset: 640)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !553, file: !500, line: 247, baseType: !471, size: 64, offset: 704)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_user_time", scope: !553, file: !500, line: 248, baseType: !471, size: 64, offset: 768)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_system_time", scope: !553, file: !500, line: 249, baseType: !471, size: 64, offset: 832)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pkg_idle_wkups", scope: !553, file: !500, line: 250, baseType: !471, size: 64, offset: 896)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_interrupt_wkups", scope: !553, file: !500, line: 251, baseType: !471, size: 64, offset: 960)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pageins", scope: !553, file: !500, line: 252, baseType: !471, size: 64, offset: 1024)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_elapsed_abstime", scope: !553, file: !500, line: 253, baseType: !471, size: 64, offset: 1088)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_bytesread", scope: !553, file: !500, line: 254, baseType: !471, size: 64, offset: 1152)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_byteswritten", scope: !553, file: !500, line: 255, baseType: !471, size: 64, offset: 1216)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v3", file: !500, line: 258, size: 1856, elements: !575)
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !574, file: !500, line: 259, baseType: !523, size: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !574, file: !500, line: 260, baseType: !471, size: 64, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !574, file: !500, line: 261, baseType: !471, size: 64, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !574, file: !500, line: 262, baseType: !471, size: 64, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !574, file: !500, line: 263, baseType: !471, size: 64, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !574, file: !500, line: 264, baseType: !471, size: 64, offset: 384)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !574, file: !500, line: 265, baseType: !471, size: 64, offset: 448)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !574, file: !500, line: 266, baseType: !471, size: 64, offset: 512)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !574, file: !500, line: 267, baseType: !471, size: 64, offset: 576)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !574, file: !500, line: 268, baseType: !471, size: 64, offset: 640)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !574, file: !500, line: 269, baseType: !471, size: 64, offset: 704)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_user_time", scope: !574, file: !500, line: 270, baseType: !471, size: 64, offset: 768)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_system_time", scope: !574, file: !500, line: 271, baseType: !471, size: 64, offset: 832)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pkg_idle_wkups", scope: !574, file: !500, line: 272, baseType: !471, size: 64, offset: 896)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_interrupt_wkups", scope: !574, file: !500, line: 273, baseType: !471, size: 64, offset: 960)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pageins", scope: !574, file: !500, line: 274, baseType: !471, size: 64, offset: 1024)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_elapsed_abstime", scope: !574, file: !500, line: 275, baseType: !471, size: 64, offset: 1088)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_bytesread", scope: !574, file: !500, line: 276, baseType: !471, size: 64, offset: 1152)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_byteswritten", scope: !574, file: !500, line: 277, baseType: !471, size: 64, offset: 1216)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_default", scope: !574, file: !500, line: 278, baseType: !471, size: 64, offset: 1280)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_maintenance", scope: !574, file: !500, line: 279, baseType: !471, size: 64, offset: 1344)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_background", scope: !574, file: !500, line: 280, baseType: !471, size: 64, offset: 1408)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_utility", scope: !574, file: !500, line: 281, baseType: !471, size: 64, offset: 1472)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_legacy", scope: !574, file: !500, line: 282, baseType: !471, size: 64, offset: 1536)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_initiated", scope: !574, file: !500, line: 283, baseType: !471, size: 64, offset: 1600)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_interactive", scope: !574, file: !500, line: 284, baseType: !471, size: 64, offset: 1664)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_system_time", scope: !574, file: !500, line: 285, baseType: !471, size: 64, offset: 1728)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_system_time", scope: !574, file: !500, line: 286, baseType: !471, size: 64, offset: 1792)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v4", file: !500, line: 289, size: 2368, elements: !605)
!605 = !{!606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !604, file: !500, line: 290, baseType: !523, size: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !604, file: !500, line: 291, baseType: !471, size: 64, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !604, file: !500, line: 292, baseType: !471, size: 64, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !604, file: !500, line: 293, baseType: !471, size: 64, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !604, file: !500, line: 294, baseType: !471, size: 64, offset: 320)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !604, file: !500, line: 295, baseType: !471, size: 64, offset: 384)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !604, file: !500, line: 296, baseType: !471, size: 64, offset: 448)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !604, file: !500, line: 297, baseType: !471, size: 64, offset: 512)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !604, file: !500, line: 298, baseType: !471, size: 64, offset: 576)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !604, file: !500, line: 299, baseType: !471, size: 64, offset: 640)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !604, file: !500, line: 300, baseType: !471, size: 64, offset: 704)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_user_time", scope: !604, file: !500, line: 301, baseType: !471, size: 64, offset: 768)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_system_time", scope: !604, file: !500, line: 302, baseType: !471, size: 64, offset: 832)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pkg_idle_wkups", scope: !604, file: !500, line: 303, baseType: !471, size: 64, offset: 896)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_interrupt_wkups", scope: !604, file: !500, line: 304, baseType: !471, size: 64, offset: 960)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pageins", scope: !604, file: !500, line: 305, baseType: !471, size: 64, offset: 1024)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_elapsed_abstime", scope: !604, file: !500, line: 306, baseType: !471, size: 64, offset: 1088)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_bytesread", scope: !604, file: !500, line: 307, baseType: !471, size: 64, offset: 1152)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_byteswritten", scope: !604, file: !500, line: 308, baseType: !471, size: 64, offset: 1216)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_default", scope: !604, file: !500, line: 309, baseType: !471, size: 64, offset: 1280)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_maintenance", scope: !604, file: !500, line: 310, baseType: !471, size: 64, offset: 1344)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_background", scope: !604, file: !500, line: 311, baseType: !471, size: 64, offset: 1408)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_utility", scope: !604, file: !500, line: 312, baseType: !471, size: 64, offset: 1472)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_legacy", scope: !604, file: !500, line: 313, baseType: !471, size: 64, offset: 1536)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_initiated", scope: !604, file: !500, line: 314, baseType: !471, size: 64, offset: 1600)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_interactive", scope: !604, file: !500, line: 315, baseType: !471, size: 64, offset: 1664)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_system_time", scope: !604, file: !500, line: 316, baseType: !471, size: 64, offset: 1728)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_system_time", scope: !604, file: !500, line: 317, baseType: !471, size: 64, offset: 1792)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ri_logical_writes", scope: !604, file: !500, line: 318, baseType: !471, size: 64, offset: 1856)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ri_lifetime_max_phys_footprint", scope: !604, file: !500, line: 319, baseType: !471, size: 64, offset: 1920)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ri_instructions", scope: !604, file: !500, line: 320, baseType: !471, size: 64, offset: 1984)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cycles", scope: !604, file: !500, line: 321, baseType: !471, size: 64, offset: 2048)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_energy", scope: !604, file: !500, line: 322, baseType: !471, size: 64, offset: 2112)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_energy", scope: !604, file: !500, line: 323, baseType: !471, size: 64, offset: 2176)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interval_max_phys_footprint", scope: !604, file: !500, line: 324, baseType: !471, size: 64, offset: 2240)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ri_runnable_time", scope: !604, file: !500, line: 325, baseType: !471, size: 64, offset: 2304)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v5", file: !500, line: 328, size: 2432, elements: !643)
!643 = !{!644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !642, file: !500, line: 329, baseType: !523, size: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !642, file: !500, line: 330, baseType: !471, size: 64, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !642, file: !500, line: 331, baseType: !471, size: 64, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !642, file: !500, line: 332, baseType: !471, size: 64, offset: 256)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !642, file: !500, line: 333, baseType: !471, size: 64, offset: 320)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !642, file: !500, line: 334, baseType: !471, size: 64, offset: 384)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !642, file: !500, line: 335, baseType: !471, size: 64, offset: 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !642, file: !500, line: 336, baseType: !471, size: 64, offset: 512)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !642, file: !500, line: 337, baseType: !471, size: 64, offset: 576)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !642, file: !500, line: 338, baseType: !471, size: 64, offset: 640)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !642, file: !500, line: 339, baseType: !471, size: 64, offset: 704)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_user_time", scope: !642, file: !500, line: 340, baseType: !471, size: 64, offset: 768)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_system_time", scope: !642, file: !500, line: 341, baseType: !471, size: 64, offset: 832)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pkg_idle_wkups", scope: !642, file: !500, line: 342, baseType: !471, size: 64, offset: 896)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_interrupt_wkups", scope: !642, file: !500, line: 343, baseType: !471, size: 64, offset: 960)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pageins", scope: !642, file: !500, line: 344, baseType: !471, size: 64, offset: 1024)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_elapsed_abstime", scope: !642, file: !500, line: 345, baseType: !471, size: 64, offset: 1088)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_bytesread", scope: !642, file: !500, line: 346, baseType: !471, size: 64, offset: 1152)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_byteswritten", scope: !642, file: !500, line: 347, baseType: !471, size: 64, offset: 1216)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_default", scope: !642, file: !500, line: 348, baseType: !471, size: 64, offset: 1280)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_maintenance", scope: !642, file: !500, line: 349, baseType: !471, size: 64, offset: 1344)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_background", scope: !642, file: !500, line: 350, baseType: !471, size: 64, offset: 1408)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_utility", scope: !642, file: !500, line: 351, baseType: !471, size: 64, offset: 1472)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_legacy", scope: !642, file: !500, line: 352, baseType: !471, size: 64, offset: 1536)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_initiated", scope: !642, file: !500, line: 353, baseType: !471, size: 64, offset: 1600)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_interactive", scope: !642, file: !500, line: 354, baseType: !471, size: 64, offset: 1664)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_system_time", scope: !642, file: !500, line: 355, baseType: !471, size: 64, offset: 1728)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_system_time", scope: !642, file: !500, line: 356, baseType: !471, size: 64, offset: 1792)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ri_logical_writes", scope: !642, file: !500, line: 357, baseType: !471, size: 64, offset: 1856)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ri_lifetime_max_phys_footprint", scope: !642, file: !500, line: 358, baseType: !471, size: 64, offset: 1920)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ri_instructions", scope: !642, file: !500, line: 359, baseType: !471, size: 64, offset: 1984)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cycles", scope: !642, file: !500, line: 360, baseType: !471, size: 64, offset: 2048)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_energy", scope: !642, file: !500, line: 361, baseType: !471, size: 64, offset: 2112)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_energy", scope: !642, file: !500, line: 362, baseType: !471, size: 64, offset: 2176)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interval_max_phys_footprint", scope: !642, file: !500, line: 363, baseType: !471, size: 64, offset: 2240)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ri_runnable_time", scope: !642, file: !500, line: 364, baseType: !471, size: 64, offset: 2304)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ri_flags", scope: !642, file: !500, line: 365, baseType: !471, size: 64, offset: 2368)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v6", file: !500, line: 368, size: 3712, elements: !682)
!682 = !{!683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !681, file: !500, line: 369, baseType: !523, size: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !681, file: !500, line: 370, baseType: !471, size: 64, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !681, file: !500, line: 371, baseType: !471, size: 64, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !681, file: !500, line: 372, baseType: !471, size: 64, offset: 256)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !681, file: !500, line: 373, baseType: !471, size: 64, offset: 320)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !681, file: !500, line: 374, baseType: !471, size: 64, offset: 384)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !681, file: !500, line: 375, baseType: !471, size: 64, offset: 448)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !681, file: !500, line: 376, baseType: !471, size: 64, offset: 512)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !681, file: !500, line: 377, baseType: !471, size: 64, offset: 576)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !681, file: !500, line: 378, baseType: !471, size: 64, offset: 640)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !681, file: !500, line: 379, baseType: !471, size: 64, offset: 704)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_user_time", scope: !681, file: !500, line: 380, baseType: !471, size: 64, offset: 768)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_system_time", scope: !681, file: !500, line: 381, baseType: !471, size: 64, offset: 832)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pkg_idle_wkups", scope: !681, file: !500, line: 382, baseType: !471, size: 64, offset: 896)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_interrupt_wkups", scope: !681, file: !500, line: 383, baseType: !471, size: 64, offset: 960)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pageins", scope: !681, file: !500, line: 384, baseType: !471, size: 64, offset: 1024)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_elapsed_abstime", scope: !681, file: !500, line: 385, baseType: !471, size: 64, offset: 1088)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_bytesread", scope: !681, file: !500, line: 386, baseType: !471, size: 64, offset: 1152)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_byteswritten", scope: !681, file: !500, line: 387, baseType: !471, size: 64, offset: 1216)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_default", scope: !681, file: !500, line: 388, baseType: !471, size: 64, offset: 1280)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_maintenance", scope: !681, file: !500, line: 389, baseType: !471, size: 64, offset: 1344)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_background", scope: !681, file: !500, line: 390, baseType: !471, size: 64, offset: 1408)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_utility", scope: !681, file: !500, line: 391, baseType: !471, size: 64, offset: 1472)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_legacy", scope: !681, file: !500, line: 392, baseType: !471, size: 64, offset: 1536)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_initiated", scope: !681, file: !500, line: 393, baseType: !471, size: 64, offset: 1600)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_interactive", scope: !681, file: !500, line: 394, baseType: !471, size: 64, offset: 1664)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_system_time", scope: !681, file: !500, line: 395, baseType: !471, size: 64, offset: 1728)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_system_time", scope: !681, file: !500, line: 396, baseType: !471, size: 64, offset: 1792)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ri_logical_writes", scope: !681, file: !500, line: 397, baseType: !471, size: 64, offset: 1856)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ri_lifetime_max_phys_footprint", scope: !681, file: !500, line: 398, baseType: !471, size: 64, offset: 1920)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ri_instructions", scope: !681, file: !500, line: 399, baseType: !471, size: 64, offset: 1984)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cycles", scope: !681, file: !500, line: 400, baseType: !471, size: 64, offset: 2048)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_energy", scope: !681, file: !500, line: 401, baseType: !471, size: 64, offset: 2112)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_energy", scope: !681, file: !500, line: 402, baseType: !471, size: 64, offset: 2176)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interval_max_phys_footprint", scope: !681, file: !500, line: 403, baseType: !471, size: 64, offset: 2240)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ri_runnable_time", scope: !681, file: !500, line: 404, baseType: !471, size: 64, offset: 2304)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ri_flags", scope: !681, file: !500, line: 405, baseType: !471, size: 64, offset: 2368)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_ptime", scope: !681, file: !500, line: 406, baseType: !471, size: 64, offset: 2432)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_ptime", scope: !681, file: !500, line: 407, baseType: !471, size: 64, offset: 2496)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pinstructions", scope: !681, file: !500, line: 408, baseType: !471, size: 64, offset: 2560)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pcycles", scope: !681, file: !500, line: 409, baseType: !471, size: 64, offset: 2624)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ri_energy_nj", scope: !681, file: !500, line: 410, baseType: !471, size: 64, offset: 2688)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ri_penergy_nj", scope: !681, file: !500, line: 411, baseType: !471, size: 64, offset: 2752)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ri_secure_time_in_system", scope: !681, file: !500, line: 412, baseType: !471, size: 64, offset: 2816)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ri_secure_ptime_in_system", scope: !681, file: !500, line: 413, baseType: !471, size: 64, offset: 2880)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ri_neural_footprint", scope: !681, file: !500, line: 414, baseType: !471, size: 64, offset: 2944)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ri_lifetime_max_neural_footprint", scope: !681, file: !500, line: 415, baseType: !471, size: 64, offset: 3008)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interval_max_neural_footprint", scope: !681, file: !500, line: 416, baseType: !471, size: 64, offset: 3072)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ri_reserved", scope: !681, file: !500, line: 417, baseType: !732, size: 576, offset: 3136)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 576, elements: !5)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "rusage_info_current", file: !500, line: 420, baseType: !681)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rlimit", file: !500, line: 464, size: 128, elements: !735)
!735 = !{!736, !737}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_cur", scope: !734, file: !500, line: 465, baseType: !499, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_max", scope: !734, file: !500, line: 466, baseType: !499, size: 64, offset: 64)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "proc_rlimit_control_wakeupmon", file: !500, line: 499, size: 64, elements: !739)
!739 = !{!740, !741}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "wm_flags", scope: !738, file: !500, line: 500, baseType: !469, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "wm_rate", scope: !738, file: !500, line: 501, baseType: !179, size: 32, offset: 32)
!742 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "wait", file: !20, line: 194, size: 32, elements: !743)
!743 = !{!744, !745, !752}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "w_status", scope: !742, file: !20, line: 195, baseType: !37, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "w_T", scope: !742, file: !20, line: 212, baseType: !746, size: 32)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !742, file: !20, line: 199, size: 32, elements: !747)
!747 = !{!748, !749, !750, !751}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "w_Termsig", scope: !746, file: !20, line: 201, baseType: !21, size: 7, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "w_Coredump", scope: !746, file: !20, line: 202, baseType: !21, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "w_Retcode", scope: !746, file: !20, line: 203, baseType: !21, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "w_Filler", scope: !746, file: !20, line: 204, baseType: !21, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "w_S", scope: !742, file: !20, line: 229, baseType: !753, size: 32)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !742, file: !20, line: 218, size: 32, elements: !754)
!754 = !{!755, !756, !757}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "w_Stopval", scope: !753, file: !20, line: 220, baseType: !21, size: 8, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "w_Stopsig", scope: !753, file: !20, line: 221, baseType: !21, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "w_Filler", scope: !753, file: !20, line: 222, baseType: !21, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "ct_rune_t", file: !759, line: 32, baseType: !46)
!759 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_ct_rune_t.h", directory: "", checksumkind: CSK_MD5, checksum: "c22112154646d7509ef295660b838a0e")
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "rune_t", file: !761, line: 31, baseType: !63)
!761 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_rune_t.h", directory: "", checksumkind: CSK_MD5, checksum: "f2344ffb16201340bfd175b1637ea60f")
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !763, line: 53, baseType: !62)
!763 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_wchar_t.h", directory: "", checksumkind: CSK_MD5, checksum: "7c8733b31e382e8074a475f5c41f1e03")
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !765, line: 83, size: 64, elements: !766)
!765 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "1fbf79127e45bcc71ac6e64ce165d68a")
!766 = !{!767, !768}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !764, file: !765, line: 84, baseType: !37, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !764, file: !765, line: 85, baseType: !37, size: 32, offset: 32)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !765, line: 86, baseType: !764)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !765, line: 88, size: 128, elements: !771)
!771 = !{!772, !773}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !770, file: !765, line: 89, baseType: !44, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !770, file: !765, line: 90, baseType: !44, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !765, line: 91, baseType: !770)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !765, line: 94, size: 128, elements: !776)
!776 = !{!777, !778}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !775, file: !765, line: 95, baseType: !40, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !775, file: !765, line: 96, baseType: !40, size: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !765, line: 97, baseType: !775)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "malloc_type_id_t", file: !781, line: 30, baseType: !42)
!781 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/malloc/_malloc_type.h", directory: "", checksumkind: CSK_MD5, checksum: "d42ade5b4592df6ab4d40d7d5990e609")
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "malloc_zone_t", file: !781, line: 63, baseType: !783)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "_malloc_zone_t", file: !781, line: 63, flags: DIFlagFwdDecl)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !785, line: 31, baseType: !72)
!785 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_dev_t.h", directory: "", checksumkind: CSK_MD5, checksum: "48c1388efd95518803dfc92f7c613390")
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !787, line: 31, baseType: !81)
!787 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_mode_t.h", directory: "", checksumkind: CSK_MD5, checksum: "9d25d351341bf46798d552a73c506c13")
!788 = !{!0, !7, !12}
!789 = !{i32 7, !"Dwarf Version", i32 5}
!790 = !{i32 2, !"Debug Info Version", i32 3}
!791 = !{i32 1, !"wchar_size", i32 4}
!792 = !{i32 8, !"PIC Level", i32 2}
!793 = !{i32 7, !"uwtable", i32 1}
!794 = !{i32 7, !"frame-pointer", i32 1}
!795 = !{!"Homebrew clang version 19.1.4"}
!796 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 4, type: !797, scopeLine: 4, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !799)
!797 = !DISubroutineType(types: !798)
!798 = !{!37}
!799 = !{}
!800 = !DILocalVariable(name: "str1", scope: !796, file: !2, line: 5, type: !801)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8000, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 1000)
!804 = !DILocation(line: 5, column: 10, scope: !796)
!805 = !DILocalVariable(name: "fp", scope: !796, file: !2, line: 6, type: !806)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!807 = !DILocation(line: 6, column: 11, scope: !796)
!808 = !DILocation(line: 7, column: 10, scope: !796)
!809 = !DILocation(line: 7, column: 8, scope: !796)
!810 = !DILocalVariable(name: "c", scope: !796, file: !2, line: 9, type: !4)
!811 = !DILocation(line: 9, column: 10, scope: !796)
!812 = !DILocalVariable(name: "len", scope: !796, file: !2, line: 10, type: !37)
!813 = !DILocation(line: 10, column: 9, scope: !796)
!814 = !DILocation(line: 11, column: 5, scope: !796)
!815 = !DILocation(line: 12, column: 22, scope: !816)
!816 = distinct !DILexicalBlock(scope: !817, file: !2, line: 12, column: 13)
!817 = distinct !DILexicalBlock(scope: !796, file: !2, line: 11, column: 15)
!818 = !DILocation(line: 12, column: 17, scope: !816)
!819 = !DILocation(line: 12, column: 16, scope: !816)
!820 = !DILocation(line: 12, column: 13, scope: !816)
!821 = !DILocation(line: 12, column: 27, scope: !816)
!822 = !DILocation(line: 12, column: 13, scope: !817)
!823 = !DILocation(line: 12, column: 35, scope: !816)
!824 = !DILocation(line: 13, column: 13, scope: !825)
!825 = distinct !DILexicalBlock(scope: !817, file: !2, line: 13, column: 13)
!826 = !DILocation(line: 13, column: 17, scope: !825)
!827 = !DILocation(line: 13, column: 13, scope: !817)
!828 = !DILocation(line: 13, column: 26, scope: !825)
!829 = !DILocation(line: 14, column: 23, scope: !817)
!830 = !DILocation(line: 14, column: 17, scope: !817)
!831 = !DILocation(line: 14, column: 9, scope: !817)
!832 = !DILocation(line: 14, column: 21, scope: !817)
!833 = distinct !{!833, !814, !834}
!834 = !DILocation(line: 15, column: 5, scope: !796)
!835 = !DILocation(line: 16, column: 10, scope: !796)
!836 = !DILocation(line: 16, column: 5, scope: !796)
