; ModuleID = 'test4.c'
source_filename = "test4.c"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx15.0.0"

%struct.Park = type { i32, double, double, i32, [41 x i8], [5 x [13 x i8]] }
%struct.Catalog = type { ptr, i32, i32 }

@.str = private unnamed_addr constant [2 x i8] c"r\00", align 1, !dbg !0
@__stderrp = external global ptr, align 8
@.str.1 = private unnamed_addr constant [21 x i8] c"Can't open file: %s\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !12
@.str.3 = private unnamed_addr constant [11 x i8] c"%d %lf %lf\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [23 x i8] c"Invalid park file: %s\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [29 x i8] c"%-3s %-40s %8s %8s Counties\0A\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [3 x i8] c"ID\00", align 1, !dbg !32
@.str.7 = private unnamed_addr constant [5 x i8] c"Name\00", align 1, !dbg !37
@.str.8 = private unnamed_addr constant [4 x i8] c"Lat\00", align 1, !dbg !42
@.str.9 = private unnamed_addr constant [4 x i8] c"Lon\00", align 1, !dbg !47
@.str.10 = private unnamed_addr constant [26 x i8] c"%-3d %-40s %8.3lf %8.3lf \00", align 1, !dbg !49
@.str.11 = private unnamed_addr constant [3 x i8] c"%s\00", align 1, !dbg !54
@.str.12 = private unnamed_addr constant [2 x i8] c",\00", align 1, !dbg !56

!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !71, line: 37, baseType: !83)
!83 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !71, line: 38, baseType: !85)
!85 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !71, line: 40, baseType: !87)
!87 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_natural_t", file: !71, line: 41, baseType: !64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ct_rune_t", file: !71, line: 61, baseType: !80)
!90 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !71, line: 67, size: 1024, elements: !91)
!91 = !{!92, !96}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !90, file: !71, line: 68, baseType: !93, size: 1024)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !90, file: !71, line: 69, baseType: !83, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !71, line: 70, baseType: !90)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mbstate_t", file: !71, line: 72, baseType: !97)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ptrdiff_t", file: !71, line: 77, baseType: !87)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !71, line: 87, baseType: !101)
!101 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_va_list", file: !71, line: 95, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !2, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wchar_t", file: !71, line: 103, baseType: !80)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_rune_t", file: !71, line: 108, baseType: !105)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wint_t", file: !71, line: 111, baseType: !80)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_clock_t", file: !71, line: 116, baseType: !101)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_socklen_t", file: !71, line: 117, baseType: !81)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ssize_t", file: !71, line: 118, baseType: !87)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !71, line: 119, baseType: !87)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blkcnt_t", file: !113, line: 67, baseType: !82)
!113 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "af82ff6119a9fa80fad635d276556d46")
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blksize_t", file: !113, line: 68, baseType: !79)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_dev_t", file: !113, line: 69, baseType: !79)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_fsblkcnt_t", file: !113, line: 70, baseType: !64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_fsfilcnt_t", file: !113, line: 71, baseType: !64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_gid_t", file: !113, line: 72, baseType: !81)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_id_t", file: !113, line: 73, baseType: !81)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ino64_t", file: !113, line: 74, baseType: !84)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ino_t", file: !113, line: 76, baseType: !120)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mach_port_name_t", file: !113, line: 80, baseType: !88)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mach_port_t", file: !113, line: 81, baseType: !122)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mode_t", file: !113, line: 82, baseType: !77)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !113, line: 83, baseType: !82)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pid_t", file: !113, line: 84, baseType: !79)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_sigset_t", file: !113, line: 85, baseType: !81)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_suseconds_t", file: !113, line: 86, baseType: !79)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uid_t", file: !113, line: 87, baseType: !81)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_useconds_t", file: !113, line: 88, baseType: !81)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uuid_t", file: !113, line: 89, baseType: !132)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 128, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 16)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uuid_string_t", file: !113, line: 90, baseType: !136)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 37)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_pthread_handler_rec", file: !140, line: 57, size: 192, elements: !141)
!140 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_pthread/_pthread_types.h", directory: "", checksumkind: CSK_MD5, checksum: "4e2ea0e1af95894da0a6030a21a8ebee")
!141 = !{!142, !147, !148}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__routine", scope: !139, file: !140, line: 58, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{null, !146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__arg", scope: !139, file: !140, line: 59, baseType: !146, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !139, file: !140, line: 60, baseType: !149, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_attr_t", file: !140, line: 63, size: 512, elements: !151)
!151 = !{!152, !153}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !150, file: !140, line: 64, baseType: !87, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !150, file: !140, line: 65, baseType: !154, size: 448, offset: 64)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 56)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_cond_t", file: !140, line: 68, size: 384, elements: !158)
!158 = !{!159, !160}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !157, file: !140, line: 69, baseType: !87, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !157, file: !140, line: 70, baseType: !161, size: 320, offset: 64)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 40)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_condattr_t", file: !140, line: 73, size: 128, elements: !165)
!165 = !{!166, !167}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !164, file: !140, line: 74, baseType: !87, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !164, file: !140, line: 75, baseType: !168, size: 64, offset: 64)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 8)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_mutex_t", file: !140, line: 78, size: 512, elements: !172)
!172 = !{!173, !174}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !171, file: !140, line: 79, baseType: !87, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !171, file: !140, line: 80, baseType: !154, size: 448, offset: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_mutexattr_t", file: !140, line: 83, size: 128, elements: !176)
!176 = !{!177, !178}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !175, file: !140, line: 84, baseType: !87, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !175, file: !140, line: 85, baseType: !168, size: 64, offset: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_once_t", file: !140, line: 88, size: 128, elements: !180)
!180 = !{!181, !182}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !179, file: !140, line: 89, baseType: !87, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !179, file: !140, line: 90, baseType: !168, size: 64, offset: 64)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_rwlock_t", file: !140, line: 93, size: 1600, elements: !184)
!184 = !{!185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !183, file: !140, line: 94, baseType: !87, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !183, file: !140, line: 95, baseType: !187, size: 1536, offset: 64)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1536, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 192)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_rwlockattr_t", file: !140, line: 98, size: 192, elements: !191)
!191 = !{!192, !193}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !190, file: !140, line: 99, baseType: !87, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !190, file: !140, line: 100, baseType: !194, size: 128, offset: 64)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !133)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_t", file: !140, line: 103, size: 65536, elements: !196)
!196 = !{!197, !198, !199}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !195, file: !140, line: 104, baseType: !87, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup_stack", scope: !195, file: !140, line: 105, baseType: !149, size: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !195, file: !140, line: 106, baseType: !200, size: 65408, offset: 128)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 65408, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 8176)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_attr_t", file: !140, line: 109, baseType: !150)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_cond_t", file: !140, line: 110, baseType: !157)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_condattr_t", file: !140, line: 111, baseType: !164)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_key_t", file: !140, line: 112, baseType: !101)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_mutex_t", file: !140, line: 113, baseType: !171)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_mutexattr_t", file: !140, line: 114, baseType: !175)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_once_t", file: !140, line: 115, baseType: !179)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_rwlock_t", file: !140, line: 116, baseType: !183)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_rwlockattr_t", file: !140, line: 117, baseType: !190)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_t", file: !140, line: 118, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_nl_item", file: !215, line: 40, baseType: !80)
!215 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "bd2087c8ee278624cee561f95099160e")
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctrans_t", file: !215, line: 41, baseType: !80)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctype_t", file: !215, line: 43, baseType: !81)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "idtype_t", file: !63, line: 83, baseType: !62)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !220, line: 31, baseType: !126)
!220 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_pid_t.h", directory: "", checksumkind: CSK_MD5, checksum: "86a3851b3039dd75e6cc5a8b4f2b3461")
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "id_t", file: !222, line: 31, baseType: !119)
!222 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_id_t.h", directory: "", checksumkind: CSK_MD5, checksum: "985e35d2b2c7e6ea13869fc8cd0b5949")
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !224, line: 17, baseType: !80)
!224 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/arm/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "802a7d5a263aebe8f27d5d67c7ad4b44")
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !226, line: 30, baseType: !72)
!226 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5052dfe782b50fed2355b8f61a9e4fa9")
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !228, line: 30, baseType: !76)
!228 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "47ed3c3ac6f65bfec021ca2b7be18e7e")
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !230, line: 30, baseType: !80)
!230 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "d23e8406e80ee79983f28509c741fa17")
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !232, line: 30, baseType: !83)
!232 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e6d85c1a9e23dbf7518ce3b162aac800")
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int8_t", file: !234, line: 30, baseType: !74)
!234 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_u_int8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "cf25460e3a2d25a50de2bd9cd0738ad8")
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int16_t", file: !236, line: 30, baseType: !78)
!236 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_u_int16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "20fb61aa655de1ae21f6fe1799ea5928")
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int32_t", file: !238, line: 30, baseType: !64)
!238 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_u_int32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "1be414e13025ba0d11004877ba3f558a")
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int64_t", file: !240, line: 30, baseType: !85)
!240 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_u_int64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "466f994226288d9979ea32e237e3f3c2")
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "register_t", file: !242, line: 66, baseType: !231)
!242 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/arm/types.h", directory: "", checksumkind: CSK_MD5, checksum: "bd345bb749b5098b0f191abe2c0d3eb4")
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !244, line: 32, baseType: !86)
!244 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_intptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e478ba47270923b1cca6659f19f02db1")
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !246, line: 34, baseType: !101)
!246 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e70ae655dd1b9d4ae0b1dcc073f5b7e4")
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_addr_t", file: !242, line: 77, baseType: !239)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_size_t", file: !242, line: 78, baseType: !239)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_ssize_t", file: !242, line: 79, baseType: !231)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_long_t", file: !242, line: 80, baseType: !231)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_ulong_t", file: !242, line: 81, baseType: !239)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_time_t", file: !242, line: 82, baseType: !231)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_off_t", file: !242, line: 83, baseType: !231)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "syscall_arg_t", file: !242, line: 105, baseType: !239)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_exception_state", file: !256, line: 41, size: 96, elements: !257)
!256 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/mach/arm/_structs.h", directory: "", checksumkind: CSK_MD5, checksum: "fc9233eb351901bd9aae4f5912643825")
!257 = !{!258, !259, !260}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__exception", scope: !255, file: !256, line: 43, baseType: !81, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__fsr", scope: !255, file: !256, line: 44, baseType: !81, size: 32, offset: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__far", scope: !255, file: !256, line: 45, baseType: !81, size: 32, offset: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_exception_state64", file: !256, line: 59, size: 128, elements: !262)
!262 = !{!263, !264, !265}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__far", scope: !261, file: !256, line: 61, baseType: !84, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "__esr", scope: !261, file: !256, line: 62, baseType: !81, size: 32, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "__exception", scope: !261, file: !256, line: 63, baseType: !81, size: 32, offset: 96)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_exception_state64_v2", file: !256, line: 66, size: 128, elements: !267)
!267 = !{!268, !269}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__far", scope: !266, file: !256, line: 68, baseType: !84, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "__esr", scope: !266, file: !256, line: 69, baseType: !84, size: 64, offset: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_thread_state", file: !256, line: 89, size: 544, elements: !271)
!271 = !{!272, !276, !277, !278, !279}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__r", scope: !270, file: !256, line: 91, baseType: !273, size: 416)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 416, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 13)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__sp", scope: !270, file: !256, line: 92, baseType: !81, size: 32, offset: 416)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__lr", scope: !270, file: !256, line: 93, baseType: !81, size: 32, offset: 448)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__pc", scope: !270, file: !256, line: 94, baseType: !81, size: 32, offset: 480)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__cpsr", scope: !270, file: !256, line: 95, baseType: !81, size: 32, offset: 512)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_thread_state64", file: !256, line: 148, size: 2176, elements: !281)
!281 = !{!282, !284, !285, !286, !287, !288, !289}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__x", scope: !280, file: !256, line: 150, baseType: !283, size: 1856)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 1856, elements: !30)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__fp", scope: !280, file: !256, line: 151, baseType: !84, size: 64, offset: 1856)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__lr", scope: !280, file: !256, line: 152, baseType: !84, size: 64, offset: 1920)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "__sp", scope: !280, file: !256, line: 153, baseType: !84, size: 64, offset: 1984)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__pc", scope: !280, file: !256, line: 154, baseType: !84, size: 64, offset: 2048)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "__cpsr", scope: !280, file: !256, line: 155, baseType: !81, size: 32, offset: 2112)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "__pad", scope: !280, file: !256, line: 156, baseType: !81, size: 32, offset: 2144)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_vfp_state", file: !256, line: 519, size: 2080, elements: !291)
!291 = !{!292, !296}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__r", scope: !290, file: !256, line: 521, baseType: !293, size: 2048)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 2048, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "__fpscr", scope: !290, file: !256, line: 522, baseType: !81, size: 32, offset: 2048)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_neon_state64", file: !256, line: 538, size: 4224, elements: !298)
!298 = !{!299, !305, !306}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__v", scope: !297, file: !256, line: 540, baseType: !300, size: 4096)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 4096, elements: !303)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint128_t", file: !2, baseType: !302)
!302 = !DIBasicType(name: "unsigned __int128", size: 128, encoding: DW_ATE_unsigned)
!303 = !{!304}
!304 = !DISubrange(count: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__fpsr", scope: !297, file: !256, line: 541, baseType: !81, size: 32, offset: 4096)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__fpcr", scope: !297, file: !256, line: 542, baseType: !81, size: 32, offset: 4128)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_neon_state", file: !256, line: 545, size: 2176, elements: !308)
!308 = !{!309, !311, !312}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__v", scope: !307, file: !256, line: 547, baseType: !310, size: 2048)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 2048, elements: !133)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__fpsr", scope: !307, file: !256, line: 548, baseType: !81, size: 32, offset: 2048)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "__fpcr", scope: !307, file: !256, line: 549, baseType: !81, size: 32, offset: 2080)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__arm_pagein_state", file: !256, line: 609, size: 32, elements: !314)
!314 = !{!315}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__pagein_error", scope: !313, file: !256, line: 611, baseType: !80, size: 32)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__arm_legacy_debug_state", file: !256, line: 646, size: 2048, elements: !317)
!317 = !{!318, !320, !321, !322}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__bvr", scope: !316, file: !256, line: 648, baseType: !319, size: 512)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 512, elements: !133)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "__bcr", scope: !316, file: !256, line: 649, baseType: !319, size: 512, offset: 512)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__wvr", scope: !316, file: !256, line: 650, baseType: !319, size: 512, offset: 1024)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__wcr", scope: !316, file: !256, line: 651, baseType: !319, size: 512, offset: 1536)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_debug_state32", file: !256, line: 669, size: 2112, elements: !324)
!324 = !{!325, !326, !327, !328, !329}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "__bvr", scope: !323, file: !256, line: 671, baseType: !319, size: 512)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "__bcr", scope: !323, file: !256, line: 672, baseType: !319, size: 512, offset: 512)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "__wvr", scope: !323, file: !256, line: 673, baseType: !319, size: 512, offset: 1024)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__wcr", scope: !323, file: !256, line: 674, baseType: !319, size: 512, offset: 1536)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__mdscr_el1", scope: !323, file: !256, line: 675, baseType: !84, size: 64, offset: 2048)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_debug_state64", file: !256, line: 679, size: 4160, elements: !331)
!331 = !{!332, !334, !335, !336, !337}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__bvr", scope: !330, file: !256, line: 681, baseType: !333, size: 1024)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 1024, elements: !133)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__bcr", scope: !330, file: !256, line: 682, baseType: !333, size: 1024, offset: 1024)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__wvr", scope: !330, file: !256, line: 683, baseType: !333, size: 1024, offset: 2048)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__wcr", scope: !330, file: !256, line: 684, baseType: !333, size: 1024, offset: 3072)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__mdscr_el1", scope: !330, file: !256, line: 685, baseType: !84, size: 64, offset: 4096)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_cpmu_state64", file: !256, line: 711, size: 1024, elements: !339)
!339 = !{!340}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__ctrs", scope: !338, file: !256, line: 713, baseType: !333, size: 1024)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_mcontext32", file: !342, line: 41, size: 2720, elements: !343)
!342 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/arm/_mcontext.h", directory: "", checksumkind: CSK_MD5, checksum: "da7c261f76f98eb3bbd7ed11c4aaa3d8")
!343 = !{!344, !345, !346}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__es", scope: !341, file: !342, line: 43, baseType: !255, size: 96)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__ss", scope: !341, file: !342, line: 44, baseType: !270, size: 544, offset: 96)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__fs", scope: !341, file: !342, line: 45, baseType: !290, size: 2080, offset: 640)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_mcontext64", file: !342, line: 64, size: 6528, elements: !348)
!348 = !{!349, !350, !351}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "__es", scope: !347, file: !342, line: 66, baseType: !261, size: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__ss", scope: !347, file: !342, line: 67, baseType: !280, size: 2176, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__ns", scope: !347, file: !342, line: 68, baseType: !297, size: 4224, offset: 2304)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "mcontext_t", file: !342, line: 85, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_attr_t", file: !355, line: 31, baseType: !203)
!355 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_pthread/_pthread_attr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "383e78324250b910a1128f1b9a464b23")
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_sigaltstack", file: !357, line: 42, size: 192, elements: !358)
!357 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_sigaltstack.h", directory: "", checksumkind: CSK_MD5, checksum: "d308a81f239c930cbd1b1f2eee3fc6c1")
!358 = !{!359, !360, !361}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ss_sp", scope: !356, file: !357, line: 44, baseType: !146, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ss_size", scope: !356, file: !357, line: 45, baseType: !100, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ss_flags", scope: !356, file: !357, line: 46, baseType: !80, size: 32, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "stack_t", file: !357, line: 48, baseType: !356)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_ucontext", file: !364, line: 43, size: 448, elements: !365)
!364 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_ucontext.h", directory: "", checksumkind: CSK_MD5, checksum: "c9464687b003449106b679928ca1b348")
!365 = !{!366, !367, !368, !369, !371, !372}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "uc_onstack", scope: !363, file: !364, line: 45, baseType: !80, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "uc_sigmask", scope: !363, file: !364, line: 46, baseType: !127, size: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "uc_stack", scope: !363, file: !364, line: 47, baseType: !356, size: 192, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "uc_link", scope: !363, file: !364, line: 48, baseType: !370, size: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "uc_mcsize", scope: !363, file: !364, line: 49, baseType: !100, size: 64, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "uc_mcontext", scope: !363, file: !364, line: 50, baseType: !353, size: 64, offset: 384)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucontext_t", file: !364, line: 57, baseType: !363)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !375, line: 31, baseType: !127)
!375 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "437b33d322f60e932c1e1199626d9393")
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !377, line: 50, baseType: !100)
!377 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "f7981334d28e0c246f35cd24042aa2a4")
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !379, line: 31, baseType: !129)
!379 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_uid_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2a704f772d04abefb01de36d246e45dd")
!380 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !381, line: 158, size: 64, elements: !382)
!381 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "541f2577a63933b8824579532ef86917")
!382 = !{!383, !384}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !380, file: !381, line: 160, baseType: !80, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !380, file: !381, line: 161, baseType: !146, size: 64)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigevent", file: !381, line: 168, size: 256, elements: !386)
!386 = !{!387, !388, !389, !390, !394}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_notify", scope: !385, file: !381, line: 169, baseType: !80, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_signo", scope: !385, file: !381, line: 170, baseType: !80, size: 32, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_value", scope: !385, file: !381, line: 171, baseType: !380, size: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_notify_function", scope: !385, file: !381, line: 172, baseType: !391, size: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{null, !380}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_notify_attributes", scope: !385, file: !381, line: 173, baseType: !395, size: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__siginfo", file: !381, line: 177, size: 832, elements: !397)
!397 = !{!398, !399, !400, !401, !402, !403, !404, !405, !406, !407}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !396, file: !381, line: 178, baseType: !80, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !396, file: !381, line: 179, baseType: !80, size: 32, offset: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !396, file: !381, line: 180, baseType: !80, size: 32, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !396, file: !381, line: 181, baseType: !219, size: 32, offset: 96)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !396, file: !381, line: 182, baseType: !378, size: 32, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !396, file: !381, line: 183, baseType: !80, size: 32, offset: 160)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !396, file: !381, line: 184, baseType: !146, size: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "si_value", scope: !396, file: !381, line: 185, baseType: !380, size: 64, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !396, file: !381, line: 186, baseType: !87, size: 64, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "__pad", scope: !396, file: !381, line: 187, baseType: !408, size: 448, offset: 384)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 448, elements: !409)
!409 = !{!410}
!410 = !DISubrange(count: 7)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !381, line: 188, baseType: !396)
!412 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__sigaction_u", file: !381, line: 269, size: 64, elements: !413)
!413 = !{!414, !418}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "__sa_handler", scope: !412, file: !381, line: 270, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !80}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "__sa_sigaction", scope: !412, file: !381, line: 271, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !80, !422, !146}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sigaction", file: !381, line: 276, size: 192, elements: !424)
!424 = !{!425, !426, !431, !432}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_u", scope: !423, file: !381, line: 277, baseType: !412, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "sa_tramp", scope: !423, file: !381, line: 278, baseType: !427, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !146, !80, !80, !430, !146}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !423, file: !381, line: 279, baseType: !374, size: 32, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !423, file: !381, line: 280, baseType: !80, size: 32, offset: 160)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !381, line: 286, size: 128, elements: !434)
!434 = !{!435, !436, !437}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_u", scope: !433, file: !381, line: 287, baseType: !412, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !433, file: !381, line: 288, baseType: !374, size: 32, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !433, file: !381, line: 289, baseType: !80, size: 32, offset: 96)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_t", file: !381, line: 331, baseType: !415)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigvec", file: !381, line: 348, size: 128, elements: !440)
!440 = !{!441, !442, !443}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "sv_handler", scope: !439, file: !381, line: 349, baseType: !415, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sv_mask", scope: !439, file: !381, line: 350, baseType: !80, size: 32, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !439, file: !381, line: 351, baseType: !80, size: 32, offset: 96)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigstack", file: !381, line: 367, size: 128, elements: !445)
!445 = !{!446, !447}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ss_sp", scope: !444, file: !381, line: 368, baseType: !104, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ss_onstack", scope: !444, file: !381, line: 369, baseType: !80, size: 32, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !449, line: 31, baseType: !74)
!449 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8b64ccf8c67b8c006b07b8daf1b49be5")
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !451, line: 31, baseType: !78)
!451 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "f0aa926da906b10566dd3171bf347ab7")
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !453, line: 31, baseType: !64)
!453 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "0254eb80c6b9719ac45c3c1cf872109b")
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !455, line: 31, baseType: !85)
!455 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "77fc5e91653260959605f129691cf9b1")
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !457, line: 29, baseType: !225)
!457 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "042ceedaf4137a8aaa272d0b27434016")
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !457, line: 30, baseType: !227)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !457, line: 31, baseType: !229)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !457, line: 32, baseType: !231)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !457, line: 33, baseType: !448)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !457, line: 34, baseType: !450)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !457, line: 35, baseType: !452)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !457, line: 36, baseType: !454)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !457, line: 40, baseType: !225)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !457, line: 41, baseType: !227)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !457, line: 42, baseType: !229)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !457, line: 43, baseType: !231)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !457, line: 44, baseType: !448)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !457, line: 45, baseType: !450)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !457, line: 46, baseType: !452)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !457, line: 47, baseType: !454)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !474, line: 32, baseType: !87)
!474 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_intmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e37b9240f30f486478152ef3989b1545")
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !476, line: 32, baseType: !101)
!476 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uintmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8217a3fbb207d8e87ca5318c313e81c2")
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !478, line: 34, size: 128, elements: !479)
!478 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "24f84d4e0450b2e5ff976a6f6da860d2")
!479 = !{!480, !481}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !477, file: !478, line: 36, baseType: !111, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !477, file: !478, line: 37, baseType: !128, size: 32, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "rlim_t", file: !483, line: 89, baseType: !84)
!483 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/resource.h", directory: "", checksumkind: CSK_MD5, checksum: "c4e799a130a69d94f00fda9cbd994906")
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage", file: !483, line: 152, size: 1152, elements: !485)
!485 = !{!486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ru_utime", scope: !484, file: !483, line: 153, baseType: !477, size: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ru_stime", scope: !484, file: !483, line: 154, baseType: !477, size: 128, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ru_maxrss", scope: !484, file: !483, line: 163, baseType: !87, size: 64, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ru_ixrss", scope: !484, file: !483, line: 165, baseType: !87, size: 64, offset: 320)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ru_idrss", scope: !484, file: !483, line: 166, baseType: !87, size: 64, offset: 384)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ru_isrss", scope: !484, file: !483, line: 167, baseType: !87, size: 64, offset: 448)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ru_minflt", scope: !484, file: !483, line: 168, baseType: !87, size: 64, offset: 512)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ru_majflt", scope: !484, file: !483, line: 169, baseType: !87, size: 64, offset: 576)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nswap", scope: !484, file: !483, line: 170, baseType: !87, size: 64, offset: 640)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ru_inblock", scope: !484, file: !483, line: 171, baseType: !87, size: 64, offset: 704)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ru_oublock", scope: !484, file: !483, line: 172, baseType: !87, size: 64, offset: 768)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgsnd", scope: !484, file: !483, line: 173, baseType: !87, size: 64, offset: 832)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgrcv", scope: !484, file: !483, line: 174, baseType: !87, size: 64, offset: 896)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nsignals", scope: !484, file: !483, line: 175, baseType: !87, size: 64, offset: 960)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nvcsw", scope: !484, file: !483, line: 176, baseType: !87, size: 64, offset: 1024)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nivcsw", scope: !484, file: !483, line: 177, baseType: !87, size: 64, offset: 1088)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "rusage_info_t", file: !483, line: 200, baseType: !146)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v0", file: !483, line: 202, size: 768, elements: !504)
!504 = !{!505, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !503, file: !483, line: 203, baseType: !506, size: 128)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 128, elements: !133)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !503, file: !483, line: 204, baseType: !454, size: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !503, file: !483, line: 205, baseType: !454, size: 64, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !503, file: !483, line: 206, baseType: !454, size: 64, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !503, file: !483, line: 207, baseType: !454, size: 64, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !503, file: !483, line: 208, baseType: !454, size: 64, offset: 384)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !503, file: !483, line: 209, baseType: !454, size: 64, offset: 448)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !503, file: !483, line: 210, baseType: !454, size: 64, offset: 512)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !503, file: !483, line: 211, baseType: !454, size: 64, offset: 576)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !503, file: !483, line: 212, baseType: !454, size: 64, offset: 640)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !503, file: !483, line: 213, baseType: !454, size: 64, offset: 704)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v1", file: !483, line: 216, size: 1152, elements: !518)
!518 = !{!519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !517, file: !483, line: 217, baseType: !506, size: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !517, file: !483, line: 218, baseType: !454, size: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !517, file: !483, line: 219, baseType: !454, size: 64, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !517, file: !483, line: 220, baseType: !454, size: 64, offset: 256)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !517, file: !483, line: 221, baseType: !454, size: 64, offset: 320)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !517, file: !483, line: 222, baseType: !454, size: 64, offset: 384)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !517, file: !483, line: 223, baseType: !454, size: 64, offset: 448)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !517, file: !483, line: 224, baseType: !454, size: 64, offset: 512)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !517, file: !483, line: 225, baseType: !454, size: 64, offset: 576)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !517, file: !483, line: 226, baseType: !454, size: 64, offset: 640)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !517, file: !483, line: 227, baseType: !454, size: 64, offset: 704)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_user_time", scope: !517, file: !483, line: 228, baseType: !454, size: 64, offset: 768)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_system_time", scope: !517, file: !483, line: 229, baseType: !454, size: 64, offset: 832)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pkg_idle_wkups", scope: !517, file: !483, line: 230, baseType: !454, size: 64, offset: 896)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_interrupt_wkups", scope: !517, file: !483, line: 231, baseType: !454, size: 64, offset: 960)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pageins", scope: !517, file: !483, line: 232, baseType: !454, size: 64, offset: 1024)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_elapsed_abstime", scope: !517, file: !483, line: 233, baseType: !454, size: 64, offset: 1088)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v2", file: !483, line: 236, size: 1280, elements: !537)
!537 = !{!538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !536, file: !483, line: 237, baseType: !506, size: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !536, file: !483, line: 238, baseType: !454, size: 64, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !536, file: !483, line: 239, baseType: !454, size: 64, offset: 192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !536, file: !483, line: 240, baseType: !454, size: 64, offset: 256)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !536, file: !483, line: 241, baseType: !454, size: 64, offset: 320)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !536, file: !483, line: 242, baseType: !454, size: 64, offset: 384)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !536, file: !483, line: 243, baseType: !454, size: 64, offset: 448)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !536, file: !483, line: 244, baseType: !454, size: 64, offset: 512)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !536, file: !483, line: 245, baseType: !454, size: 64, offset: 576)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !536, file: !483, line: 246, baseType: !454, size: 64, offset: 640)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !536, file: !483, line: 247, baseType: !454, size: 64, offset: 704)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_user_time", scope: !536, file: !483, line: 248, baseType: !454, size: 64, offset: 768)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_system_time", scope: !536, file: !483, line: 249, baseType: !454, size: 64, offset: 832)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pkg_idle_wkups", scope: !536, file: !483, line: 250, baseType: !454, size: 64, offset: 896)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_interrupt_wkups", scope: !536, file: !483, line: 251, baseType: !454, size: 64, offset: 960)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pageins", scope: !536, file: !483, line: 252, baseType: !454, size: 64, offset: 1024)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_elapsed_abstime", scope: !536, file: !483, line: 253, baseType: !454, size: 64, offset: 1088)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_bytesread", scope: !536, file: !483, line: 254, baseType: !454, size: 64, offset: 1152)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_byteswritten", scope: !536, file: !483, line: 255, baseType: !454, size: 64, offset: 1216)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v3", file: !483, line: 258, size: 1856, elements: !558)
!558 = !{!559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !557, file: !483, line: 259, baseType: !506, size: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !557, file: !483, line: 260, baseType: !454, size: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !557, file: !483, line: 261, baseType: !454, size: 64, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !557, file: !483, line: 262, baseType: !454, size: 64, offset: 256)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !557, file: !483, line: 263, baseType: !454, size: 64, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !557, file: !483, line: 264, baseType: !454, size: 64, offset: 384)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !557, file: !483, line: 265, baseType: !454, size: 64, offset: 448)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !557, file: !483, line: 266, baseType: !454, size: 64, offset: 512)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !557, file: !483, line: 267, baseType: !454, size: 64, offset: 576)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !557, file: !483, line: 268, baseType: !454, size: 64, offset: 640)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !557, file: !483, line: 269, baseType: !454, size: 64, offset: 704)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_user_time", scope: !557, file: !483, line: 270, baseType: !454, size: 64, offset: 768)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_system_time", scope: !557, file: !483, line: 271, baseType: !454, size: 64, offset: 832)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pkg_idle_wkups", scope: !557, file: !483, line: 272, baseType: !454, size: 64, offset: 896)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_interrupt_wkups", scope: !557, file: !483, line: 273, baseType: !454, size: 64, offset: 960)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pageins", scope: !557, file: !483, line: 274, baseType: !454, size: 64, offset: 1024)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_elapsed_abstime", scope: !557, file: !483, line: 275, baseType: !454, size: 64, offset: 1088)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_bytesread", scope: !557, file: !483, line: 276, baseType: !454, size: 64, offset: 1152)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_byteswritten", scope: !557, file: !483, line: 277, baseType: !454, size: 64, offset: 1216)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_default", scope: !557, file: !483, line: 278, baseType: !454, size: 64, offset: 1280)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_maintenance", scope: !557, file: !483, line: 279, baseType: !454, size: 64, offset: 1344)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_background", scope: !557, file: !483, line: 280, baseType: !454, size: 64, offset: 1408)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_utility", scope: !557, file: !483, line: 281, baseType: !454, size: 64, offset: 1472)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_legacy", scope: !557, file: !483, line: 282, baseType: !454, size: 64, offset: 1536)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_initiated", scope: !557, file: !483, line: 283, baseType: !454, size: 64, offset: 1600)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_interactive", scope: !557, file: !483, line: 284, baseType: !454, size: 64, offset: 1664)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_system_time", scope: !557, file: !483, line: 285, baseType: !454, size: 64, offset: 1728)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_system_time", scope: !557, file: !483, line: 286, baseType: !454, size: 64, offset: 1792)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v4", file: !483, line: 289, size: 2368, elements: !588)
!588 = !{!589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !587, file: !483, line: 290, baseType: !506, size: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !587, file: !483, line: 291, baseType: !454, size: 64, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !587, file: !483, line: 292, baseType: !454, size: 64, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !587, file: !483, line: 293, baseType: !454, size: 64, offset: 256)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !587, file: !483, line: 294, baseType: !454, size: 64, offset: 320)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !587, file: !483, line: 295, baseType: !454, size: 64, offset: 384)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !587, file: !483, line: 296, baseType: !454, size: 64, offset: 448)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !587, file: !483, line: 297, baseType: !454, size: 64, offset: 512)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !587, file: !483, line: 298, baseType: !454, size: 64, offset: 576)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !587, file: !483, line: 299, baseType: !454, size: 64, offset: 640)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !587, file: !483, line: 300, baseType: !454, size: 64, offset: 704)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_user_time", scope: !587, file: !483, line: 301, baseType: !454, size: 64, offset: 768)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_system_time", scope: !587, file: !483, line: 302, baseType: !454, size: 64, offset: 832)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pkg_idle_wkups", scope: !587, file: !483, line: 303, baseType: !454, size: 64, offset: 896)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_interrupt_wkups", scope: !587, file: !483, line: 304, baseType: !454, size: 64, offset: 960)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pageins", scope: !587, file: !483, line: 305, baseType: !454, size: 64, offset: 1024)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_elapsed_abstime", scope: !587, file: !483, line: 306, baseType: !454, size: 64, offset: 1088)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_bytesread", scope: !587, file: !483, line: 307, baseType: !454, size: 64, offset: 1152)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_byteswritten", scope: !587, file: !483, line: 308, baseType: !454, size: 64, offset: 1216)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_default", scope: !587, file: !483, line: 309, baseType: !454, size: 64, offset: 1280)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_maintenance", scope: !587, file: !483, line: 310, baseType: !454, size: 64, offset: 1344)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_background", scope: !587, file: !483, line: 311, baseType: !454, size: 64, offset: 1408)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_utility", scope: !587, file: !483, line: 312, baseType: !454, size: 64, offset: 1472)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_legacy", scope: !587, file: !483, line: 313, baseType: !454, size: 64, offset: 1536)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_initiated", scope: !587, file: !483, line: 314, baseType: !454, size: 64, offset: 1600)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_interactive", scope: !587, file: !483, line: 315, baseType: !454, size: 64, offset: 1664)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_system_time", scope: !587, file: !483, line: 316, baseType: !454, size: 64, offset: 1728)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_system_time", scope: !587, file: !483, line: 317, baseType: !454, size: 64, offset: 1792)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ri_logical_writes", scope: !587, file: !483, line: 318, baseType: !454, size: 64, offset: 1856)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ri_lifetime_max_phys_footprint", scope: !587, file: !483, line: 319, baseType: !454, size: 64, offset: 1920)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ri_instructions", scope: !587, file: !483, line: 320, baseType: !454, size: 64, offset: 1984)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cycles", scope: !587, file: !483, line: 321, baseType: !454, size: 64, offset: 2048)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_energy", scope: !587, file: !483, line: 322, baseType: !454, size: 64, offset: 2112)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_energy", scope: !587, file: !483, line: 323, baseType: !454, size: 64, offset: 2176)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interval_max_phys_footprint", scope: !587, file: !483, line: 324, baseType: !454, size: 64, offset: 2240)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ri_runnable_time", scope: !587, file: !483, line: 325, baseType: !454, size: 64, offset: 2304)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v5", file: !483, line: 328, size: 2432, elements: !626)
!626 = !{!627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !625, file: !483, line: 329, baseType: !506, size: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !625, file: !483, line: 330, baseType: !454, size: 64, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !625, file: !483, line: 331, baseType: !454, size: 64, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !625, file: !483, line: 332, baseType: !454, size: 64, offset: 256)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !625, file: !483, line: 333, baseType: !454, size: 64, offset: 320)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !625, file: !483, line: 334, baseType: !454, size: 64, offset: 384)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !625, file: !483, line: 335, baseType: !454, size: 64, offset: 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !625, file: !483, line: 336, baseType: !454, size: 64, offset: 512)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !625, file: !483, line: 337, baseType: !454, size: 64, offset: 576)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !625, file: !483, line: 338, baseType: !454, size: 64, offset: 640)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !625, file: !483, line: 339, baseType: !454, size: 64, offset: 704)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_user_time", scope: !625, file: !483, line: 340, baseType: !454, size: 64, offset: 768)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_system_time", scope: !625, file: !483, line: 341, baseType: !454, size: 64, offset: 832)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pkg_idle_wkups", scope: !625, file: !483, line: 342, baseType: !454, size: 64, offset: 896)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_interrupt_wkups", scope: !625, file: !483, line: 343, baseType: !454, size: 64, offset: 960)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pageins", scope: !625, file: !483, line: 344, baseType: !454, size: 64, offset: 1024)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_elapsed_abstime", scope: !625, file: !483, line: 345, baseType: !454, size: 64, offset: 1088)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_bytesread", scope: !625, file: !483, line: 346, baseType: !454, size: 64, offset: 1152)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_byteswritten", scope: !625, file: !483, line: 347, baseType: !454, size: 64, offset: 1216)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_default", scope: !625, file: !483, line: 348, baseType: !454, size: 64, offset: 1280)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_maintenance", scope: !625, file: !483, line: 349, baseType: !454, size: 64, offset: 1344)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_background", scope: !625, file: !483, line: 350, baseType: !454, size: 64, offset: 1408)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_utility", scope: !625, file: !483, line: 351, baseType: !454, size: 64, offset: 1472)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_legacy", scope: !625, file: !483, line: 352, baseType: !454, size: 64, offset: 1536)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_initiated", scope: !625, file: !483, line: 353, baseType: !454, size: 64, offset: 1600)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_interactive", scope: !625, file: !483, line: 354, baseType: !454, size: 64, offset: 1664)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_system_time", scope: !625, file: !483, line: 355, baseType: !454, size: 64, offset: 1728)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_system_time", scope: !625, file: !483, line: 356, baseType: !454, size: 64, offset: 1792)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ri_logical_writes", scope: !625, file: !483, line: 357, baseType: !454, size: 64, offset: 1856)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ri_lifetime_max_phys_footprint", scope: !625, file: !483, line: 358, baseType: !454, size: 64, offset: 1920)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ri_instructions", scope: !625, file: !483, line: 359, baseType: !454, size: 64, offset: 1984)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cycles", scope: !625, file: !483, line: 360, baseType: !454, size: 64, offset: 2048)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_energy", scope: !625, file: !483, line: 361, baseType: !454, size: 64, offset: 2112)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_energy", scope: !625, file: !483, line: 362, baseType: !454, size: 64, offset: 2176)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interval_max_phys_footprint", scope: !625, file: !483, line: 363, baseType: !454, size: 64, offset: 2240)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ri_runnable_time", scope: !625, file: !483, line: 364, baseType: !454, size: 64, offset: 2304)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ri_flags", scope: !625, file: !483, line: 365, baseType: !454, size: 64, offset: 2368)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v6", file: !483, line: 368, size: 3712, elements: !665)
!665 = !{!666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !664, file: !483, line: 369, baseType: !506, size: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !664, file: !483, line: 370, baseType: !454, size: 64, offset: 128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !664, file: !483, line: 371, baseType: !454, size: 64, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !664, file: !483, line: 372, baseType: !454, size: 64, offset: 256)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !664, file: !483, line: 373, baseType: !454, size: 64, offset: 320)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !664, file: !483, line: 374, baseType: !454, size: 64, offset: 384)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !664, file: !483, line: 375, baseType: !454, size: 64, offset: 448)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !664, file: !483, line: 376, baseType: !454, size: 64, offset: 512)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !664, file: !483, line: 377, baseType: !454, size: 64, offset: 576)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !664, file: !483, line: 378, baseType: !454, size: 64, offset: 640)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !664, file: !483, line: 379, baseType: !454, size: 64, offset: 704)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_user_time", scope: !664, file: !483, line: 380, baseType: !454, size: 64, offset: 768)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_system_time", scope: !664, file: !483, line: 381, baseType: !454, size: 64, offset: 832)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pkg_idle_wkups", scope: !664, file: !483, line: 382, baseType: !454, size: 64, offset: 896)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_interrupt_wkups", scope: !664, file: !483, line: 383, baseType: !454, size: 64, offset: 960)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pageins", scope: !664, file: !483, line: 384, baseType: !454, size: 64, offset: 1024)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_elapsed_abstime", scope: !664, file: !483, line: 385, baseType: !454, size: 64, offset: 1088)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_bytesread", scope: !664, file: !483, line: 386, baseType: !454, size: 64, offset: 1152)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_byteswritten", scope: !664, file: !483, line: 387, baseType: !454, size: 64, offset: 1216)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_default", scope: !664, file: !483, line: 388, baseType: !454, size: 64, offset: 1280)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_maintenance", scope: !664, file: !483, line: 389, baseType: !454, size: 64, offset: 1344)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_background", scope: !664, file: !483, line: 390, baseType: !454, size: 64, offset: 1408)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_utility", scope: !664, file: !483, line: 391, baseType: !454, size: 64, offset: 1472)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_legacy", scope: !664, file: !483, line: 392, baseType: !454, size: 64, offset: 1536)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_initiated", scope: !664, file: !483, line: 393, baseType: !454, size: 64, offset: 1600)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_interactive", scope: !664, file: !483, line: 394, baseType: !454, size: 64, offset: 1664)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_system_time", scope: !664, file: !483, line: 395, baseType: !454, size: 64, offset: 1728)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_system_time", scope: !664, file: !483, line: 396, baseType: !454, size: 64, offset: 1792)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ri_logical_writes", scope: !664, file: !483, line: 397, baseType: !454, size: 64, offset: 1856)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ri_lifetime_max_phys_footprint", scope: !664, file: !483, line: 398, baseType: !454, size: 64, offset: 1920)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "ri_instructions", scope: !664, file: !483, line: 399, baseType: !454, size: 64, offset: 1984)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cycles", scope: !664, file: !483, line: 400, baseType: !454, size: 64, offset: 2048)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_energy", scope: !664, file: !483, line: 401, baseType: !454, size: 64, offset: 2112)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_energy", scope: !664, file: !483, line: 402, baseType: !454, size: 64, offset: 2176)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interval_max_phys_footprint", scope: !664, file: !483, line: 403, baseType: !454, size: 64, offset: 2240)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ri_runnable_time", scope: !664, file: !483, line: 404, baseType: !454, size: 64, offset: 2304)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "ri_flags", scope: !664, file: !483, line: 405, baseType: !454, size: 64, offset: 2368)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_ptime", scope: !664, file: !483, line: 406, baseType: !454, size: 64, offset: 2432)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_ptime", scope: !664, file: !483, line: 407, baseType: !454, size: 64, offset: 2496)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pinstructions", scope: !664, file: !483, line: 408, baseType: !454, size: 64, offset: 2560)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pcycles", scope: !664, file: !483, line: 409, baseType: !454, size: 64, offset: 2624)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ri_energy_nj", scope: !664, file: !483, line: 410, baseType: !454, size: 64, offset: 2688)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ri_penergy_nj", scope: !664, file: !483, line: 411, baseType: !454, size: 64, offset: 2752)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ri_secure_time_in_system", scope: !664, file: !483, line: 412, baseType: !454, size: 64, offset: 2816)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ri_secure_ptime_in_system", scope: !664, file: !483, line: 413, baseType: !454, size: 64, offset: 2880)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ri_neural_footprint", scope: !664, file: !483, line: 414, baseType: !454, size: 64, offset: 2944)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ri_lifetime_max_neural_footprint", scope: !664, file: !483, line: 415, baseType: !454, size: 64, offset: 3008)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interval_max_neural_footprint", scope: !664, file: !483, line: 416, baseType: !454, size: 64, offset: 3072)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ri_reserved", scope: !664, file: !483, line: 417, baseType: !715, size: 576, offset: 3136)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 576, elements: !716)
!716 = !{!717}
!717 = !DISubrange(count: 9)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "rusage_info_current", file: !483, line: 420, baseType: !664)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rlimit", file: !483, line: 464, size: 128, elements: !720)
!720 = !{!721, !722}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_cur", scope: !719, file: !483, line: 465, baseType: !482, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_max", scope: !719, file: !483, line: 466, baseType: !482, size: 64, offset: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "proc_rlimit_control_wakeupmon", file: !483, line: 499, size: 64, elements: !724)
!724 = !{!725, !726}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "wm_flags", scope: !723, file: !483, line: 500, baseType: !452, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "wm_rate", scope: !723, file: !483, line: 501, baseType: !229, size: 32, offset: 32)
!727 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "wait", file: !63, line: 194, size: 32, elements: !728)
!728 = !{!729, !730, !737}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "w_status", scope: !727, file: !63, line: 195, baseType: !80, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "w_T", scope: !727, file: !63, line: 212, baseType: !731, size: 32)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !727, file: !63, line: 199, size: 32, elements: !732)
!732 = !{!733, !734, !735, !736}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "w_Termsig", scope: !731, file: !63, line: 201, baseType: !64, size: 7, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "w_Coredump", scope: !731, file: !63, line: 202, baseType: !64, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "w_Retcode", scope: !731, file: !63, line: 203, baseType: !64, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "w_Filler", scope: !731, file: !63, line: 204, baseType: !64, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "w_S", scope: !727, file: !63, line: 229, baseType: !738, size: 32)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !727, file: !63, line: 218, size: 32, elements: !739)
!739 = !{!740, !741, !742}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "w_Stopval", scope: !738, file: !63, line: 220, baseType: !64, size: 8, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "w_Stopsig", scope: !738, file: !63, line: 221, baseType: !64, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "w_Filler", scope: !738, file: !63, line: 222, baseType: !64, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "ct_rune_t", file: !744, line: 32, baseType: !89)
!744 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_ct_rune_t.h", directory: "", checksumkind: CSK_MD5, checksum: "c22112154646d7509ef295660b838a0e")
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "rune_t", file: !746, line: 31, baseType: !106)
!746 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_rune_t.h", directory: "", checksumkind: CSK_MD5, checksum: "f2344ffb16201340bfd175b1637ea60f")
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !748, line: 53, baseType: !105)
!748 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_wchar_t.h", directory: "", checksumkind: CSK_MD5, checksum: "7c8733b31e382e8074a475f5c41f1e03")
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !750, line: 83, size: 64, elements: !751)
!750 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "1fbf79127e45bcc71ac6e64ce165d68a")
!751 = !{!752, !753}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !749, file: !750, line: 84, baseType: !80, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !749, file: !750, line: 85, baseType: !80, size: 32, offset: 32)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !750, line: 86, baseType: !749)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !750, line: 88, size: 128, elements: !756)
!756 = !{!757, !758}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !755, file: !750, line: 89, baseType: !87, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !755, file: !750, line: 90, baseType: !87, size: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !750, line: 91, baseType: !755)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !750, line: 94, size: 128, elements: !761)
!761 = !{!762, !763}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !760, file: !750, line: 95, baseType: !83, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !760, file: !750, line: 96, baseType: !83, size: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !750, line: 97, baseType: !760)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "malloc_type_id_t", file: !766, line: 30, baseType: !85)
!766 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/malloc/_malloc_type.h", directory: "", checksumkind: CSK_MD5, checksum: "d42ade5b4592df6ab4d40d7d5990e609")
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "malloc_zone_t", file: !766, line: 63, baseType: !768)
!768 = !DICompositeType(tag: DW_TAG_structure_type, name: "_malloc_zone_t", file: !766, line: 63, flags: DIFlagFwdDecl)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !770, line: 31, baseType: !115)
!770 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_dev_t.h", directory: "", checksumkind: CSK_MD5, checksum: "48c1388efd95518803dfc92f7c613390")
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !772, line: 31, baseType: !124)
!772 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_mode_t.h", directory: "", checksumkind: CSK_MD5, checksum: "9d25d351341bf46798d552a73c506c13")
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !774, line: 44, baseType: !102)
!774 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "41825c2dccdd98a1587ce428cded44de")
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !776, line: 83, baseType: !125)
!776 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "3d165ce37807d123c2b5ed4c31060b16")
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !776, line: 94, size: 128, elements: !778)
!778 = !{!779, !781}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !777, file: !776, line: 95, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !777, file: !776, line: 96, baseType: !80, size: 32, offset: 64)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !776, line: 128, size: 1216, elements: !783)
!783 = !{!784, !785, !786, !787, !788, !789, !790, !791, !792, !796, !800, !804, !810, !811, !814, !815, !817, !819, !820, !821}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !782, file: !776, line: 129, baseType: !780, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !782, file: !776, line: 130, baseType: !80, size: 32, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !782, file: !776, line: 131, baseType: !80, size: 32, offset: 96)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !782, file: !776, line: 132, baseType: !76, size: 16, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !782, file: !776, line: 133, baseType: !76, size: 16, offset: 144)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !782, file: !776, line: 134, baseType: !777, size: 128, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !782, file: !776, line: 135, baseType: !80, size: 32, offset: 320)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !782, file: !776, line: 138, baseType: !146, size: 64, offset: 384)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !782, file: !776, line: 139, baseType: !793, size: 64, offset: 448)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DISubroutineType(types: !795)
!795 = !{!80, !146}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !782, file: !776, line: 140, baseType: !797, size: 64, offset: 512)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{!80, !146, !104, !80}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !782, file: !776, line: 141, baseType: !801, size: 64, offset: 576)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!775, !146, !775, !80}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !782, file: !776, line: 142, baseType: !805, size: 64, offset: 640)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{!80, !146, !808, !80}
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !782, file: !776, line: 145, baseType: !777, size: 128, offset: 704)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !782, file: !776, line: 146, baseType: !812, size: 64, offset: 832)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !776, line: 100, flags: DIFlagFwdDecl)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !782, file: !776, line: 147, baseType: !80, size: 32, offset: 896)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !782, file: !776, line: 150, baseType: !816, size: 24, offset: 928)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 24, elements: !35)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !782, file: !776, line: 151, baseType: !818, size: 8, offset: 952)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 8, elements: !15)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !782, file: !776, line: 154, baseType: !777, size: 128, offset: 960)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !782, file: !776, line: 157, baseType: !80, size: 32, offset: 1088)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !782, file: !776, line: 158, baseType: !775, size: 64, offset: 1152)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !776, line: 159, baseType: !782)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !824, line: 31, baseType: !125)
!824 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_off_t.h", directory: "", checksumkind: CSK_MD5, checksum: "0468c56924902d4782b467d48c54d211")
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !826, line: 31, baseType: !110)
!826 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_ssize_t.h", directory: "", checksumkind: CSK_MD5, checksum: "9b4f5bef81dd94a882775a3ce650ab9c")
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !828, line: 32, baseType: !107)
!828 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "6dfd3a3d5009054224653c03b2c2b6ac")
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !830, line: 60, size: 192, elements: !831)
!830 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/runetype.h", directory: "", checksumkind: CSK_MD5, checksum: "3bf7949bd01547ffbbbddabe985a89eb")
!831 = !{!832, !833, !834, !835}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "__min", scope: !829, file: !830, line: 61, baseType: !106, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "__max", scope: !829, file: !830, line: 62, baseType: !106, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "__map", scope: !829, file: !830, line: 63, baseType: !106, size: 32, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "__types", scope: !829, file: !830, line: 64, baseType: !836, size: 64, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "_RuneEntry", file: !830, line: 65, baseType: !829)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !830, line: 67, size: 128, elements: !839)
!839 = !{!840, !841}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "__nranges", scope: !838, file: !830, line: 68, baseType: !80, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "__ranges", scope: !838, file: !830, line: 69, baseType: !842, size: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "_RuneRange", file: !830, line: 70, baseType: !838)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !830, line: 72, size: 160, elements: !845)
!845 = !{!846, !850}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "__name", scope: !844, file: !830, line: 73, baseType: !847, size: 112)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !848)
!848 = !{!849}
!849 = !DISubrange(count: 14)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "__mask", scope: !844, file: !830, line: 74, baseType: !81, size: 32, offset: 128)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "_RuneCharClass", file: !830, line: 75, baseType: !844)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !830, line: 77, size: 25664, elements: !853)
!853 = !{!854, !855, !857, !862, !867, !868, !872, !874, !875, !876, !877, !878, !879, !880, !881}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "__magic", scope: !852, file: !830, line: 78, baseType: !168, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "__encoding", scope: !852, file: !830, line: 79, baseType: !856, size: 256, offset: 64)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !303)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "__sgetrune", scope: !852, file: !830, line: 81, baseType: !858, size: 64, offset: 320)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!106, !808, !100, !861}
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "__sputrune", scope: !852, file: !830, line: 82, baseType: !863, size: 64, offset: 384)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!80, !106, !104, !100, !866}
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "__invalid_rune", scope: !852, file: !830, line: 83, baseType: !106, size: 32, offset: 448)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "__runetype", scope: !852, file: !830, line: 85, baseType: !869, size: 8192, offset: 480)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 8192, elements: !870)
!870 = !{!871}
!871 = !DISubrange(count: 256)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "__maplower", scope: !852, file: !830, line: 86, baseType: !873, size: 8192, offset: 8672)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 8192, elements: !870)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "__mapupper", scope: !852, file: !830, line: 87, baseType: !873, size: 8192, offset: 16864)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "__runetype_ext", scope: !852, file: !830, line: 94, baseType: !843, size: 128, offset: 25088)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "__maplower_ext", scope: !852, file: !830, line: 95, baseType: !843, size: 128, offset: 25216)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "__mapupper_ext", scope: !852, file: !830, line: 96, baseType: !843, size: 128, offset: 25344)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "__variable", scope: !852, file: !830, line: 98, baseType: !146, size: 64, offset: 25472)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "__variable_len", scope: !852, file: !830, line: 99, baseType: !80, size: 32, offset: 25536)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "__ncharclasses", scope: !852, file: !830, line: 104, baseType: !80, size: 32, offset: 25568)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "__charclasses", scope: !852, file: !830, line: 105, baseType: !882, size: 64, offset: 25600)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "_RuneLocale", file: !830, line: 106, baseType: !852)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "rsize_t", file: !885, line: 50, baseType: !100)
!885 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_rsize_t.h", directory: "", checksumkind: CSK_MD5, checksum: "714399b2bab57d5c370b1c9469fc7878")
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "errno_t", file: !887, line: 30, baseType: !80)
!887 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_errno_t.h", directory: "", checksumkind: CSK_MD5, checksum: "7ac5c892aab89ac1b28ab20b80999689")
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !889, line: 45, baseType: !890)
!889 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/math.h", directory: "", checksumkind: CSK_MD5, checksum: "d0dda0c738ec10c2c6499cf51d7d5a20")
!890 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !889, line: 46, baseType: !892)
!892 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !889, line: 660, size: 64, elements: !894)
!894 = !{!895, !896}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !893, file: !889, line: 660, baseType: !890, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !893, file: !889, line: 660, baseType: !890, size: 32, offset: 32)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !889, line: 661, size: 128, elements: !898)
!898 = !{!899, !900}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !897, file: !889, line: 661, baseType: !892, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !897, file: !889, line: 661, baseType: !892, size: 64, offset: 64)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exception", file: !889, line: 779, size: 320, elements: !902)
!902 = !{!903, !904, !905, !906, !907}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !901, file: !889, line: 780, baseType: !80, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !901, file: !889, line: 781, baseType: !104, size: 64, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "arg1", scope: !901, file: !889, line: 782, baseType: !892, size: 64, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "arg2", scope: !901, file: !889, line: 783, baseType: !892, size: 64, offset: 192)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "retval", scope: !901, file: !889, line: 784, baseType: !892, size: 64, offset: 256)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 27, size: 1088, elements: !909)
!909 = !{!910, !911, !912, !913, !914, !918}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !908, file: !2, line: 28, baseType: !80, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "latitude", scope: !908, file: !2, line: 29, baseType: !892, size: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "longitude", scope: !908, file: !2, line: 30, baseType: !892, size: 64, offset: 128)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "numCounties", scope: !908, file: !2, line: 31, baseType: !80, size: 32, offset: 192)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !908, file: !2, line: 32, baseType: !915, size: 328, offset: 224)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !916)
!916 = !{!917}
!917 = !DISubrange(count: 41)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "counties", scope: !908, file: !2, line: 33, baseType: !919, size: 520, offset: 552)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 520, elements: !920)
!920 = !{!41, !275}
