; ModuleID = 'test.c'
source_filename = "test.c"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx15.0.0"

@.str = private unnamed_addr constant [7 x i8] c"%d, %d\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [15 x i8] c"id= %d sum=%d\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [3 x i8] c"%d\00", align 1, !dbg !12

; Function Attrs: noinline nounwind ssp uwtable(sync)
define i32 @main() #0 !dbg !794 {
entry:
  %retval = alloca i32, align 4
  %id = alloca i32, align 4
  %n = alloca i32, align 4
  %s = alloca i32, align 4
  %i = alloca i32, align 4
  store i32 0, ptr %retval, align 4
    #dbg_declare(ptr %id, !798, !DIExpression(), !799)
    #dbg_declare(ptr %n, !800, !DIExpression(), !801)
  %call = call i32 (ptr, ...) @scanf(ptr noundef @.str, ptr noundef %id, ptr noundef %n), !dbg !802
    #dbg_declare(ptr %s, !803, !DIExpression(), !804)
  store i32 0, ptr %s, align 4, !dbg !804
    #dbg_declare(ptr %i, !805, !DIExpression(), !807)
  store i32 0, ptr %i, align 4, !dbg !807
  br label %for.cond, !dbg !808

for.cond:                                         ; preds = %for.inc, %entry
  %0 = load i32, ptr %i, align 4, !dbg !809
  %1 = load i32, ptr %n, align 4, !dbg !811
  %cmp = icmp slt i32 %0, %1, !dbg !812
  br i1 %cmp, label %for.body, label %for.end, !dbg !813

for.body:                                         ; preds = %for.cond
  %call1 = call i32 @rand(), !dbg !814

!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !28, line: 37, baseType: !40)
!40 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !28, line: 38, baseType: !42)
!42 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !28, line: 40, baseType: !44)
!44 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_natural_t", file: !28, line: 41, baseType: !21)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ct_rune_t", file: !28, line: 61, baseType: !37)
!47 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !28, line: 67, size: 1024, elements: !48)
!48 = !{!49, !53}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !47, file: !28, line: 68, baseType: !50, size: 1024)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !47, file: !28, line: 69, baseType: !40, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !28, line: 70, baseType: !47)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mbstate_t", file: !28, line: 72, baseType: !54)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ptrdiff_t", file: !28, line: 77, baseType: !44)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !28, line: 87, baseType: !58)
!58 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_va_list", file: !28, line: 95, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !2, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wchar_t", file: !28, line: 103, baseType: !37)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_rune_t", file: !28, line: 108, baseType: !62)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wint_t", file: !28, line: 111, baseType: !37)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_clock_t", file: !28, line: 116, baseType: !58)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_socklen_t", file: !28, line: 117, baseType: !38)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ssize_t", file: !28, line: 118, baseType: !44)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !28, line: 119, baseType: !44)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blkcnt_t", file: !70, line: 67, baseType: !39)
!70 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "af82ff6119a9fa80fad635d276556d46")
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blksize_t", file: !70, line: 68, baseType: !36)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_dev_t", file: !70, line: 69, baseType: !36)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_fsblkcnt_t", file: !70, line: 70, baseType: !21)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_fsfilcnt_t", file: !70, line: 71, baseType: !21)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_gid_t", file: !70, line: 72, baseType: !38)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_id_t", file: !70, line: 73, baseType: !38)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ino64_t", file: !70, line: 74, baseType: !41)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ino_t", file: !70, line: 76, baseType: !77)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mach_port_name_t", file: !70, line: 80, baseType: !45)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mach_port_t", file: !70, line: 81, baseType: !79)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mode_t", file: !70, line: 82, baseType: !34)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !70, line: 83, baseType: !39)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pid_t", file: !70, line: 84, baseType: !36)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_sigset_t", file: !70, line: 85, baseType: !38)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_suseconds_t", file: !70, line: 86, baseType: !36)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uid_t", file: !70, line: 87, baseType: !38)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_useconds_t", file: !70, line: 88, baseType: !38)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uuid_t", file: !70, line: 89, baseType: !89)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 128, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 16)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uuid_string_t", file: !70, line: 90, baseType: !93)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 37)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_pthread_handler_rec", file: !97, line: 57, size: 192, elements: !98)
!97 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_pthread/_pthread_types.h", directory: "", checksumkind: CSK_MD5, checksum: "4e2ea0e1af95894da0a6030a21a8ebee")
!98 = !{!99, !104, !105}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__routine", scope: !96, file: !97, line: 58, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !103}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__arg", scope: !96, file: !97, line: 59, baseType: !103, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !96, file: !97, line: 60, baseType: !106, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_attr_t", file: !97, line: 63, size: 512, elements: !108)
!108 = !{!109, !110}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !107, file: !97, line: 64, baseType: !44, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !107, file: !97, line: 65, baseType: !111, size: 448, offset: 64)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 56)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_cond_t", file: !97, line: 68, size: 384, elements: !115)
!115 = !{!116, !117}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !114, file: !97, line: 69, baseType: !44, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !114, file: !97, line: 70, baseType: !118, size: 320, offset: 64)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 40)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_condattr_t", file: !97, line: 73, size: 128, elements: !122)
!122 = !{!123, !124}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !121, file: !97, line: 74, baseType: !44, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !121, file: !97, line: 75, baseType: !125, size: 64, offset: 64)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 8)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_mutex_t", file: !97, line: 78, size: 512, elements: !129)
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !128, file: !97, line: 79, baseType: !44, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !128, file: !97, line: 80, baseType: !111, size: 448, offset: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_mutexattr_t", file: !97, line: 83, size: 128, elements: !133)
!133 = !{!134, !135}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !132, file: !97, line: 84, baseType: !44, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !132, file: !97, line: 85, baseType: !125, size: 64, offset: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_once_t", file: !97, line: 88, size: 128, elements: !137)
!137 = !{!138, !139}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !136, file: !97, line: 89, baseType: !44, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !136, file: !97, line: 90, baseType: !125, size: 64, offset: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_rwlock_t", file: !97, line: 93, size: 1600, elements: !141)
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !140, file: !97, line: 94, baseType: !44, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !140, file: !97, line: 95, baseType: !144, size: 1536, offset: 64)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1536, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 192)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_rwlockattr_t", file: !97, line: 98, size: 192, elements: !148)
!148 = !{!149, !150}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !147, file: !97, line: 99, baseType: !44, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !147, file: !97, line: 100, baseType: !151, size: 128, offset: 64)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !90)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_t", file: !97, line: 103, size: 65536, elements: !153)
!153 = !{!154, !155, !156}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !152, file: !97, line: 104, baseType: !44, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup_stack", scope: !152, file: !97, line: 105, baseType: !106, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !152, file: !97, line: 106, baseType: !157, size: 65408, offset: 128)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 65408, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 8176)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_attr_t", file: !97, line: 109, baseType: !107)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_cond_t", file: !97, line: 110, baseType: !114)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_condattr_t", file: !97, line: 111, baseType: !121)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_key_t", file: !97, line: 112, baseType: !58)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_mutex_t", file: !97, line: 113, baseType: !128)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_mutexattr_t", file: !97, line: 114, baseType: !132)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_once_t", file: !97, line: 115, baseType: !136)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_rwlock_t", file: !97, line: 116, baseType: !140)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_rwlockattr_t", file: !97, line: 117, baseType: !147)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_t", file: !97, line: 118, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_nl_item", file: !172, line: 40, baseType: !37)
!172 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "bd2087c8ee278624cee561f95099160e")
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctrans_t", file: !172, line: 41, baseType: !37)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctype_t", file: !172, line: 43, baseType: !38)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !176, line: 30, baseType: !29)
!176 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5052dfe782b50fed2355b8f61a9e4fa9")
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !178, line: 30, baseType: !33)
!178 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "47ed3c3ac6f65bfec021ca2b7be18e7e")
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !180, line: 30, baseType: !37)
!180 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "d23e8406e80ee79983f28509c741fa17")
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !182, line: 30, baseType: !40)
!182 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e6d85c1a9e23dbf7518ce3b162aac800")
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int8_t", file: !184, line: 30, baseType: !31)
!184 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_u_int8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "cf25460e3a2d25a50de2bd9cd0738ad8")
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int16_t", file: !186, line: 30, baseType: !35)
!186 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_u_int16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "20fb61aa655de1ae21f6fe1799ea5928")
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int32_t", file: !188, line: 30, baseType: !21)
!188 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_u_int32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "1be414e13025ba0d11004877ba3f558a")
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int64_t", file: !190, line: 30, baseType: !42)
!190 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_u_int64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "466f994226288d9979ea32e237e3f3c2")
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "register_t", file: !192, line: 66, baseType: !181)
!192 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/arm/types.h", directory: "", checksumkind: CSK_MD5, checksum: "bd345bb749b5098b0f191abe2c0d3eb4")
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !194, line: 32, baseType: !43)
!194 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_intptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e478ba47270923b1cca6659f19f02db1")
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !196, line: 34, baseType: !58)
!196 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e70ae655dd1b9d4ae0b1dcc073f5b7e4")
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_addr_t", file: !192, line: 77, baseType: !189)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_size_t", file: !192, line: 78, baseType: !189)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_ssize_t", file: !192, line: 79, baseType: !181)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_long_t", file: !192, line: 80, baseType: !181)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_ulong_t", file: !192, line: 81, baseType: !189)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_time_t", file: !192, line: 82, baseType: !181)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_off_t", file: !192, line: 83, baseType: !181)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "syscall_arg_t", file: !192, line: 105, baseType: !189)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !206, line: 44, baseType: !59)
!206 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "41825c2dccdd98a1587ce428cded44de")
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !208, line: 50, baseType: !57)
!208 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "f7981334d28e0c246f35cd24042aa2a4")
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !210, line: 83, baseType: !82)
!210 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "3d165ce37807d123c2b5ed4c31060b16")
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !210, line: 94, size: 128, elements: !212)
!212 = !{!213, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !211, file: !210, line: 95, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !211, file: !210, line: 96, baseType: !37, size: 32, offset: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !210, line: 128, size: 1216, elements: !217)
!217 = !{!218, !219, !220, !221, !222, !223, !224, !225, !226, !230, !234, !238, !244, !245, !248, !249, !251, !255, !256, !257}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !216, file: !210, line: 129, baseType: !214, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !216, file: !210, line: 130, baseType: !37, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !216, file: !210, line: 131, baseType: !37, size: 32, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !216, file: !210, line: 132, baseType: !33, size: 16, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !216, file: !210, line: 133, baseType: !33, size: 16, offset: 144)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !216, file: !210, line: 134, baseType: !211, size: 128, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !216, file: !210, line: 135, baseType: !37, size: 32, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !216, file: !210, line: 138, baseType: !103, size: 64, offset: 384)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !216, file: !210, line: 139, baseType: !227, size: 64, offset: 448)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!37, !103}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !216, file: !210, line: 140, baseType: !231, size: 64, offset: 512)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!37, !103, !61, !37}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !216, file: !210, line: 141, baseType: !235, size: 64, offset: 576)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!209, !103, !209, !37}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !216, file: !210, line: 142, baseType: !239, size: 64, offset: 640)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!37, !103, !242, !37}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !216, file: !210, line: 145, baseType: !211, size: 128, offset: 704)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !216, file: !210, line: 146, baseType: !246, size: 64, offset: 832)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !210, line: 100, flags: DIFlagFwdDecl)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !216, file: !210, line: 147, baseType: !37, size: 32, offset: 896)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !216, file: !210, line: 150, baseType: !250, size: 24, offset: 928)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 24, elements: !15)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !216, file: !210, line: 151, baseType: !252, size: 8, offset: 952)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 1)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !216, file: !210, line: 154, baseType: !211, size: 128, offset: 960)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !216, file: !210, line: 157, baseType: !37, size: 32, offset: 1088)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !216, file: !210, line: 158, baseType: !209, size: 64, offset: 1152)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !210, line: 159, baseType: !216)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !260, line: 31, baseType: !82)
!260 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_off_t.h", directory: "", checksumkind: CSK_MD5, checksum: "0468c56924902d4782b467d48c54d211")
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !262, line: 31, baseType: !67)
!262 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_ssize_t.h", directory: "", checksumkind: CSK_MD5, checksum: "9b4f5bef81dd94a882775a3ce650ab9c")
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "idtype_t", file: !20, line: 83, baseType: !19)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !265, line: 31, baseType: !83)
!265 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_pid_t.h", directory: "", checksumkind: CSK_MD5, checksum: "86a3851b3039dd75e6cc5a8b4f2b3461")
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "id_t", file: !267, line: 31, baseType: !76)
!267 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_id_t.h", directory: "", checksumkind: CSK_MD5, checksum: "985e35d2b2c7e6ea13869fc8cd0b5949")
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !269, line: 17, baseType: !37)
!269 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/arm/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "802a7d5a263aebe8f27d5d67c7ad4b44")
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_exception_state", file: !271, line: 41, size: 96, elements: !272)
!271 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/mach/arm/_structs.h", directory: "", checksumkind: CSK_MD5, checksum: "fc9233eb351901bd9aae4f5912643825")
!272 = !{!273, !274, !275}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__exception", scope: !270, file: !271, line: 43, baseType: !38, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__fsr", scope: !270, file: !271, line: 44, baseType: !38, size: 32, offset: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__far", scope: !270, file: !271, line: 45, baseType: !38, size: 32, offset: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_exception_state64", file: !271, line: 59, size: 128, elements: !277)
!277 = !{!278, !279, !280}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__far", scope: !276, file: !271, line: 61, baseType: !41, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__esr", scope: !276, file: !271, line: 62, baseType: !38, size: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__exception", scope: !276, file: !271, line: 63, baseType: !38, size: 32, offset: 96)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_exception_state64_v2", file: !271, line: 66, size: 128, elements: !282)
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__far", scope: !281, file: !271, line: 68, baseType: !41, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__esr", scope: !281, file: !271, line: 69, baseType: !41, size: 64, offset: 64)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_thread_state", file: !271, line: 89, size: 544, elements: !286)
!286 = !{!287, !291, !292, !293, !294}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__r", scope: !285, file: !271, line: 91, baseType: !288, size: 416)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 416, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 13)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__sp", scope: !285, file: !271, line: 92, baseType: !38, size: 32, offset: 416)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__lr", scope: !285, file: !271, line: 93, baseType: !38, size: 32, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__pc", scope: !285, file: !271, line: 94, baseType: !38, size: 32, offset: 480)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__cpsr", scope: !285, file: !271, line: 95, baseType: !38, size: 32, offset: 512)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_thread_state64", file: !271, line: 148, size: 2176, elements: !296)
!296 = !{!297, !301, !302, !303, !304, !305, !306}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__x", scope: !295, file: !271, line: 150, baseType: !298, size: 1856)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 1856, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 29)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__fp", scope: !295, file: !271, line: 151, baseType: !41, size: 64, offset: 1856)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__lr", scope: !295, file: !271, line: 152, baseType: !41, size: 64, offset: 1920)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__sp", scope: !295, file: !271, line: 153, baseType: !41, size: 64, offset: 1984)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__pc", scope: !295, file: !271, line: 154, baseType: !41, size: 64, offset: 2048)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__cpsr", scope: !295, file: !271, line: 155, baseType: !38, size: 32, offset: 2112)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__pad", scope: !295, file: !271, line: 156, baseType: !38, size: 32, offset: 2144)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_vfp_state", file: !271, line: 519, size: 2080, elements: !308)
!308 = !{!309, !313}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__r", scope: !307, file: !271, line: 521, baseType: !310, size: 2048)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 2048, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__fpscr", scope: !307, file: !271, line: 522, baseType: !38, size: 32, offset: 2048)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_neon_state64", file: !271, line: 538, size: 4224, elements: !315)
!315 = !{!316, !322, !323}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "__v", scope: !314, file: !271, line: 540, baseType: !317, size: 4096)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 4096, elements: !320)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint128_t", file: !2, baseType: !319)
!319 = !DIBasicType(name: "unsigned __int128", size: 128, encoding: DW_ATE_unsigned)
!320 = !{!321}
!321 = !DISubrange(count: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__fpsr", scope: !314, file: !271, line: 541, baseType: !38, size: 32, offset: 4096)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__fpcr", scope: !314, file: !271, line: 542, baseType: !38, size: 32, offset: 4128)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_neon_state", file: !271, line: 545, size: 2176, elements: !325)
!325 = !{!326, !328, !329}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "__v", scope: !324, file: !271, line: 547, baseType: !327, size: 2048)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 2048, elements: !90)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__fpsr", scope: !324, file: !271, line: 548, baseType: !38, size: 32, offset: 2048)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__fpcr", scope: !324, file: !271, line: 549, baseType: !38, size: 32, offset: 2080)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__arm_pagein_state", file: !271, line: 609, size: 32, elements: !331)
!331 = !{!332}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__pagein_error", scope: !330, file: !271, line: 611, baseType: !37, size: 32)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__arm_legacy_debug_state", file: !271, line: 646, size: 2048, elements: !334)
!334 = !{!335, !337, !338, !339}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__bvr", scope: !333, file: !271, line: 648, baseType: !336, size: 512)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 512, elements: !90)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__bcr", scope: !333, file: !271, line: 649, baseType: !336, size: 512, offset: 512)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "__wvr", scope: !333, file: !271, line: 650, baseType: !336, size: 512, offset: 1024)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__wcr", scope: !333, file: !271, line: 651, baseType: !336, size: 512, offset: 1536)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_debug_state32", file: !271, line: 669, size: 2112, elements: !341)
!341 = !{!342, !343, !344, !345, !346}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "__bvr", scope: !340, file: !271, line: 671, baseType: !336, size: 512)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "__bcr", scope: !340, file: !271, line: 672, baseType: !336, size: 512, offset: 512)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__wvr", scope: !340, file: !271, line: 673, baseType: !336, size: 512, offset: 1024)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__wcr", scope: !340, file: !271, line: 674, baseType: !336, size: 512, offset: 1536)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__mdscr_el1", scope: !340, file: !271, line: 675, baseType: !41, size: 64, offset: 2048)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_debug_state64", file: !271, line: 679, size: 4160, elements: !348)
!348 = !{!349, !351, !352, !353, !354}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "__bvr", scope: !347, file: !271, line: 681, baseType: !350, size: 1024)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 1024, elements: !90)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__bcr", scope: !347, file: !271, line: 682, baseType: !350, size: 1024, offset: 1024)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__wvr", scope: !347, file: !271, line: 683, baseType: !350, size: 1024, offset: 2048)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "__wcr", scope: !347, file: !271, line: 684, baseType: !350, size: 1024, offset: 3072)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__mdscr_el1", scope: !347, file: !271, line: 685, baseType: !41, size: 64, offset: 4096)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_arm_cpmu_state64", file: !271, line: 711, size: 1024, elements: !356)
!356 = !{!357}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__ctrs", scope: !355, file: !271, line: 713, baseType: !350, size: 1024)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_mcontext32", file: !359, line: 41, size: 2720, elements: !360)
!359 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/arm/_mcontext.h", directory: "", checksumkind: CSK_MD5, checksum: "da7c261f76f98eb3bbd7ed11c4aaa3d8")
!360 = !{!361, !362, !363}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__es", scope: !358, file: !359, line: 43, baseType: !270, size: 96)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__ss", scope: !358, file: !359, line: 44, baseType: !285, size: 544, offset: 96)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__fs", scope: !358, file: !359, line: 45, baseType: !307, size: 2080, offset: 640)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_mcontext64", file: !359, line: 64, size: 6528, elements: !365)
!365 = !{!366, !367, !368}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__es", scope: !364, file: !359, line: 66, baseType: !276, size: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__ss", scope: !364, file: !359, line: 67, baseType: !295, size: 2176, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__ns", scope: !364, file: !359, line: 68, baseType: !314, size: 4224, offset: 2304)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "mcontext_t", file: !359, line: 85, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_attr_t", file: !372, line: 31, baseType: !160)
!372 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_pthread/_pthread_attr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "383e78324250b910a1128f1b9a464b23")
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_sigaltstack", file: !374, line: 42, size: 192, elements: !375)
!374 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_sigaltstack.h", directory: "", checksumkind: CSK_MD5, checksum: "d308a81f239c930cbd1b1f2eee3fc6c1")
!375 = !{!376, !377, !378}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ss_sp", scope: !373, file: !374, line: 44, baseType: !103, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ss_size", scope: !373, file: !374, line: 45, baseType: !57, size: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ss_flags", scope: !373, file: !374, line: 46, baseType: !37, size: 32, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "stack_t", file: !374, line: 48, baseType: !373)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_ucontext", file: !381, line: 43, size: 448, elements: !382)
!381 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_ucontext.h", directory: "", checksumkind: CSK_MD5, checksum: "c9464687b003449106b679928ca1b348")
!382 = !{!383, !384, !385, !386, !388, !389}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "uc_onstack", scope: !380, file: !381, line: 45, baseType: !37, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "uc_sigmask", scope: !380, file: !381, line: 46, baseType: !84, size: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "uc_stack", scope: !380, file: !381, line: 47, baseType: !373, size: 192, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "uc_link", scope: !380, file: !381, line: 48, baseType: !387, size: 64, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "uc_mcsize", scope: !380, file: !381, line: 49, baseType: !57, size: 64, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "uc_mcontext", scope: !380, file: !381, line: 50, baseType: !370, size: 64, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucontext_t", file: !381, line: 57, baseType: !380)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !392, line: 31, baseType: !84)
!392 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "437b33d322f60e932c1e1199626d9393")
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !394, line: 31, baseType: !86)
!394 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_uid_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2a704f772d04abefb01de36d246e45dd")
!395 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !396, line: 158, size: 64, elements: !397)
!396 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "541f2577a63933b8824579532ef86917")
!397 = !{!398, !399}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !395, file: !396, line: 160, baseType: !37, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !395, file: !396, line: 161, baseType: !103, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigevent", file: !396, line: 168, size: 256, elements: !401)
!401 = !{!402, !403, !404, !405, !409}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_notify", scope: !400, file: !396, line: 169, baseType: !37, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_signo", scope: !400, file: !396, line: 170, baseType: !37, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_value", scope: !400, file: !396, line: 171, baseType: !395, size: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_notify_function", scope: !400, file: !396, line: 172, baseType: !406, size: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !395}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_notify_attributes", scope: !400, file: !396, line: 173, baseType: !410, size: 64, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__siginfo", file: !396, line: 177, size: 832, elements: !412)
!412 = !{!413, !414, !415, !416, !417, !418, !419, !420, !421, !422}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !411, file: !396, line: 178, baseType: !37, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !411, file: !396, line: 179, baseType: !37, size: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !411, file: !396, line: 180, baseType: !37, size: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !411, file: !396, line: 181, baseType: !264, size: 32, offset: 96)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !411, file: !396, line: 182, baseType: !393, size: 32, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !411, file: !396, line: 183, baseType: !37, size: 32, offset: 160)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !411, file: !396, line: 184, baseType: !103, size: 64, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "si_value", scope: !411, file: !396, line: 185, baseType: !395, size: 64, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !411, file: !396, line: 186, baseType: !44, size: 64, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "__pad", scope: !411, file: !396, line: 187, baseType: !423, size: 448, offset: 384)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 448, elements: !5)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !396, line: 188, baseType: !411)
!425 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__sigaction_u", file: !396, line: 269, size: 64, elements: !426)
!426 = !{!427, !431}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__sa_handler", scope: !425, file: !396, line: 270, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !37}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__sa_sigaction", scope: !425, file: !396, line: 271, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{null, !37, !435, !103}
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sigaction", file: !396, line: 276, size: 192, elements: !437)
!437 = !{!438, !439, !444, !445}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_u", scope: !436, file: !396, line: 277, baseType: !425, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "sa_tramp", scope: !436, file: !396, line: 278, baseType: !440, size: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !103, !37, !37, !443, !103}
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !436, file: !396, line: 279, baseType: !391, size: 32, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !436, file: !396, line: 280, baseType: !37, size: 32, offset: 160)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !396, line: 286, size: 128, elements: !447)
!447 = !{!448, !449, !450}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_u", scope: !446, file: !396, line: 287, baseType: !425, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !446, file: !396, line: 288, baseType: !391, size: 32, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !446, file: !396, line: 289, baseType: !37, size: 32, offset: 96)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_t", file: !396, line: 331, baseType: !428)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigvec", file: !396, line: 348, size: 128, elements: !453)
!453 = !{!454, !455, !456}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "sv_handler", scope: !452, file: !396, line: 349, baseType: !428, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "sv_mask", scope: !452, file: !396, line: 350, baseType: !37, size: 32, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "sv_flags", scope: !452, file: !396, line: 351, baseType: !37, size: 32, offset: 96)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigstack", file: !396, line: 367, size: 128, elements: !458)
!458 = !{!459, !460}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ss_sp", scope: !457, file: !396, line: 368, baseType: !61, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ss_onstack", scope: !457, file: !396, line: 369, baseType: !37, size: 32, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !462, line: 31, baseType: !31)
!462 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8b64ccf8c67b8c006b07b8daf1b49be5")
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !464, line: 31, baseType: !35)
!464 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "f0aa926da906b10566dd3171bf347ab7")
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !466, line: 31, baseType: !21)
!466 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "0254eb80c6b9719ac45c3c1cf872109b")
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !468, line: 31, baseType: !42)
!468 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "77fc5e91653260959605f129691cf9b1")
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !470, line: 29, baseType: !175)
!470 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "042ceedaf4137a8aaa272d0b27434016")
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !470, line: 30, baseType: !177)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !470, line: 31, baseType: !179)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !470, line: 32, baseType: !181)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !470, line: 33, baseType: !461)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !470, line: 34, baseType: !463)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !470, line: 35, baseType: !465)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !470, line: 36, baseType: !467)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !470, line: 40, baseType: !175)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !470, line: 41, baseType: !177)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !470, line: 42, baseType: !179)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !470, line: 43, baseType: !181)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !470, line: 44, baseType: !461)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !470, line: 45, baseType: !463)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !470, line: 46, baseType: !465)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !470, line: 47, baseType: !467)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !487, line: 32, baseType: !44)
!487 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_intmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e37b9240f30f486478152ef3989b1545")
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !489, line: 32, baseType: !58)
!489 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uintmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8217a3fbb207d8e87ca5318c313e81c2")
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !491, line: 34, size: 128, elements: !492)
!491 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "24f84d4e0450b2e5ff976a6f6da860d2")
!492 = !{!493, !494}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !490, file: !491, line: 36, baseType: !68, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !490, file: !491, line: 37, baseType: !85, size: 32, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "rlim_t", file: !496, line: 89, baseType: !41)
!496 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/resource.h", directory: "", checksumkind: CSK_MD5, checksum: "c4e799a130a69d94f00fda9cbd994906")
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage", file: !496, line: 152, size: 1152, elements: !498)
!498 = !{!499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ru_utime", scope: !497, file: !496, line: 153, baseType: !490, size: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ru_stime", scope: !497, file: !496, line: 154, baseType: !490, size: 128, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ru_maxrss", scope: !497, file: !496, line: 163, baseType: !44, size: 64, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ru_ixrss", scope: !497, file: !496, line: 165, baseType: !44, size: 64, offset: 320)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ru_idrss", scope: !497, file: !496, line: 166, baseType: !44, size: 64, offset: 384)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ru_isrss", scope: !497, file: !496, line: 167, baseType: !44, size: 64, offset: 448)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ru_minflt", scope: !497, file: !496, line: 168, baseType: !44, size: 64, offset: 512)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ru_majflt", scope: !497, file: !496, line: 169, baseType: !44, size: 64, offset: 576)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nswap", scope: !497, file: !496, line: 170, baseType: !44, size: 64, offset: 640)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ru_inblock", scope: !497, file: !496, line: 171, baseType: !44, size: 64, offset: 704)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "ru_oublock", scope: !497, file: !496, line: 172, baseType: !44, size: 64, offset: 768)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgsnd", scope: !497, file: !496, line: 173, baseType: !44, size: 64, offset: 832)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgrcv", scope: !497, file: !496, line: 174, baseType: !44, size: 64, offset: 896)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nsignals", scope: !497, file: !496, line: 175, baseType: !44, size: 64, offset: 960)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nvcsw", scope: !497, file: !496, line: 176, baseType: !44, size: 64, offset: 1024)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nivcsw", scope: !497, file: !496, line: 177, baseType: !44, size: 64, offset: 1088)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "rusage_info_t", file: !496, line: 200, baseType: !103)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v0", file: !496, line: 202, size: 768, elements: !517)
!517 = !{!518, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !516, file: !496, line: 203, baseType: !519, size: 128)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 128, elements: !90)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !516, file: !496, line: 204, baseType: !467, size: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !516, file: !496, line: 205, baseType: !467, size: 64, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !516, file: !496, line: 206, baseType: !467, size: 64, offset: 256)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !516, file: !496, line: 207, baseType: !467, size: 64, offset: 320)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !516, file: !496, line: 208, baseType: !467, size: 64, offset: 384)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !516, file: !496, line: 209, baseType: !467, size: 64, offset: 448)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !516, file: !496, line: 210, baseType: !467, size: 64, offset: 512)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !516, file: !496, line: 211, baseType: !467, size: 64, offset: 576)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !516, file: !496, line: 212, baseType: !467, size: 64, offset: 640)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !516, file: !496, line: 213, baseType: !467, size: 64, offset: 704)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v1", file: !496, line: 216, size: 1152, elements: !531)
!531 = !{!532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !530, file: !496, line: 217, baseType: !519, size: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !530, file: !496, line: 218, baseType: !467, size: 64, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !530, file: !496, line: 219, baseType: !467, size: 64, offset: 192)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !530, file: !496, line: 220, baseType: !467, size: 64, offset: 256)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !530, file: !496, line: 221, baseType: !467, size: 64, offset: 320)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !530, file: !496, line: 222, baseType: !467, size: 64, offset: 384)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !530, file: !496, line: 223, baseType: !467, size: 64, offset: 448)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !530, file: !496, line: 224, baseType: !467, size: 64, offset: 512)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !530, file: !496, line: 225, baseType: !467, size: 64, offset: 576)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !530, file: !496, line: 226, baseType: !467, size: 64, offset: 640)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !530, file: !496, line: 227, baseType: !467, size: 64, offset: 704)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_user_time", scope: !530, file: !496, line: 228, baseType: !467, size: 64, offset: 768)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_system_time", scope: !530, file: !496, line: 229, baseType: !467, size: 64, offset: 832)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pkg_idle_wkups", scope: !530, file: !496, line: 230, baseType: !467, size: 64, offset: 896)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_interrupt_wkups", scope: !530, file: !496, line: 231, baseType: !467, size: 64, offset: 960)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pageins", scope: !530, file: !496, line: 232, baseType: !467, size: 64, offset: 1024)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_elapsed_abstime", scope: !530, file: !496, line: 233, baseType: !467, size: 64, offset: 1088)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v2", file: !496, line: 236, size: 1280, elements: !550)
!550 = !{!551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !549, file: !496, line: 237, baseType: !519, size: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !549, file: !496, line: 238, baseType: !467, size: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !549, file: !496, line: 239, baseType: !467, size: 64, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !549, file: !496, line: 240, baseType: !467, size: 64, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !549, file: !496, line: 241, baseType: !467, size: 64, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !549, file: !496, line: 242, baseType: !467, size: 64, offset: 384)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !549, file: !496, line: 243, baseType: !467, size: 64, offset: 448)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !549, file: !496, line: 244, baseType: !467, size: 64, offset: 512)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !549, file: !496, line: 245, baseType: !467, size: 64, offset: 576)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !549, file: !496, line: 246, baseType: !467, size: 64, offset: 640)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !549, file: !496, line: 247, baseType: !467, size: 64, offset: 704)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_user_time", scope: !549, file: !496, line: 248, baseType: !467, size: 64, offset: 768)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_system_time", scope: !549, file: !496, line: 249, baseType: !467, size: 64, offset: 832)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pkg_idle_wkups", scope: !549, file: !496, line: 250, baseType: !467, size: 64, offset: 896)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_interrupt_wkups", scope: !549, file: !496, line: 251, baseType: !467, size: 64, offset: 960)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pageins", scope: !549, file: !496, line: 252, baseType: !467, size: 64, offset: 1024)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_elapsed_abstime", scope: !549, file: !496, line: 253, baseType: !467, size: 64, offset: 1088)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_bytesread", scope: !549, file: !496, line: 254, baseType: !467, size: 64, offset: 1152)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_byteswritten", scope: !549, file: !496, line: 255, baseType: !467, size: 64, offset: 1216)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v3", file: !496, line: 258, size: 1856, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !570, file: !496, line: 259, baseType: !519, size: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !570, file: !496, line: 260, baseType: !467, size: 64, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !570, file: !496, line: 261, baseType: !467, size: 64, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !570, file: !496, line: 262, baseType: !467, size: 64, offset: 256)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !570, file: !496, line: 263, baseType: !467, size: 64, offset: 320)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !570, file: !496, line: 264, baseType: !467, size: 64, offset: 384)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !570, file: !496, line: 265, baseType: !467, size: 64, offset: 448)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !570, file: !496, line: 266, baseType: !467, size: 64, offset: 512)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !570, file: !496, line: 267, baseType: !467, size: 64, offset: 576)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !570, file: !496, line: 268, baseType: !467, size: 64, offset: 640)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !570, file: !496, line: 269, baseType: !467, size: 64, offset: 704)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_user_time", scope: !570, file: !496, line: 270, baseType: !467, size: 64, offset: 768)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_system_time", scope: !570, file: !496, line: 271, baseType: !467, size: 64, offset: 832)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pkg_idle_wkups", scope: !570, file: !496, line: 272, baseType: !467, size: 64, offset: 896)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_interrupt_wkups", scope: !570, file: !496, line: 273, baseType: !467, size: 64, offset: 960)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pageins", scope: !570, file: !496, line: 274, baseType: !467, size: 64, offset: 1024)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_elapsed_abstime", scope: !570, file: !496, line: 275, baseType: !467, size: 64, offset: 1088)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_bytesread", scope: !570, file: !496, line: 276, baseType: !467, size: 64, offset: 1152)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_byteswritten", scope: !570, file: !496, line: 277, baseType: !467, size: 64, offset: 1216)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_default", scope: !570, file: !496, line: 278, baseType: !467, size: 64, offset: 1280)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_maintenance", scope: !570, file: !496, line: 279, baseType: !467, size: 64, offset: 1344)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_background", scope: !570, file: !496, line: 280, baseType: !467, size: 64, offset: 1408)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_utility", scope: !570, file: !496, line: 281, baseType: !467, size: 64, offset: 1472)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_legacy", scope: !570, file: !496, line: 282, baseType: !467, size: 64, offset: 1536)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_initiated", scope: !570, file: !496, line: 283, baseType: !467, size: 64, offset: 1600)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_interactive", scope: !570, file: !496, line: 284, baseType: !467, size: 64, offset: 1664)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_system_time", scope: !570, file: !496, line: 285, baseType: !467, size: 64, offset: 1728)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_system_time", scope: !570, file: !496, line: 286, baseType: !467, size: 64, offset: 1792)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v4", file: !496, line: 289, size: 2368, elements: !601)
!601 = !{!602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !600, file: !496, line: 290, baseType: !519, size: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !600, file: !496, line: 291, baseType: !467, size: 64, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !600, file: !496, line: 292, baseType: !467, size: 64, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !600, file: !496, line: 293, baseType: !467, size: 64, offset: 256)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !600, file: !496, line: 294, baseType: !467, size: 64, offset: 320)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !600, file: !496, line: 295, baseType: !467, size: 64, offset: 384)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !600, file: !496, line: 296, baseType: !467, size: 64, offset: 448)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !600, file: !496, line: 297, baseType: !467, size: 64, offset: 512)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !600, file: !496, line: 298, baseType: !467, size: 64, offset: 576)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !600, file: !496, line: 299, baseType: !467, size: 64, offset: 640)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !600, file: !496, line: 300, baseType: !467, size: 64, offset: 704)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_user_time", scope: !600, file: !496, line: 301, baseType: !467, size: 64, offset: 768)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_system_time", scope: !600, file: !496, line: 302, baseType: !467, size: 64, offset: 832)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pkg_idle_wkups", scope: !600, file: !496, line: 303, baseType: !467, size: 64, offset: 896)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_interrupt_wkups", scope: !600, file: !496, line: 304, baseType: !467, size: 64, offset: 960)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pageins", scope: !600, file: !496, line: 305, baseType: !467, size: 64, offset: 1024)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_elapsed_abstime", scope: !600, file: !496, line: 306, baseType: !467, size: 64, offset: 1088)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_bytesread", scope: !600, file: !496, line: 307, baseType: !467, size: 64, offset: 1152)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_byteswritten", scope: !600, file: !496, line: 308, baseType: !467, size: 64, offset: 1216)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_default", scope: !600, file: !496, line: 309, baseType: !467, size: 64, offset: 1280)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_maintenance", scope: !600, file: !496, line: 310, baseType: !467, size: 64, offset: 1344)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_background", scope: !600, file: !496, line: 311, baseType: !467, size: 64, offset: 1408)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_utility", scope: !600, file: !496, line: 312, baseType: !467, size: 64, offset: 1472)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_legacy", scope: !600, file: !496, line: 313, baseType: !467, size: 64, offset: 1536)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_initiated", scope: !600, file: !496, line: 314, baseType: !467, size: 64, offset: 1600)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_interactive", scope: !600, file: !496, line: 315, baseType: !467, size: 64, offset: 1664)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_system_time", scope: !600, file: !496, line: 316, baseType: !467, size: 64, offset: 1728)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_system_time", scope: !600, file: !496, line: 317, baseType: !467, size: 64, offset: 1792)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ri_logical_writes", scope: !600, file: !496, line: 318, baseType: !467, size: 64, offset: 1856)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ri_lifetime_max_phys_footprint", scope: !600, file: !496, line: 319, baseType: !467, size: 64, offset: 1920)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ri_instructions", scope: !600, file: !496, line: 320, baseType: !467, size: 64, offset: 1984)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cycles", scope: !600, file: !496, line: 321, baseType: !467, size: 64, offset: 2048)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_energy", scope: !600, file: !496, line: 322, baseType: !467, size: 64, offset: 2112)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_energy", scope: !600, file: !496, line: 323, baseType: !467, size: 64, offset: 2176)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interval_max_phys_footprint", scope: !600, file: !496, line: 324, baseType: !467, size: 64, offset: 2240)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ri_runnable_time", scope: !600, file: !496, line: 325, baseType: !467, size: 64, offset: 2304)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v5", file: !496, line: 328, size: 2432, elements: !639)
!639 = !{!640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !638, file: !496, line: 329, baseType: !519, size: 128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !638, file: !496, line: 330, baseType: !467, size: 64, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !638, file: !496, line: 331, baseType: !467, size: 64, offset: 192)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !638, file: !496, line: 332, baseType: !467, size: 64, offset: 256)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !638, file: !496, line: 333, baseType: !467, size: 64, offset: 320)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !638, file: !496, line: 334, baseType: !467, size: 64, offset: 384)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !638, file: !496, line: 335, baseType: !467, size: 64, offset: 448)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !638, file: !496, line: 336, baseType: !467, size: 64, offset: 512)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !638, file: !496, line: 337, baseType: !467, size: 64, offset: 576)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !638, file: !496, line: 338, baseType: !467, size: 64, offset: 640)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !638, file: !496, line: 339, baseType: !467, size: 64, offset: 704)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_user_time", scope: !638, file: !496, line: 340, baseType: !467, size: 64, offset: 768)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_system_time", scope: !638, file: !496, line: 341, baseType: !467, size: 64, offset: 832)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pkg_idle_wkups", scope: !638, file: !496, line: 342, baseType: !467, size: 64, offset: 896)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_interrupt_wkups", scope: !638, file: !496, line: 343, baseType: !467, size: 64, offset: 960)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pageins", scope: !638, file: !496, line: 344, baseType: !467, size: 64, offset: 1024)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_elapsed_abstime", scope: !638, file: !496, line: 345, baseType: !467, size: 64, offset: 1088)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_bytesread", scope: !638, file: !496, line: 346, baseType: !467, size: 64, offset: 1152)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_byteswritten", scope: !638, file: !496, line: 347, baseType: !467, size: 64, offset: 1216)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_default", scope: !638, file: !496, line: 348, baseType: !467, size: 64, offset: 1280)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_maintenance", scope: !638, file: !496, line: 349, baseType: !467, size: 64, offset: 1344)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_background", scope: !638, file: !496, line: 350, baseType: !467, size: 64, offset: 1408)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_utility", scope: !638, file: !496, line: 351, baseType: !467, size: 64, offset: 1472)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_legacy", scope: !638, file: !496, line: 352, baseType: !467, size: 64, offset: 1536)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_initiated", scope: !638, file: !496, line: 353, baseType: !467, size: 64, offset: 1600)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_interactive", scope: !638, file: !496, line: 354, baseType: !467, size: 64, offset: 1664)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_system_time", scope: !638, file: !496, line: 355, baseType: !467, size: 64, offset: 1728)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_system_time", scope: !638, file: !496, line: 356, baseType: !467, size: 64, offset: 1792)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ri_logical_writes", scope: !638, file: !496, line: 357, baseType: !467, size: 64, offset: 1856)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ri_lifetime_max_phys_footprint", scope: !638, file: !496, line: 358, baseType: !467, size: 64, offset: 1920)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ri_instructions", scope: !638, file: !496, line: 359, baseType: !467, size: 64, offset: 1984)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cycles", scope: !638, file: !496, line: 360, baseType: !467, size: 64, offset: 2048)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_energy", scope: !638, file: !496, line: 361, baseType: !467, size: 64, offset: 2112)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_energy", scope: !638, file: !496, line: 362, baseType: !467, size: 64, offset: 2176)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interval_max_phys_footprint", scope: !638, file: !496, line: 363, baseType: !467, size: 64, offset: 2240)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ri_runnable_time", scope: !638, file: !496, line: 364, baseType: !467, size: 64, offset: 2304)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ri_flags", scope: !638, file: !496, line: 365, baseType: !467, size: 64, offset: 2368)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage_info_v6", file: !496, line: 368, size: 3712, elements: !678)
!678 = !{!679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ri_uuid", scope: !677, file: !496, line: 369, baseType: !519, size: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_time", scope: !677, file: !496, line: 370, baseType: !467, size: 64, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_time", scope: !677, file: !496, line: 371, baseType: !467, size: 64, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pkg_idle_wkups", scope: !677, file: !496, line: 372, baseType: !467, size: 64, offset: 256)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interrupt_wkups", scope: !677, file: !496, line: 373, baseType: !467, size: 64, offset: 320)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pageins", scope: !677, file: !496, line: 374, baseType: !467, size: 64, offset: 384)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ri_wired_size", scope: !677, file: !496, line: 375, baseType: !467, size: 64, offset: 448)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ri_resident_size", scope: !677, file: !496, line: 376, baseType: !467, size: 64, offset: 512)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ri_phys_footprint", scope: !677, file: !496, line: 377, baseType: !467, size: 64, offset: 576)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_start_abstime", scope: !677, file: !496, line: 378, baseType: !467, size: 64, offset: 640)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ri_proc_exit_abstime", scope: !677, file: !496, line: 379, baseType: !467, size: 64, offset: 704)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_user_time", scope: !677, file: !496, line: 380, baseType: !467, size: 64, offset: 768)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_system_time", scope: !677, file: !496, line: 381, baseType: !467, size: 64, offset: 832)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pkg_idle_wkups", scope: !677, file: !496, line: 382, baseType: !467, size: 64, offset: 896)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_interrupt_wkups", scope: !677, file: !496, line: 383, baseType: !467, size: 64, offset: 960)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_pageins", scope: !677, file: !496, line: 384, baseType: !467, size: 64, offset: 1024)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ri_child_elapsed_abstime", scope: !677, file: !496, line: 385, baseType: !467, size: 64, offset: 1088)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_bytesread", scope: !677, file: !496, line: 386, baseType: !467, size: 64, offset: 1152)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ri_diskio_byteswritten", scope: !677, file: !496, line: 387, baseType: !467, size: 64, offset: 1216)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_default", scope: !677, file: !496, line: 388, baseType: !467, size: 64, offset: 1280)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_maintenance", scope: !677, file: !496, line: 389, baseType: !467, size: 64, offset: 1344)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_background", scope: !677, file: !496, line: 390, baseType: !467, size: 64, offset: 1408)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_utility", scope: !677, file: !496, line: 391, baseType: !467, size: 64, offset: 1472)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_legacy", scope: !677, file: !496, line: 392, baseType: !467, size: 64, offset: 1536)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_initiated", scope: !677, file: !496, line: 393, baseType: !467, size: 64, offset: 1600)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cpu_time_qos_user_interactive", scope: !677, file: !496, line: 394, baseType: !467, size: 64, offset: 1664)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_system_time", scope: !677, file: !496, line: 395, baseType: !467, size: 64, offset: 1728)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_system_time", scope: !677, file: !496, line: 396, baseType: !467, size: 64, offset: 1792)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ri_logical_writes", scope: !677, file: !496, line: 397, baseType: !467, size: 64, offset: 1856)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ri_lifetime_max_phys_footprint", scope: !677, file: !496, line: 398, baseType: !467, size: 64, offset: 1920)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ri_instructions", scope: !677, file: !496, line: 399, baseType: !467, size: 64, offset: 1984)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ri_cycles", scope: !677, file: !496, line: 400, baseType: !467, size: 64, offset: 2048)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ri_billed_energy", scope: !677, file: !496, line: 401, baseType: !467, size: 64, offset: 2112)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ri_serviced_energy", scope: !677, file: !496, line: 402, baseType: !467, size: 64, offset: 2176)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interval_max_phys_footprint", scope: !677, file: !496, line: 403, baseType: !467, size: 64, offset: 2240)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ri_runnable_time", scope: !677, file: !496, line: 404, baseType: !467, size: 64, offset: 2304)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ri_flags", scope: !677, file: !496, line: 405, baseType: !467, size: 64, offset: 2368)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ri_user_ptime", scope: !677, file: !496, line: 406, baseType: !467, size: 64, offset: 2432)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ri_system_ptime", scope: !677, file: !496, line: 407, baseType: !467, size: 64, offset: 2496)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pinstructions", scope: !677, file: !496, line: 408, baseType: !467, size: 64, offset: 2560)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ri_pcycles", scope: !677, file: !496, line: 409, baseType: !467, size: 64, offset: 2624)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ri_energy_nj", scope: !677, file: !496, line: 410, baseType: !467, size: 64, offset: 2688)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ri_penergy_nj", scope: !677, file: !496, line: 411, baseType: !467, size: 64, offset: 2752)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ri_secure_time_in_system", scope: !677, file: !496, line: 412, baseType: !467, size: 64, offset: 2816)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ri_secure_ptime_in_system", scope: !677, file: !496, line: 413, baseType: !467, size: 64, offset: 2880)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ri_neural_footprint", scope: !677, file: !496, line: 414, baseType: !467, size: 64, offset: 2944)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ri_lifetime_max_neural_footprint", scope: !677, file: !496, line: 415, baseType: !467, size: 64, offset: 3008)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ri_interval_max_neural_footprint", scope: !677, file: !496, line: 416, baseType: !467, size: 64, offset: 3072)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ri_reserved", scope: !677, file: !496, line: 417, baseType: !728, size: 576, offset: 3136)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 576, elements: !729)
!729 = !{!730}
!730 = !DISubrange(count: 9)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "rusage_info_current", file: !496, line: 420, baseType: !677)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rlimit", file: !496, line: 464, size: 128, elements: !733)
!733 = !{!734, !735}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_cur", scope: !732, file: !496, line: 465, baseType: !495, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_max", scope: !732, file: !496, line: 466, baseType: !495, size: 64, offset: 64)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "proc_rlimit_control_wakeupmon", file: !496, line: 499, size: 64, elements: !737)
!737 = !{!738, !739}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "wm_flags", scope: !736, file: !496, line: 500, baseType: !465, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "wm_rate", scope: !736, file: !496, line: 501, baseType: !179, size: 32, offset: 32)
!740 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "wait", file: !20, line: 194, size: 32, elements: !741)
!741 = !{!742, !743, !750}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "w_status", scope: !740, file: !20, line: 195, baseType: !37, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "w_T", scope: !740, file: !20, line: 212, baseType: !744, size: 32)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !740, file: !20, line: 199, size: 32, elements: !745)
!745 = !{!746, !747, !748, !749}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "w_Termsig", scope: !744, file: !20, line: 201, baseType: !21, size: 7, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "w_Coredump", scope: !744, file: !20, line: 202, baseType: !21, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "w_Retcode", scope: !744, file: !20, line: 203, baseType: !21, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "w_Filler", scope: !744, file: !20, line: 204, baseType: !21, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "w_S", scope: !740, file: !20, line: 229, baseType: !751, size: 32)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !740, file: !20, line: 218, size: 32, elements: !752)
!752 = !{!753, !754, !755}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "w_Stopval", scope: !751, file: !20, line: 220, baseType: !21, size: 8, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "w_Stopsig", scope: !751, file: !20, line: 221, baseType: !21, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "w_Filler", scope: !751, file: !20, line: 222, baseType: !21, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "ct_rune_t", file: !757, line: 32, baseType: !46)
!757 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_ct_rune_t.h", directory: "", checksumkind: CSK_MD5, checksum: "c22112154646d7509ef295660b838a0e")
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "rune_t", file: !759, line: 31, baseType: !63)
!759 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_rune_t.h", directory: "", checksumkind: CSK_MD5, checksum: "f2344ffb16201340bfd175b1637ea60f")
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !761, line: 53, baseType: !62)
!761 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_wchar_t.h", directory: "", checksumkind: CSK_MD5, checksum: "7c8733b31e382e8074a475f5c41f1e03")
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !763, line: 83, size: 64, elements: !764)
!763 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "1fbf79127e45bcc71ac6e64ce165d68a")
!764 = !{!765, !766}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !762, file: !763, line: 84, baseType: !37, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !762, file: !763, line: 85, baseType: !37, size: 32, offset: 32)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !763, line: 86, baseType: !762)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !763, line: 88, size: 128, elements: !769)
!769 = !{!770, !771}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !768, file: !763, line: 89, baseType: !44, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !768, file: !763, line: 90, baseType: !44, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !763, line: 91, baseType: !768)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !763, line: 94, size: 128, elements: !774)
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !773, file: !763, line: 95, baseType: !40, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !773, file: !763, line: 96, baseType: !40, size: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !763, line: 97, baseType: !773)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "malloc_type_id_t", file: !779, line: 30, baseType: !42)
!779 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/malloc/_malloc_type.h", directory: "", checksumkind: CSK_MD5, checksum: "d42ade5b4592df6ab4d40d7d5990e609")
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "malloc_zone_t", file: !779, line: 63, baseType: !781)
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "_malloc_zone_t", file: !779, line: 63, flags: DIFlagFwdDecl)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !783, line: 31, baseType: !72)
!783 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_dev_t.h", directory: "", checksumkind: CSK_MD5, checksum: "48c1388efd95518803dfc92f7c613390")
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !785, line: 31, baseType: !81)
!785 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_mode_t.h", directory: "", checksumkind: CSK_MD5, checksum: "9d25d351341bf46798d552a73c506c13")
!786 = !{!0, !7, !12}
!787 = !{i32 7, !"Dwarf Version", i32 5}
!788 = !{i32 2, !"Debug Info Version", i32 3}
!789 = !{i32 1, !"wchar_size", i32 4}
!790 = !{i32 8, !"PIC Level", i32 2}
!791 = !{i32 7, !"uwtable", i32 1}
!792 = !{i32 7, !"frame-pointer", i32 1}
!793 = !{!"Homebrew clang version 19.1.4"}
!794 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 3, type: !795, scopeLine: 3, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !797)
!795 = !DISubroutineType(types: !796)
!796 = !{!37}
!797 = !{}
!798 = !DILocalVariable(name: "id", scope: !794, file: !2, line: 4, type: !37)
!799 = !DILocation(line: 4, column: 9, scope: !794)
!800 = !DILocalVariable(name: "n", scope: !794, file: !2, line: 5, type: !37)
!801 = !DILocation(line: 5, column: 9, scope: !794)
!802 = !DILocation(line: 6, column: 5, scope: !794)
!803 = !DILocalVariable(name: "s", scope: !794, file: !2, line: 7, type: !37)
!804 = !DILocation(line: 7, column: 9, scope: !794)
!805 = !DILocalVariable(name: "i", scope: !806, file: !2, line: 8, type: !37)
!806 = distinct !DILexicalBlock(scope: !794, file: !2, line: 8, column: 5)
!807 = !DILocation(line: 8, column: 14, scope: !806)
!808 = !DILocation(line: 8, column: 10, scope: !806)
!809 = !DILocation(line: 8, column: 18, scope: !810)
!810 = distinct !DILexicalBlock(scope: !806, file: !2, line: 8, column: 5)
!811 = !DILocation(line: 8, column: 20, scope: !810)
!812 = !DILocation(line: 8, column: 19, scope: !810)
!813 = !DILocation(line: 8, column: 5, scope: !806)
!814 = !DILocation(line: 9, column: 14, scope: !815)
!815 = distinct !DILexicalBlock(scope: !810, file: !2, line: 8, column: 26)
!816 = !DILocation(line: 9, column: 11, scope: !815)
!817 = !DILocation(line: 10, column: 5, scope: !815)
!818 = !DILocation(line: 8, column: 23, scope: !810)
!819 = !DILocation(line: 8, column: 5, scope: !810)
!820 = distinct !{!820, !813, !821, !822}
!821 = !DILocation(line: 10, column: 5, scope: !806)
!822 = !{!"llvm.loop.mustprogress"}
!823 = !DILocation(line: 11, column: 31, scope: !794)
!824 = !DILocation(line: 11, column: 35, scope: !794)
!825 = !DILocation(line: 11, column: 5, scope: !794)
!826 = !DILocation(line: 13, column: 18, scope: !794)
!827 = !DILocation(line: 13, column: 5, scope: !794)
!828 = !DILocation(line: 14, column: 1, scope: !794)
